{
    "question_id": "8b54c1d1-b77c-4a33-8ba0-f0c64b57a8d7",
    "question": "מה היה עניין גלות יוסף במצרים",
    "selected_passages": [
        {
            "section": "Torah",
            "topic": "Vayeshev",
            "number": "14",
            "passage": "וירד יהודה מאת אחיו. במד\\\"ר רשב\\\"נ פתח כי אנכי ידעתי את המחשבות כו' שבטים היו עסוקים במכירתו של יוסף. ויוסף היה עסוק בשקו ותעניתו וכו' והקב\\\"ה היה עוסק ובורא אורו של משיח ע\\\"כ. הנה יש להעיר בדברי המאמר הזה מהו שייכות יש לכל דברי הצומות והשקים של הצדיקים הללו לברא אורו של משיח וכי לא היה עוד זמן אחר טוב ונרצה לפני הש\\\"י ב\\\"ה להוציא אורו הגדול רק בזמן הזה שכל בני יעקב חגרו שקים ואביהם עמהם. אולם כאשר נעמוד להתבונן מעט על חוקי הנהגת העולם עפ\\\"י הש\\\"י מתחלת הבריאה עד עתה. הנה זה מצאנו ראינו כי כל עניני עוה\\\"ז לא יכלו לצאת אל הפועל הגמור והתכלית האמיתי זולת אחרי ההעדר המוחלט ושיוקדם להם האין הכללי וכמ\\\"ש חכז\\\"ל ההעדר קודם להויה ר\\\"ל כי בחי' ההעדר הוא בהכרח קודם למציאת ההוי' והוא הסיבה למציאת ההו' שיבא אח\\\"כ וכמו שנראה זה בתבואת הזרע אשר לא יעלו ולא יצמיחו זולת אחר הרקבון הגמור בעפר כולו. והנה כן הענין היה בתחלת הבריאה האור שבא מכח החשך הקדום לו כמ\\\"ש והארץ היתה תהו ובהו וחשך ויאמר אלהים יהי אור כי מציאת החשך הוא הסיבה לאור וכן ויהי ערב ויהי בקר מבחי' הערב יבא הבקר אחריו. וזהו יוצר אור ובורא חשך ע\\\"י שבורא החשך תחלה עי\\\"כ יצא האור ובקר אחריו להתגלות. וז\\\"ש יתרון החכמה מן הסכלות כיתרון האור מן החשך ר\\\"ל כמו שיתרון האור לא יכול להיות רק אחר מציאת החשך הקדום לו וממנו יוצא האור וזהו מן החשך עצמו יצא האור כן יתרון החכמה תבא לאדם רק מבחי' הסכלות עצמה. פי' שיעשה האדם עצמו כסכל לעולם ולא יהיה נחשב בעיניו לכלום. אז יגיע למעלת החכמה האמיתית כמ\\\"ש א\\\"א ע\\\"ה הנה נא הואלתי לדבר אל ה' ואנכי עפר ואפר ר\\\"ל מה שהואלתי לדבר הוא יען כי אני יודע בעצמי כי הנני עפר ואפר וז\\\"ש אצל מתן תורה ויהי בשמעכם את הקול מתוך החשך. יש להבין מה אשמעינן בזה בשמיעת הקול מתוך החשך ולא נאמר מתוך האש כמו בזולתו. אך בהיות המעמד המובחר ההוא של מתן תורה התכלית המכוון והקיום האמיתי של בריאת העולם כולו הנה לא יכלו בנ\\\"י לקבל את האור הגדול ההוא זולת ע\\\"י סיבת החשך הקדום לו למציאת האור כמו שהיה כן אצל תחלת הבריאה וחשך על פני תהום ויאמר אלהים יהי אור. נמצא כי אך הסיבה העצמיות לתכלית הויות האור הוא החשך הקדום לו. והנה כזה הוא התכלית למציאת אור ה' נשפע על האדם הוא רק ע\\\"י בחינת החשך אשר תוקדם לו לעולם. אשר ידע ויבין בדעו ושכלו גודל חשכת נפשו כמה הוא מגשש באפילה ובמה נחשב הוא אז עי\\\"כ יזכה אשר השי\\\"ת ב\\\"ה יוציאנו מאפילה לאור גדול כמ\\\"ש אני אשכון את דכא והוא שרמזו רז\\\"ל במשנה במס' נגעים פרק ב' מי שהוא בבית אפל אין פותחין לו חלונות לראות את נגעו. ר\\\"ל מי שהוא בבית אפל על מעשיו אשר לא טובים אין פותחין חלונות שיראו אחרים בנוולתו ונגעי לבבו כי אם הוא ישב בחשך ה' אור לו. וכן אמרו עוד שם במשנה אין רואים את הנגעים שחרית ובין הערבים. ר\\\"ל בזמן תפלת שחרית ובין הערבים לא יבקר אז האדם אחרי נגעי לבבו פן יתעצב אל לבו ולא יהיה יכול להתפלל כדת אך יבחר לו זמן אחר מזמנים הידועים הראוים לכל אלה. נחזור לעניננו הנה מציאת ההעדר הוא הסיבה להויה זהו ג\\\"כ ענין המיתה ר\\\"ל שנקנסה על האדם אשר אחריה נקוה לשוב ולהחיות עוד בתחיית המתים אשר לכאורה אין להבין למה צורך להמית ולהחיות אח\\\"כ טוב היה להניח מזה ומזה ושיחיה האדם לעולם ואם בעבור מירוק העון הלא הרבה צדיקים שמתו בלא עון רק מעטיו של נחש. אך הכוונה הוא ג\\\"כ כנ\\\"ל בהיות כי התכלית הנרצה מה שיהיה לעתיד שיתגלה כבוד מלכותו ית\\\"ש לעיני כל בשר באורו הגדול לכן אין בכח מציאת מין האנושי בעוה\\\"ז לקבל האור הגדול רק ע\\\"י ההעדר הקדום לו במיתה הזאת עתה שהיא הקדמה וסיבת קבלת האור ההיא של תחה\\\"מ. וזהו שסמוך לברכת מחיה מתים קדושת השם נקדישך ונעריצך כסוד שיח שרפי קודש. הכוונה כי אז בתחה\\\"מ נקדישך גם אנחנו כמו שמקדישים אותך בסוד שיח שרפי קודש. ואז כתר יתנו לך מלאכים המוני מעלה עם ישראל קבוצי מטה כי אתה קדוש ושמך קדוש וקדושים בכל יום יהללוך סלה. לכן גם אנחנו מקווי' ומצפים להלל אותך בסוד קדושים הללו. נמצא כי בחי' המיתה הקודמת בבחי' החשך לקבל' האור העתיד וזהו שאנו אומרים מלך ממית ומחיה ומצמיח ישועה. ר\\\"ל מה שהוא ממית הוא כדי להחיות אחר כך כשיצמיח ישועה בקרוב. וז\\\"ש חכז\\\"ל החיים למות והמתים להחיות. ולכאורה קשה מי לא ידע בכל אלה ומהו משמיענו בזה. אך הכוונה כנ\\\"ל מה שהחיים למות הוא כדי שהמתים להחיות בתוקף אור הגדול ביתר שאת ויתר עוז. וזהו שאמרו חכז\\\"ל והנה טוב מאד זה המה\\\"מ כי הוא טוב מאד להיותו הסיבה המיתה וההעדר הכנה לביאת האור הגדול לנפשות העתידים לעמוד בתחה\\\"מ כנ\\\"ל. וכענין הזה הוא שהיה אצל האמהות הקדושות אשר היו עקרות זמן הרב קודם לידתן עד בואם בשנים בקצה האחרון רק אז נפתחו רחמם כמו שרה לא זכתה להריון עד בלותה עפ\\\"י נס. וכן רבקה ורחל ויוכבד היא עלתה על כלנה עד היותה בת ק\\\"ל שנה. וזה קשה להבין למה היתה כזאת שעכבום הש\\\"י עד קצה האחרון. אך כדברינו נכון כי אחרי אשר ראו להאמהות הקדושות האלו להוליד נשמות הקדושות האלו נפשות הצדיקים המאורות הגדולים ההם. הנה לא יתכן להם להוציא האור זולת אחרי ההעדר הקודם לכן המתין להם הקב\\\"ה עד עת זקנתן עד שלא חשבו עוד להיות להם זרע כלל ומן החשך ההוא הוציא להם אור גדול כמשרע\\\"ה והאבות הקדושים ע\\\"ה. והנה כן היה הדבר בהנהגת הש\\\"י עם עמו בנ\\\"י בגלותינו אשר בכל עת ענינו ומרודינו כשהם לוחצים אותנו עד מאד רק אז מן החשך מושיע להם ומוציאם לאור גדול וזהו שצעק הנביא כמו ההרה תקריב ללדת תחיל ותזעק בחבלי' כן היינו מפניך ה' דהנה ההרה הקרובה ללדת גם היא לא תוליד עד אשר תבוא אז בהסכנה העצומה ותגדל חבליה מאד אז בקצה האחרון יושיע לה הש\\\"י כן אנחנו חלנו ואין בנו עוד כח ללידה כמו ילדנו רוח. וזה הוא ענין משיח צדקנו שאמרו חכז\\\"ל כי ביום שנחרב הבהמ\\\"ק נולד משיח וביום שחשב הש\\\"י להשחית חומת ירושלים נטה קו על בנין העתיד כי בהיות החורבן ההוא יום בכי ומספד אף בבתי גואי אשר כמהו לא יהיה עוד אח\\\"כ לכן ביום ההוא מחמת החשך וההעדר ההיא יצא משיח. והנה זה ג\\\"כ ביאור המד\\\"ר הנ\\\"ל כי פרץ וזרח שניהם מורים על משיחנו שיבא ב\\\"ב לכן רק בעת החשך ההוא שכל בית יעקב היו אגודים בצרה בשקם ותעניתם אז זרח בחשך אור לישרים ולהוציא הקב\\\"ה אז אורו של משיחנו ב\\\"ב אמן:",
            "english_translation": "And Judah went down from his brothers. In the Midrash Rabbah, Rabbi Shimon ben Nachman opened with \"For I know the thoughts etc.\" The tribes were occupied with selling Joseph, and Joseph was occupied with his sackcloth and fasting etc., and the Holy One Blessed be He was occupied with creating the light of the Messiah. Behold, one must note regarding this statement what connection exists between all the fasting and sackcloth of these righteous ones to create the light of the Messiah, and was there not another good and favorable time before the Lord Blessed be He to bring forth His great light except at this time when all of Jacob's sons wore sackcloth along with their father. However, when we stand to contemplate a bit about the laws of world governance according to the Lord from the beginning of creation until now, we have found and seen that all matters of this world could not come to complete actualization and true purpose except after absolute absence and that general nothingness must precede them, as our Sages said absence precedes existence, meaning that the aspect of absence necessarily precedes the existence of being and it is the cause for the existence that comes afterward, as we see with grain seeds which will not sprout or grow except after complete decomposition in the soil. And so it was at the beginning of creation - the light that came from the power of darkness that preceded it, as it is written \"And the earth was formless and void and darkness\" and \"God said let there be light, \" for the existence of darkness is the cause for light, and so \"there was evening and there was morning\" - from the aspect of evening comes morning after it. And this is \"forms light and creates darkness\" - through creating darkness first, through this light emerges and morning follows to be revealed.",
            "average_score": 9.0,
            "reference": "Tiferet Shlomo, on Torah, Vayeshev 14"
        },
        {
            "section": "Torah",
            "topic": "Miketz",
            "number": "14",
            "passage": "מכי\\\"קאם כנים אתם אחיכם אחד יאסר כו' ואתם לכו הביאו שבר רעבון בתיכם ואת אחיכם הקטן תביאו אלי ויאמנו דבריכם וכו'. הנה יש לשום לב על התימה הגדולה שכבר הקשו בה הראשונים ז\\\"ל למה לא הודיע יוסף לאביו כי עודנו חי והוא מושל בארץ מצרים. האמנם כי טרם באו אחיו אליו לא יכול להודיעו מפני החרם וקיום החלומות שהיו צריכין אחיו לבא אליו. אבל כאשר כבר באו אחיו הלום היה לו להתוודעות להם מיד למען החיות רוח אביו הזקן איזו ימים קודם ולא לצערו עוד יותר בבנימין כי לפי האמת מה צורך היה לו בבנימין לבא אליו תחלה למצרי'. אמנם הנה כבר נודע ומובא בזוה\\\"ק ובספרים כי כל ענין הזה של מכירת יוסף הוא רמוז על סודות נשגבים ונוראים. הנה כן יש לרמז בזה כי ענין גלות יוסף למצרים ואשר התוודע אל אחיו וכל הענין הכל הוא ברמז על גלות האחרון ועל הגאולה שאנו מחכים אליה במהרה. והנה ביאת בנימין למצרים ואח\\\"כ התוודע יוסף אל אחיו זה רומז על אליהו הנביא כמו שכתוב בספר הגלגולים שנשמת אליהו הנביא שיורדת לעוה\\\"ז הוא נשמת בחי' בנימין כמו שאמר אליהו לחכמים מבני בניה של רחל אני. והוא שכתוב הנה אנכי שולח לכם את אליה הנביא לפני בא יום ה' כמו שבגלות מצרים הוצרך בנימין לבא לפני התוודעו' יוסף. והנה יוסף הוא רמוז על משיח בן יוסף וז\\\"ש האיש אשר נמצא הגביע בידו הגבי\\\"ע גימ' צ' כמבו' בזוה\\\"ק כי בנימין הוא צדיק במקום יוסף דהיינו יסוד של יעקב כמ\\\"ש אלה תולדות יעקב יוסף כנודע. וז\\\"ש הגבי\\\"ע ביד\\\"ו ביו\\\"ד הוא יסוד. וז\\\"ש הוא יהיה לי עבד הוא רמז על העתיד כמ\\\"ש ביום ההוא יהיה ה' אחד. כי לעתיד יהיה השם בשני יודי\\\"ן וזה הו\\\"א יהי\\\"ה. והנה זה שכתוב והוא נחש ינחש בו כי נחש ינחש איש אשר כמוני נחש גימט' משי\\\"ח כי כשנשכח הנו\\\"ן של נח\\\"ש נעשה משי\\\"ח וזהו נחש בן יוסף הוא משיח בן יוסף כנ\\\"ל איש אשר כמוני כמו יוסף שהיה בגלות ואח\\\"כ למחיה שלחני אלהים לפניכם ויכלכל יוסף את אחיו. הים ראה וינס ארונו של יוסף ראה. כן המשיח של העתיד. ובהגלות הוא חליינו הוא נשא והיינו חבלו של משיח כמבואר בזוהר ובספרים. ולזה הטמין הגביע באמתחת בנימין שהוא נשמת אליהו הנביא. וזה שמסיים אח\\\"כ ואתם עלו לשלום אל אביכם. היינו שע\\\"י בנימין ויוסף שהוא אליהו ומשיח בן יוסף עלו לשלום אל אביכם יהיה הגאולה ב\\\"ב. ואח\\\"כ ויגש אליו יהודה היינו משיח בן דוד שבא מיהודה. כי משיח בן יוסף הוא תיקון היסוד של כל העולמות ומשיח בן דוד הוא יתקן ספירת המלכות שהוא שם אדנ\\\"י כנודע והאר פניך על מקדשך השמם למען אדני היינו שם אדנ\\\"י שהוא בית המקדש. ולזה היה שבט יהודה ובנימין שותפים בחלק הבהמ\\\"ק כמבואר בתנ\\\"ך ובגמרא שחלקו של יהודה היה אוכל אמה במזרח ודרום של המזבח שזה מרמז לעתיד שע\\\"י שניהם אליהו ומשיח יהי' הגאולה ב\\\"ב. גם מבואר בספר הגלגולים שגם נשמת יוסף היה באליהו ונשמת בנימין היא היורדת לצדיקים ולומד עמהם ועושה נסים לצדיקים ולזה הוצרך לבנימין למצרים קודם התוודעות יוסף לאחיו שהוא הגאולה באותו הזמן. ולזה אמר לו אלהים יחנך בני. וזהו ותרב משאת בנימין היינו שיוסף נתן לו חלק מנשמתו כנ\\\"ל. ולזה במרדכי ואסתר שהיה איש ימיני נאמר וגם חרבונה זכור לטוב ואמרו חכז\\\"ל שזה היה אליהו כי הוא איש ימיני כנ\\\"ל. וזהו הרמז במס' בבא בתרא דף י\\\"א בבנימין הצדיק שהחיה אשה ושבעה בניה. היינו בנימין שהיה צדיק במקום יוסף כנ\\\"ל החיה השכינה ושבעה ימי הבנין שלה מחסד עד המלכות. והבן:",
            "english_translation": "If you are honest, one of your brothers will be imprisoned, and you go bring grain for the hunger of your houses, and bring your youngest brother to me, and your words will be verified. Behold, one must consider the great puzzle that the early sages already questioned - why did Joseph not inform his father that he was still alive and ruling in Egypt. Indeed, before his brothers came to him he could not inform him because of the ban and fulfillment of the dreams that required his brothers to come to him. But when his brothers had already come there, he should have revealed himself to them immediately to revive his elderly father's spirit some days earlier and not cause him additional anguish over Benjamin, for in truth what need did he have for Benjamin to come to Egypt first.",
            "average_score": 9.0,
            "reference": "Tiferet Shlomo, on Torah, Miketz 14"
        },
        {
            "section": "Torah",
            "topic": "Vayeshev",
            "number": "4",
            "passage": "וישראל אהב את יוסף מכל אחיו ועשה לו כתונת פסים. ויקנאו בו אחיו וכו'. בגמ' שבת דף י' בשביל משקל ב' סלעים מילת שנתן יעקב ליוסף יותר משאר בניו נתקנאו בו אחיו ונתגלגל הדבר וירדו אבותינו למצרים. הנה הדברים האלו לפי פשוטן אין להם שחר. האם יתכן בקדושי עליון שבטי י\\\"ה כי יתקנאו עבור ב' סלעים מילת וכתונת. אמנם שורש הענין הוא ע\\\"ד שכתוב והבדילה הפרכת לכם בין הקודש ובין קודש קדשים למה הוצרך עוד הפרכת להבדלה הלא כבר מקודש החצר והמשכן עד מאד ומה תוסף עוד הפרכת להבדלה יכול להיות קדשי קדשים בלא הבדלה מהפרכת. אולם להבין זה הנה ידוע לי\\\"ח מענין הצמצום הרבים אשר בשעת בריאת עולם כדי שיוכלו העולמות למטה. להכיל אור א\\\"ם ב\\\"ה כי יש כמה וכמה אלפים ורבבות עולמות למעלה מעולם האצילות בבחי' לבושים זה בתוך זה וכן בד' עולמות אבי\\\"ע יש בהם שבא האור ההוא למטה דרך חלון ומסך ולבוש והיכלות כי זה בלא זה לא היו יכולין לקבל האור המתנוצץ עד עולם העשי' וממנו לעולם השפל הזה ג\\\"כ כזה כי שמש ומגן ה' כו' ד\\\"מ כמו אור השמש אשר לא יוכלו הבריאים להנות ממנו ולקבל אורו הגדול רק ע\\\"י מעבר החלון ומסך והיכלות. והנה בזמן שהי' בהמ\\\"ק קיים ואור ה' הופיע על הבהמ\\\"ק בקדשי קדשים בשפע רב לא הי' העולם יכול לסבול ולקבל האור היוצא בביהמ\\\"ק לכן הוצרך הפרכת להבדלה ד\\\"מ למען יוכלו הבריות לקבל אור השפע העליון אחרי מסך הפרכת והאולם וההיכל. וכן הי' הענין בבגדי כהונה (של)הכה\\\"ג חושן אפוד וכתונת וכו' להיות דוגמת האדם העליון והאורות החסדים בוקעים ומאירים בו הוצרך לבגדים יתירים האלו כמבואר בכתבי האריז\\\"ל סוד הלבושים. אך כאשר נכנם לפני ולפנים הי' לבוש רק ד' בגדים דוגמת ד' עולמות אבי\\\"ע. ולכך כה\\\"ג המחוסר בגדים פסול לעבודה. וזה הי' ג\\\"כ ענין הכתוב ופרשו עליו בגד תכלת וכסו בה את ארון העדות. בהיות הארון מקום השראת הקדושה האור העליון הוצרך הכיסוי תכלת שהוא בחי' צמצום כי תכלת דומה לכסא כבוד בחי' היראה כמבואר בזוה\\\"ק דתכלת היא תכלא דשצי כולא והוא בחי' גבורה והוא בחי' לבוש לצמצם האור כנ\\\"ל. וזה ג\\\"כ ענין המשמורות כהונה ולווי' שהיו בבהמ\\\"ק כי גם הלוים הי' בבחי' גבורה וצמצום על אור החסד שהיו הכהנים משפיעים לבל יצאו החוצה ואל יבוזו זרים והוא הענין התכלת האמור בציצית ונתנו על ציצית הכנף פתיל תכלת. שאור הציצית יהי' בחי' צמצום נגד החיצונים. כי ע\\\"ז מורה ענין התכלת בחי' גבורה וצמצום. וז\\\"ש בלשם יחוד בעטיפת הטלית. ובזכות מצות ציצית תנצל נפשי וכו' והטלית יפרוש כנפיו עליהם. כי הטלית הוא בחי' אור המקיף להנצל מן החיצונים. ולכך מתעטפין בטלית בשעת התפלה על התפילין לצמצם האורות של התפילין. וזש\\\"א מה יקר חסדך וכו' ואח\\\"כ משוך חסדך ליודעיך פי' אחר שנתעטף בטלית לצמצם החסדים מן החיצונים אז משוך חסדך ליודעיך כנ\\\"ל. ונחזור לענינינו. הנה כי זה הי' סוד כתונת יוסף שעשה לו אביו כתונת פסים. ומבואר במדרש שעשה לו ד' בגדים הרמז סוד לבושים הנ\\\"ל שהי' כה\\\"ג לובש בהם כי אמנם ידוע היות יוסף בחי' היסוד מכל העולמות צי\\\"ע והוא צנור ההשפעות. וכח הצדיק לצמצם ההשפעות לבל יתפשטו בין החיצונים כמ\\\"ש כי בן זקונים הוא לו. וזה שעשה לו אביו כתונת פסים ד' לבושים הנ\\\"ל בסוד ד' עולמות אבי\\\"ע כי יעקב ויוסף הם הצי\\\"ע כמ\\\"ש בווין תתקטר תרין ווי\\\"ן לכך הי' צריך הלבוש להיות נעשה ע\\\"י יעקב בעצמו לקשר ולדבק בו בחי' צי\\\"ע ולהיות מסך להשפעה העוברת על ידו להשמר מן החיצונים כמ\\\"ש שומר ה' את כל אוהביו. דלכאורה תיבת כל הוא מיותר. אך ידוע כי כל רומז לצי\\\"ע וכאשר הש\\\"י שומר ההשפעות ע\\\"י בחי' כל הוא הצדיק. אזי ממילא כל הרשעים ישמיד וכידוע ענין סוד כתונת אור של אדה\\\"ר להיות בסוד הלבישה כנ\\\"ל. וזה שאמרו חכז\\\"ל גנזו לצדיקים לע\\\"ל שהאור הראשון נגנז לצדיקי הדור שירדו ההשפעות על ידם וממילא הם נשמרים מן החיצונים והיא הגנוזה בהם. והוא שמצינו אצל רבקה ותקח את בגדי עשו בנה החמודות שחמד אותם מנמרוד שהי' לו מאדה\\\"ר וע\\\"י הקלקול באו לידי עשו. ורבקה נתכוונה להוציאם מידו להלביש את יעקב בנה הצדיק כי לו יאתה לקחת אותם. והנה בהיות הכרח סוד הלבושים האלו ליוסף להיות מסך נגד האור והחסד העובר על ידו לכן קנאו בו אחיו. באמרם כי גם המה בחי' צי\\\"ע. וזה שהשיב להם יוסף והנה תסובינה אלומותיכם ותשתחוין לאלומתי. כי הכל תלוי בו. כי הצדיק הוא העמוד שהעולם קיים על ידו והם לא האמינו לדבריו והפשיטו את כתנתו את כתונת הפסים והוא הי' עיקר הפגם של השבטים במכירת יוסף. וזו שהשמיענו הכתוב בזה שהפשיטו את כתנתו לומר שרצו לקחת ממנו בחי' הלבושים הנ\\\"ל לכך באו לכל הצרה הזאת ולולי כי הפשיטו את כתנתו לא הי' להם כח להזיקו במכירתם. אך מחמת כי הפשיטו את כתנתו הורידו את השפע לחיצונים. כמ\\\"ש להלן וישבו לאכול לחם וכו' וגמליהם נושאים כו' הולכים להוריד מצרימה פי' ההשפעות הלכו למצרים וז\\\"ש והשליכו אותו הבורה והבור ריק אין בו מים. ודרשו רז\\\"ל אבל נחשים ועקרבים יש בו. תיבת אותו רומז לבחי' אות ברית צי\\\"ע כי המדה זאת ירד להחיצונים. ולזה ויברך ה' את בית המצרי בגלל יוסף. וז\\\"ש יעקב כתונת בני חי' רעה אכלתהו טרוף טורף יוסף. לפי פשוטו אין הבנה לזה איך יצא מפיו של אותו צדיק דבר אשר לא כן הי' כי באמת הי' יוסף חי במצרים. אך לפי הנ\\\"ל הפי' בזה כי מפני שהפשיטו את הכתנת בחי' הלבוש כמ\\\"ש כתונת בני שעשה לו יעקב בעצמו בחי' לבוש כנ\\\"ל טרוף טורף יוסף רמז לרפ\\\"ח ני\\\"ק ובגלות הוא נטרף לחיצונים. וזה שהתמרמר יעקב אבינו כי ארד אל בני אבל שאולה. ר\\\"ל כי אצטרך לירד להוציא מהם ההשפעות והני\\\"ק שנפלו. וז\\\"ש ויבך אותו אביו בחי' או\\\"ת כנ\\\"ל ולכך כאשר נדחה השפע לחיצוני' לכן נשארו השבטים חסר לחם. ויוסף בהיותו בגלות הי' רוצה לעשות לו בעצמו לבושים ולא הועיל כדכתיב ותתפשהו בבגדו כו' פי' בגד שלו. אבל בבגד של אביו לא הי' לה שליטה. וזה ויעזוב בגדו בידה וינס ויצא החוצה. כידוע ענין עשרה הרוגי מלכות שנתגלגל עי\\\"ז כיל\\\"ח אך כאשר יצא יוסף מבית האסורין כתיב ויגלח ויחלף שמלותיו כי אז חזר בחי' הלבושי' ע\\\"י אורו עוטה כשלמה כמו שהי' בתחילה. וז\\\"ש יוסף לפרעה בלעדי אלהים יענה את שלום פרעה. כי כאשר היניקה יורד להחיצונים הוא בחי' אלקים. וז\\\"ש יוסף בלעדי אין לך משלי כלום כי אני מבחי' הוי'. רק אלהים יענה את שלום פרעה היניקה שלך הוא מבחי' אלקים. אשר נמשך החיות לבהמות וחיות אפי' הטמאות כמ\\\"ש ר' אליעזר אפי' בהמה טמאה נפשה לשמים. החיות שלה מבחי' אלקים ע\\\"י צמצום והשתלשלות עד אשר נעשה חלילה אלקים אחרים וחיצונים ר\\\"ל. אולם אח\\\"כ כשבאו אחי יוסף ונעשה היחוד וצירוף בשם הוי' וחזר בחי' היסוד אז אמר יוסף שימו לחם סוד ג' הויו\\\"ת. וז\\\"ש ויתן להם לבדם ולמצרים לבדם כי לא יוכלון המצרים לאכול את העברים לחם כי תועבה הוא למצרים. ר\\\"ל כי המצרים ניזונים מבחי' אלקים אחרים ובישראל כתיב לא תאכל כל תועבה. וזה שאמר יוסף חי פרעה אם תצאו מזה. ר\\\"ל אם תצאו מזה הנה תשוב החיות לפרעה. וזש\\\"א בשבת יום קדוש הוא מבואו ועד צאתו. כי השפע היורד בשבת הוא מצד הקדושה בחי' יסוד צדיק כמ\\\"ש וזכרת כי עבד היית במצרים לעבד נמכר יוסף כמבואר במ\\\"א. לכן השפע היורד בשבת מעולם העליון הוא בשמירה מהחיצוני' כי הוא מצד הקדושה מבואו ועד צאתו לעוה\\\"ז. לכן כל זרע יעקב יכבדוהו כו' ואל יבוזו זרים. ודברינו הנ\\\"ל נרמזו בדברי הזוה\\\"ק פ' בלק דף רד ע\\\"ש והבן:",
            "english_translation": "And Israel loved Joseph more than all his brothers and made him a coat of many colors. And his brothers envied him. In the Talmud Shabbat page 10, because of two selas worth of fine wool that Jacob gave Joseph more than his other sons, his brothers became jealous of him and the matter developed and our fathers went down to Egypt. These things according to their simple meaning have no dawn. Is it possible for the supreme holy tribes of God to be jealous over two selas of fine wool and a coat. Indeed the root of the matter is as it is written \"And the curtain shall separate for you between the holy and the holy of holies\" why was the curtain needed for separation when the courtyard and tabernacle were already very holy and what more separation would the curtain add could there not be a holy of holies without separation from the curtain.",
            "average_score": 9.0,
            "reference": "Tiferet Shlomo, on Torah, Vayeshev 4"
        },
        {
            "section": "Torah",
            "topic": "Miketz",
            "number": "7",
            "passage": "ויאמר פרעה אל יוסף אני פרעה ובלעדיך לא ירים איש את ידו ואת רגלו בכל ארץ מצרים. הנ\\\"ל לרמז בזה דהנה סוד ענין יוסף שגלה למצרים ערוות הארץ כי בחי' יסוד דקדושה יתגבר ויתעלה על יסוד דטומאה. והנה זהו היה עבודתו במצרים לבטל כחות יסוד דטומאה שזהו נקראת בחי' ערוות הארץ שהיה בחי' יסוד דקליפה. ולכך המצרי' היו שטופי זמה. והנה זהו שהיה בבית פוטיפרע דוקא שהוא שר הטבחים כי בחי' שר הטבחים מבו' בזוה\\\"ק ובהאר\\\"י ז\\\"ל שהוא בחי' הוורידין נגד קו האמצעי בסוד הדעת לכן רק שם היתה עבודתו שלימה לבטל כח הדעת ויסוד דקליפה ולא יצא משם עד שבטלו. וזהו סוד ענין שנסתרס הרמז שיוסף עקרו מכל וכל כמבואר כן בספרים הקדושים ובספרא דצניעותא דצניעותא. וזהו ענין הצרעה שאמרו חכז\\\"ל שהיתה זורקת בהם מרה ומסרסתן כי כן הכנענים הם ממדה זו לכן בפ' העריות התחיל הכ' כמעשה ארץ מצרים וכמעשה ארץ כנען אשר אני מביא אתכם שמה כו' כי תועבת ה' גם שניהם והם קרובים זה לזה כנ\\\"ל. וזהו בסוד קדושת ישראל והיו עוקרים ומבטלים כח יסודם בטומאה והיו נסתרסים ע\\\"י הצרעה כנ\\\"ל. וזהו היתה עבודת יוסף הצדיק כל הימים. וזהו וירא יעקב כי יש שבר במצרים כי כן כתיב ומצבותם תשברו. וזהו שראה כי יש שבירה בקליפת מצרים.וזהו בפוטיפרע הרמז כי נצח בחי' הדכר דקליפה ונסתרס אבל בחי' הנקיבה קשה ממנו כמ\\\"ש כן באוה\\\"ח במעשה החלום הנראה אליו ע\\\"ש בפ' ויחי ע\\\"פ אסרי לגפן וכו'. ולכך כשרצה ג\\\"כ לבטלה ויבא הביתה לעשות מלאכתו כנ\\\"ל. אבל וינס ויצא החוצה וזש\\\"א הכתוב לאסור שריו בנפשו כי אסר השרים וכחות הטומאה תחתיו. וזהו וילקט יוסף את כל הכסף הנמצא בארץ מצרים ובארץ כנען. כסף לשון נכסוף ותאווה היינו תאוות הניאוף שלהם בטל מהם וזהו שהביא ביתה פרעה הוא רומז לעולם הבינה כמבו' בסה\\\"ק שהחזיר ותיקן הכל לשרשו כו'. וזהו שצוה לבסוף להמצרים שימולו כי תיקן יסוד דקליפה והחזיר הכל לקדושה ומזה היה ערב רב שנתערבו בישראל. וז\\\"ש אני פרעה היינו רמז לעולם הבינה ובלעדיך לא ירים איש את ידו הוא יו\\\"ד בחי' יסוד ואת רגלו ג\\\"כ בחי' יסוד היינו שלא ירים עוד היסוד דקליפה. וזהו וישימני לאב לפרעה ולאדון לכל ביתו. הנה בחי' אב הוא רצון ובחי' אב בחכמה כמ\\\"ש ויקרא לפניו אברך. לפרעה בחי' בינה. ולאדון ולכל ביתו. בחי' ביתו ידוע. ומושל בכל ארץ מצרים כמ\\\"ש והיתה לה' המלוכה ומושל בגוים. והבן:",
            "english_translation": "And Pharaoh said to Joseph, \"I am Pharaoh, and without you no man shall lift his hand or foot in all the land of Egypt.\" This hints at the secret matter of Joseph who was exiled to Egypt, the nakedness of the land, for the holy foundation shall overcome and rise above the foundation of impurity. This was his work in Egypt to nullify the powers of the impure foundation which is called the nakedness of the land that was the foundation of the shell. Therefore the Egyptians were steeped in lewdness. This is why he was specifically in Potiphar's house who was chief of the butchers, for the aspect of chief butcher is explained in the holy Zohar and by the Ari that it is the aspect of the veins against the middle line in the secret of knowledge, therefore only there was his work complete to nullify the power of knowledge and foundation of the shell and he did not leave until they were nullified. This is the secret matter that he was castrated, hinting that Joseph uprooted it completely as explained in the holy books and in the Book of Concealment. This is the matter of the hornet that the sages said would inject bile and castrate them for the Canaanites are from this measure therefore in the portion of forbidden relations the verse begins \"Like the practice of Egypt and like the practice of Canaan where I am bringing you\" for both are an abomination to God and they are close to each other as mentioned. This is in the secret of Israel's holiness and they would uproot and nullify the power of their foundation in impurity and they would be castrated by the hornet as mentioned. This was the work of Joseph the righteous all the days. This is \"And Jacob saw that there was grain in Egypt\" for it is written \"and break down their pillars.\" This is that he saw there was breaking in Egypt's shell. This is in Potiphar the hint that he overcame the male aspect of the shell and was castrated but the female aspect was harder than him as written in Or HaChaim in the dream matter that appeared to him see there in portion Vayechi on the verse \"Binding his foal to the vine.\" Therefore when he also wanted to nullify it \"he came into the house to do his work\" as mentioned. But \"he fled and went outside\" and this is what the verse says \"to bind his officers to his soul\" for he bound the officers and powers of impurity under him. This is \"And Joseph gathered all the money found in Egypt and Canaan.\" Money refers to desire and lust meaning their lustful desires he nullified from them and this is that he brought to Pharaoh's house which hints to the world of understanding as explained in holy books that he returned and fixed everything to its root. This is that he commanded finally to the Egyptians to circumcise for he fixed the foundation of the shell and returned everything to holiness and from this was the mixed multitude that mixed with Israel. This is what it says \"I am Pharaoh\" meaning hint to the world of understanding and \"without you no man shall lift his hand\" which is yod aspect of foundation \"and his foot\" also aspect of foundation meaning the foundation of the shell shall not rise again. This is \"He made me a father to Pharaoh and master of all his house.\" The aspect of father is will and aspect of father in wisdom as written \"And he called before him Avrech.\" To Pharaoh aspect of understanding. And master to all his house. The aspect of his house is known. And ruler in all land of Egypt as written \"And the kingdom shall be the Lord's and he will rule over nations.\" Understand.",
            "average_score": 9.0,
            "reference": "Tiferet Shlomo, on Torah, Miketz 7"
        },
        {
            "section": "Torah",
            "topic": "Bo",
            "number": "4",
            "passage": "אל תוסף ראות פני כי ביום ראותך פני תמות. ויאמר משה כן דברת לא אוסיף וכו' . יש להבין למה רק בעת ההיא יצא הדבור זה מפיו של אותו רשע וכי עד עתה חפץ היה הרשע הזה בראות פני משה ואהרן הלא ידע מאז כי לא באו רק להלקותו במכות ויסורין אך הנה כבר מבואר כי עיקר העבדות של הצדיקים הוא להעלות הני\\\"ק מתוך הקליפות ומה גם בגלות מצרים הנה אך זה היה העבודה קשה של ישראל והלא זה הדבר שהיה יוסף במצרים וכן יעקב אבינו ע\\\"ה כי ע\\\"י שהי' במצרים ני\\\"ק גדולים וקדושו' לכן. הוצרכו הצדיקים הללו לגלות שמה כדי להעלותם וז\\\"ש ויצא יעקב מעם פרעה כי ע\\\"י שהעלה הני\\\"ק ממנו יצא מעם פרעה ממש וכן במשה כתיב ויצא מעם פרעה היינו שהעלה הני\\\"ק ממנו. כי הנה בפרעה היה ני\\\"ק גדולים מפני שהוא היה בחינת העורף כידוע לכן אחר לא היה יכול להוציאם ממנו כי אם הגדול והקדוש כיעקב אבינו ע\\\"ה וכמשרע\\\"ה. אבל בשאר העם כתיב וישאלו איש מאת רעהו שהם העלו הני\\\"ק איש מאת רעהו שלא היו בהם ני\\\"ק גדולים כאלה וינצלו את מצרים. והנה לכך כשכבר העלה כל הני\\\"ק מעם פרעה ולא נשאר בו עד אחד נזרק הדבר הזה מפיו אל תוסף ראות פני כלומר שאין בו עוד ניצוץ קדושה ולכן ביום ראותך פני תמות כי אסור להסתכל בפני אדם רשע כמ\\\"ש אל תפנו אל האלילים אם לא לצורך העלאת ני\\\"ק מאת פניו והם כבר הוציאו לאחדים כל הני\\\"ק מאת פניו כמ\\\"ש ה' הצדיק ואני ועמי הרשעים וחטאתי לה' וכדומה עד שלא נשאר בו עוד שום ני\\\"ק ואסור להסתכל עוד בפניו וכמש\\\"א יעקב אבינו ע\\\"ה רואה אני את פני אביכם והנה איננו אלי כתמול שלשום. ר\\\"ל שאין בו עוד ני\\\"ק לכן אשוב עתה אל ארצי כנ\\\"ל. והנה ע\\\"ז אמר הכתוב ומשה ואהרן עשו את כל המופתים האלה לפני פרעה. וכבר הקשה רש\\\"י בזה מה צורך הכתוב בזה. אך כוונתו בזה כי אך משה ואהרן הצדיקים הגדולים והקדושים הם יכלו לעשות המופתים לפני פרעה להעלות ני\\\"ק ממנו והוא שכ' הם המדברים אל פרעה להוציא את בנ\\\"י ממצרים כי אך הם יכלו להוציא ני\\\"ק של בנ\\\"י ולא איש אחר כי העוקר עבודת כוכבים צריך לשרש אחריה וזה ולא יכלו לעשות רק משה ואהרן כנ\\\"ל. והבן:",
            "english_translation": "Do not add to see my face, for on the day you see my face you will die. And Moses said, Thus you have spoken, I will not add etc. One must understand why only at that time did this utterance come from the mouth of that wicked one, and until now did this wicked one desire to see the faces of Moses and Aaron, did he not know from the beginning that they came only to strike him with plagues and afflictions but behold it is already explained that the main servitude of the righteous is to elevate the holy sparks from within the shells and especially in the Egyptian exile this was indeed the difficult work of Israel and this is what Joseph was doing in Egypt and also our father Jacob peace be upon him because through being in Egypt there were great and holy sparks therefore these righteous ones needed to go into exile there to elevate them and this is what is meant by and Jacob went out from before Pharaoh because through elevating the holy sparks from him he literally went out from Pharaoh and likewise with Moses it is written and he went out from Pharaoh meaning he elevated the holy sparks from him.",
            "average_score": 9.0,
            "reference": "Tiferet Shlomo, on Torah, Bo 4"
        },
        {
            "section": "Torah",
            "topic": "Beshalach",
            "number": "1",
            "passage": "ויקח משה את עצמות יוסף עמו. הנה בספר יהושע ך\\\"ד כתיב ואת עצמות יוסף אשר העלו בנ\\\"י ממצרים קברו בשכם. בגמ' סוטה דף י\\\"ג ע\\\"ב הקשו קראי אהדדי דהא כתיב ויקח משה את עצמות יוסף עמו. והכא כתיב אשר העלו בנ\\\"י כו' ע\\\"ש. עוד תמהו הראשונים ז\\\"ל למה לא צוה יוסף את בניו שישאוהו ליקבר בא\\\"י מיד כמו שצוה יעקב אבינו ע\\\"ה. הנ\\\"ל לרמז בזה כוונת יוסף לתועלת בנ\\\"י שע\\\"י כח קדושת עצמותיו של יוסף הצדיק שנשארו עמהם במצרים הנה זה שזכו בנ\\\"י לגאולה. כי זהו בחינת יוסף שנקרא גואל כיל\\\"ח ובזכות עצמותיו נגאלו. (וכעין זה מצינו בזוהר פ' ויחי דף רכ\\\"ב אמר הקב\\\"ה אי יוסף אסתלק מהכא גלותא לא אתקיים ע\\\"ש). וז\\\"ש פקוד יפקוד אלהים אתכם פי' הפקידה מהגאולה אשר יפקוד אתכם יהיה ע\\\"י עצמותי. וזה והעליתם את עצמותי מזה אתכם שהם יסבבו את הגאולה לכם ולהעלות אתכם להשפיע לכם כל טוב לעולם. כי כן הוא גדול כח קדושת הבלא דגרמי של הצדיקים אף לאחר פטירתם הם משפיעים כ\\\"ט לבנ\\\"י ושפתותיה' דובבות בקבר. וז\\\"ש חכז\\\"ל קנה שם טוב קנה לעצמו קנה לו דברי תורה קנ\\\"ה גימט' יוסף עה\\\"כ לרמז ע\\\"י קדושת יסוד יוסף קנה לעצמו פי' שגם עצמותיו הם משפיעים כ\\\"ט והוא קנה לו ד\\\"ת שנעשה כמעיין המתגבר. ועד\\\"ז הוא שאמרו חכז\\\"ל צדיק זכיותיו חקוקים על עצמותיו וכן להיפך. כי ענין עצמות רומז לבחי' יסוד לכן אמרו מי שלא נשא אשה מבן עשרים שנה ולמעלה תיפח עצמותיו. אבל בהתיקון כתיב ועצמותיך יחליץ. הנה לכך כתיב ויקח משה את עצמות יוסף עמו. כי משה רבינו ע\\\"ה היה יודע את כל אשר נעשה בשביל העצמות האלה שגרם להם הגאולה כמ\\\"ש כי השבע בשביע את בנ\\\"י לשון שביעה להשפיעם כ\\\"ט לכן לקחם עמו בכל המסעות של בנ\\\"י כנ\\\"ל. ומה שנא' בס' יהושע ואת עצמות יוסף אשר העלו ברי הכי פירושו שהם העלו בנ\\\"י ממצרים כי בזכותם נגאלו כנ\\\"ל. וכן הגאולה העתודה ב\\\"ב יהיה ג\\\"כ ע\\\"י הצדיק יסו\\\"ע (כמ\\\"ש בדרוש פורים בפ' בישעיה כה אמר ה' לסריסים אשר ישמרו את שבתותי וכו' עוד אקבץ עליו לנקבציו ע\\\"ש). וזה שמסיים שם הפ' קברו בשכם כו' ויהיו לבר יוסף לנחלה. לכאורה היה צריך לומר ויהי לבני יוסף לנחלה שזה קאי על חלקת השדה שהיא לבני יוסף לנחלה. אך לפי הנ\\\"ל שזהו מוסב על העצמות הקדושים שאמר בתחלת הפסוק ואמר שהעצמות האלו הם בכוחם וקדושתם גם לעולמי עד להשפיע לבניהם אחריהם נחל\\\"ה נח\\\"ל ה' . וזה מודיע הכתוב כי כל מי שישבו בחי' יוסף הנה עצמותיו יהיו לבניו ולכל בני ישראל נחלה להשפיעם כל טוב סלה:",
            "english_translation": "And Moses took the bones of Joseph with him, for in the book of Joshua 24 it is written that the bones of Joseph which the children of Israel brought up from Egypt they buried in Shechem, in the Gemara Sotah page 13b they questioned the verses against each other for it is written that Moses took the bones of Joseph with him and here it is written that the children of Israel brought them up, and the early sages wondered why Joseph did not command his sons to bury him in the land of Israel immediately as our father Jacob commanded, this hints at Joseph's intention for the benefit of the children of Israel that through the power of the holiness of Joseph the righteous's bones that remained with them in Egypt, this is how the children of Israel merited redemption, for this is the aspect of Joseph who was called redeemer and through the merit of his bones they were redeemed, and God said if Joseph departs from here the exile will not be established, and this is what is meant by God will surely remember you meaning the remembrance of redemption that will remember you will be through my bones, and this is bring up my bones from here with you that they will cause the redemption for you and bring you up to bestow all good forever.",
            "average_score": 9.0,
            "reference": "Tiferet Shlomo, on Torah, Beshalach 1"
        },
        {
            "section": "Festivals",
            "topic": "Rosh Hashanah",
            "number": "4",
            "passage": "(נחמיה ח׳:י׳) ויאמר להם לכו אכלו משמנים ושתו ממתקים ושלחו מנות לאין נכון וכו' כי חדות ד' הוא מעוזכם. ודרשו רז\\\"ל שזה קאי על ר\\\"ה. הנראה לרמז בזה לחזק ידים רפות על מה שאנו רואים כובד הגלות שמתגבר בכל יום כי הוא ענין הנסתר מבני אדם כי באמת הוא טובה גדולה לקרב הגאולה. ונבאר הענין עפ\\\"י משל לרופא מומחא שנכנס אצל החולה בהתחלת החולי שיש לו רק מיחוש בעלמא ועודנו מתחזק כבריא ללכת ברגליו וכאשר בא הרופא אליו לבקרו אומר עליו כי הוא צריך לרחמי' גדולי' ולעסוק ברפואות וסמים. וברבות הימים כאשר הכביד חוליו ושוכב ערש דוי אשר כמעט נתיאשו ממנו נכנס הרופא עוד אליו ואומר לכל הנצבים עליו שלא ידאגו עוד מאומה כי מהר יתרפא ויעמוד מחוליו הקשה הנה בעיני הרואים הוא דבר הפלא ופלא כי הנה בעודנו החולה הזה הולך ומתחזק ברגליו הי' אומר עליו כי הוא מסוכן ועתה כאשר הכביד חוליו ובשרו רזה וכחוש מכף רגליו עד ראשו אין בו מתום הוא אומר עליו כי מהר יתרפא. אך האמת כן הוא כי הרופא הבין כי אז הי' רק התחלה ובוודאי בכל יום יכביד עליו חוליו לכן אז הי' צריך לרפואות ולסמים ולרחמים רבים. אך עתה כאשר עבר עליו כל התלאה הוא בטוח עליו כי יפול עליו זיעה ומהר יתרפא. וכן הוא ג\\\"כ ענין הגלות לפי הנראה בעיני בשר הוא דבר הפלא מדוע עשה ד' ככה. ומי לנו גדול ממשה רבינו ע\\\"ה כאשר ראה קושי השיעבוד הקשה ואמר למה הרעות כו'. והשיב לו הקב\\\"ה וארא אל אברהם כו' לכן אמור לבני ישראל אני ד' והוצאתי אתכם מתחת סבלות מצרים. כי הש\\\"י הי' יודע כי מהר יהי' הישועה כי הקושי שיעבוד ישלים הקץ. וכן ביוסף הי' כזה כל ענין המכירה ואשר שמו אותו בבור הי' תמוה בעיניו כאשר אמר וגם פה לא עשיתי מאומה כי שמו אותי בבור. והאמת הי' כי השיעבוד שלו הי' רק הכנה על גלות מצרים ועל קירוב הגאולה ללקט הני\\\"ק הנפזרים כידוע מספרים שכל ענין הגלות הוא לרבות גרים הם הניצוצות כידוע. לכן אח\\\"כ כשירד יעקב למצרים אמר יוסף והגדתם לאבי כל כבודי במצרים. פי' כל ענין הכבוד והגאולה הי' ע\\\"י ירידתי למצרים. וז\\\"פ בפ' נצבים. ואמרו כל הגוים על מה עשה ד' ככה לארץ הזאת וכו' ואמרו על אשר עזבו וכו'. ולכאורה קשה למה דוקא הגוים יאמרו הלא גם בנ\\\"י יתמהו על כובד יהגלות. אך הפי' בזה כי דוקא הגוים יהיו תולים כי כובד הגלות הוא מחמת אשר עזבו שחטאו בנ\\\"י ושלחם ביד פשעם. אולם הכתוב מסיים ואמר הנסתרות לד' אלהינו והנגלות לנו ולבנינו לעשות כל דברי התורה הזאת. כי ישראל הם מאמינים ובני מאמינים. הם צריכין להבין זאת כי הגלות הוא ענין נסתר ולעתיד הכל ידעו כי הי' לטובה. כמ\\\"ש ישמחו השמים ותג\\\"ל הארץ רומז לשכינה הקדושה. ותג\\\"ל אותיות גלו\\\"ת. ונחזור לעניננו כי בימי עזרא ג\\\"כ היו בנ\\\"י בתכלית השפלות קודם בנין בית שני. לכן אמר להם עזרא לכו אכלו משמני' וכו' ושלחו מנות לאין נכון לו. פי' אפי' מי שלא הכין לבו על הגאולה בתשובה שלימה כראוי בכל ימי הגלות עכ\\\"ז אל תעזבוהו ותחזקו בידו להיות עמכם יחד ולהחזירו בתשובה שלימה. כי חדות ד' הוא מעוזכם פי' כי הבטחת הש\\\"י ב\\\"ה על הגאולה והוא היודע כי מהר יצמיח לכם ישועה. הוא מעוזכם לחזק גם עתה את לבבכם. וכן נזכה לישועה למהר קץ הגאולה במהרה בימינו אמן:",
            "english_translation": "And he said to them, \"Go, eat rich foods and drink sweet drinks and send portions to those who have nothing prepared, for the joy of the Lord is your strength.\" And our sages interpreted this as referring to Rosh Hashanah. It appears to hint at strengthening weak hands regarding what we see of the heaviness of exile that grows stronger each day, for it is a matter hidden from mankind, for in truth it is a great good to bring the redemption closer. And we will explain the matter through a parable of an expert physician who enters to see a sick person at the beginning of the illness when he has only a minor ailment and is still strong like a healthy person walking on his feet, and when the doctor comes to visit him he says about him that he needs great mercy and must deal with medicines and remedies. And after many days when his illness becomes severe and he lies on his sickbed when they have almost given up on him, the doctor enters again and tells all those standing around him not to worry anymore for he will soon recover and rise from his severe illness. Behold in the eyes of observers this is a great wonder, for while the sick person was still walking and strong on his feet he said about him that he was in danger, and now when his illness is severe and his flesh is thin and weak from head to toe with no wholeness in him, he says about him that he will soon recover. But this is indeed the truth, for the doctor understood that then it was only the beginning and certainly each day his illness would become more severe, therefore then he needed medicines and remedies and great mercy. But now when all the hardship has passed over him, he is confident about him that sweat will fall upon him and he will soon recover. And so too is the matter of exile, according to what appears to physical eyes it is a wonder why God did this. And who is greater for us than Moses our teacher peace be upon him, when he saw the difficulty of the harsh bondage and said \"Why have you done evil?\" And the Holy One Blessed be He answered him \"I appeared to Abraham etc., therefore say to the children of Israel I am the Lord and I will bring you out from under the burdens of Egypt.\" For God knew that soon there would be salvation for the harsh bondage would complete the appointed time. And so it was with Joseph, the whole matter of his sale and their putting him in the pit was puzzling in his eyes as he said \"Also here I did nothing that they put me in the pit.\" And the truth was that his bondage was only preparation for the Egyptian exile and for bringing redemption closer to gather the scattered sparks as is known from books that the whole matter of exile is to increase converts who are the sparks as is known. Therefore afterward when Jacob went down to Egypt, Joseph said \"Tell my father of all my glory in Egypt.\" Meaning all the matter of glory and redemption was through my descent to Egypt. And this explains in Parshat Nitzavim: \"And all the nations will say why did God do thus to this land etc. and they will say because they abandoned etc.\" And at first glance it is difficult why specifically the nations will say this, won't the children of Israel also wonder about the heaviness of exile. But the explanation of this is that specifically the nations will attribute that the heaviness of exile is because they abandoned that the children of Israel sinned and He sent them away through their transgression. However the verse concludes saying \"The hidden things belong to the Lord our God and the revealed things to us and to our children to do all the words of this Torah.\" For Israel are believers and children of believers. They need to understand this that exile is a hidden matter and in the future all will know that it was for good. As it is written \"The heavens will rejoice and the earth will rejoice\" alluding to the holy Divine Presence. And \"rejoice\" has the same letters as \"exile.\" And we return to our matter that in the days of Ezra also the children of Israel were in the depths of lowliness before the building of the Second Temple. Therefore Ezra said to them \"Go eat rich foods etc. and send portions to those who have nothing prepared.\" Meaning even one who has not prepared his heart for redemption with complete repentance properly throughout all the days of exile, nevertheless do not abandon him and strengthen his hand to be together with you and return him in complete repentance. \"For the joy of the Lord is your strength\" means that God's promise about redemption and He who knows that He will soon cause salvation to sprout for you, that is your strength to strengthen even now your hearts. And so may we merit salvation to hasten the end of redemption speedily in our days, Amen.",
            "average_score": 9.0,
            "reference": "Tiferet Shlomo, on Festivals, Rosh Hashanah 4"
        },
        {
            "section": "Torah",
            "topic": "Shemot",
            "number": "5",
            "passage": "וכאשר יענו אותו כן ירבה וכן יפרוץ. יל\\\"ד בלשון הכתוב שאמר כאשר יענו כן ירבה וכי ע\\\"י העינוי אותם באה להם הרבוי. הלא כוונת הכתוב הוא להיפך כי אף אם עינו אותם בכ\\\"ז לא נתמעטו עבור כך ועדיין נתרבו ומהו כן ירבה. אכן מה שנ\\\"ל דהנה אמרינן בגמ' (ברכות דף ה' ע\\\"א) איזהו יסורין של אהבה כל שאין בהם ביטול תורה וביטול תפלה. הפי' הוא דהנה יש צדיקים שמקבלים עליהם ברצון יסורים בעוה\\\"ז עבור שהם משתתפים בצער השכינה דהנה הדינין הם מפסיקין היחוד למעלה לכך הם ממשיכין הדינין של השכינה עליהם כדי שיהיה היחוד למעלה. וכמבואר זה הענין אצל ר\\\"ע וחביריו שעשו זה ברצון לתקן השכינה כיל\\\"ח. וכן ר' אליעזר בר\\\"ש שקרא להם כמבואר בגמ' . וכן ר' חנינא בן דוסא שנאמר עליו כל העולם ניזון בשביל חנינא בני והוא די לו בקב חרובין. ורמז כ\\\"ל העול\\\"ם הוא היחוד זו\\\"נ יסו\\\"ד נקרא כ\\\"ל והעול\\\"ם היא השכינה. ר\\\"ל היחוד נעשה ע\\\"י ר' חנינא בן דוסא במה שקבל עליו יסורים של הדינין המעכבים היחוד כי הוא נדחק בענוי ולחץ ועי\\\"כ נעשה היחוד למעלה. והנה זה הדבר הוא האמור בזוה\\\"ק פ' וישב דף קפ\\\"א באילין צדיקיא דאתילדו בפגימו דסיהרא וז\\\"ל. יבא כל בשר להשתחוו' כו' . כל בשר ודאי דאלין יתחדתון בכלא ובעיין לחדתותי בחדתותא דסיהרא ואילין אינון בשותפותא חדא בסיהרא פגימין בההוא פגימו דילה וכו' אינון דסבלי עמה יתחדתון עמם. ואלין איקרון יסורים של אהבה של אהבה וכו' ואינון דאתפגי' נהור' של אהב' זוטא דאתדחיא מאהב' רבה ובג\\\"כ אלין אינון חברים משותפי' בהדה ע\\\"כ. הכוונה דאתדחיא אהבה זוטא מאהבה רבה היא מלכות מהזעיר כנ\\\"ל. והנה אלו הצדיקים עושים מאהבה ושמחיס ביסורים כדי לגרום אהבה והיחיד למעלה וז\\\"ש צרה ויגון אמצא ובשם ה' אקרא. כי אנכי בצרה ויגון אמצא ועי\\\"ז בשם ה' אקרא אגרום היחוד בשם הויה ב\\\"ה וזהו לשון אקרא הוא היחוד כמבואר בזוה\\\"ק. והנה זהו הענין של יעקב אבינו ע\\\"ה שהיה כל ימיו ביסורים כמ\\\"ש מעט ורעים היו ימי שני חיי. שקבל על עצמו יסורים ודינין כדי שיהיה היחוד למעלה בזיווג פנימי להולדת נשמות של בנ\\\"י כי אך זהו היתה כוונתו להמשיך ולהוליד נשמות קדושות של בנ\\\"י. והוא שאמר העונה אותי ביום צרתי. ר\\\"ל ביום צרתי ויסורין שלי אך אז היה העונה והיחוד שלמעלה. וזש\\\"נ יענך ה' ביום צרה ישגבך שם אלהי יעקב הרמז כי המזמור הזה הוא על בחי' העונה אותי ביום צרתי האמור ביעקב וזש\\\"נ יענך ה' ביום צרה והזכיר עליו שם אלהי יעקב. שיש לדקדק למה תפס שם אלהי יעקב דוקא ולא אלהי אברהם. אך זהו מוסב על הכוונה של יום צרה של יעקב כמו שבארנו. וכן הוא מבואר במד\\\"ר פ' ואתחנן כך אמר דוד מי שענה את יעקב הוא יענה אתכם וכו' ע\\\"ש. והנה המזמור של יענך הוא ליולדת שנולדים נשמות קדושות לזרע יעקב וז\\\"פ שם אלהי יעקב. ענין שם הוא מורה על התהוות דבר חדש בעולם ששמו ית' נתגדל ונתקדש כמ\\\"ש ותעש לך שם כהיום הזה וכו ולך עשית שם גדול וקדוש בעולמך וכן כאן ע\\\"י הולדת הנשמות חדשות בעולם שהוא דבר גדול מאד מאד כמבואר בספרים נתגדל שמו ית' . וזהו שם אלהי יעקב כמ\\\"ש ואלה שמות בנ\\\"י. ה' אחד ושמו אחד הם ישראל. וזהו המדה של יעקב שהמשיך נשמות קדושות של בנ\\\"י על ידי היחוד פנימי שגרם בעליונים כנ\\\"ל. אכן כאשר נסתלק יעקב אבינו וימת יוסף וכל אחיו וכל הדור ההוא והפסיק היחוד ונפסק ג\\\"כ השתלשלות הנשמות. אז קבלו בנ\\\"י עליהם את הדינים בעצמם כי כאשר ראו כי גברה חשכות העולם בגלותם ונפסק היחוד והקדושה של האבות קבלו הם עליהם את היסורין והדינין שלמעלה והשתתפו בצער השכינה כנ\\\"ל. לגרום היחוד כתיקונו וז\\\"ש חכז\\\"ל קושי השיעבוד השלים את החשבון. רמז השלים עשה שלום במרומי' כנ\\\"ל. וז\\\"ש וירא בסבלותם ר\\\"ל שהם קבלו ברצון עליהם לסבול הדינין למען עשות היחוד למעלה. הנה זהו שאמרו חכז\\\"ל יסורין של אהבה ר\\\"ל שע\\\"י היסורין גורמים היחוד ואהבה למעלה וזה שאין בהם ביטול תורה ותפלה שתפלתו לא נתבטל ואדרבא היא מקובלת מאד לפר הש\\\"י כי צדיק הוא לפני הש\\\"י. והנה כאשר קבלו עליהם בנ\\\"י את הדינין בגלות וגרמו היחוד הנה לכך זכו להמשיך נשמות הגדולות והקדושות של משרע\\\"ה ודור המדבר כולו. הנה זהו שאמה\\\"כ וכאשר יענו אות\\\"ו שהיו מענים בחי' האו\\\"ת קבלו הם עליהם את הדין וגרמו היחוד עי\\\"כ כן ירבה כ\\\"ן (עם האותיות) גימט' ע\\\"ב נתגבר היחוד והחסדים וכן יפרוץ נשמות קדושות וחסדים טובים לעמו בנ\\\"י. אמן:",
            "english_translation": "And as they afflicted him so did he multiply and so did he spread forth. And when they saw that the more they afflicted them the more they multiplied and grew. And they were grieved because of the children of Israel. And the Egyptians made the children of Israel serve with rigor. And they made their lives bitter with hard bondage in mortar and in brick and in all manner of service in the field. All their service wherein they made them serve was with rigor. But the more they afflicted them the more they multiplied and grew and they were grieved because of the children of Israel.",
            "average_score": 9.0,
            "reference": "Tiferet Shlomo, on Torah, Shemot 5"
        },
        {
            "section": "Torah",
            "topic": "Vayeshev",
            "number": "3",
            "passage": "אלה תולדות יעקב יוסף. נקדים מ\\\"ש לפרש המאמר בווין תתקטר. עפ\\\"י הידוע כי גדול כח הצדיק השומר ברית קודש שהוא הצנור מכל השפעות טובות שיורדים לעולם. ובשעת בריאת העולם הי' רצונו ית\\\"ש שיהי' בכל דור ודור צי\\\"ע בחי' יסוד. וז\\\"פ בווין תתקטר רמז לצי\\\"ע יעקב ויוסף הם ב' ווי\\\"ן. וז\\\"ש בנוסח תפלת שמ\\\"ע אלהי אברהם אלהי יצחק ואלהי יעקב וי\\\"ו יתירה רומז להנ\\\"ל. וזהו בווין תתקטר. כביכול השכינה הקדושה רודפת אחר הצדיק הזה להאחז בו כדי שירדו ההשפעות על ידו לכנ\\\"י. כמ\\\"ש ותתן טרף לביתה. טר\\\"ף רמז לרפ\\\"ח ניה\\\"ק שנפלו לסט\\\"א ועי\\\"ז הם חוטפים ההשפעות. והשכינה היא מצלת מידם ונותנת הטרף לכנ\\\"י ע\\\"י הצדיק יסוד עולם. וזה הענין מצינו ביוסף הצדיק כמ\\\"ש רב עוד יוסף בני חי. פי' כי יוסף העלה רב ניצוצות ממנין רפ\\\"ח ולא נשאר רק פ\\\"ו כמנין אלהי\\\"ם וע\\\"ז הוא כל העבדות בנ\\\"י לגמור תיקונם להעלותם עד ביאת הגואל ב\\\"ב. וז\\\"ש כי יש שבר במצרים כי מגודל כח קדושתו של יוסף שעמד בניסיון בהיותו במצרים ערוות הארץ. וזה ג\\\"כ לשבור בר רמז על ר\\\"ב ני\\\"ק כנ\\\"ל. וע\\\"י הצי\\\"ע יש שמחה למעלה בעולמות העליונים לאין שיעור כי נתגדל ונתקדש שמו הגדול כמ\\\"ש ונגדלך ונשבחך ונפארך. וז\\\"ש ואתם הדביקים בה' אלהיכם חיים כולכם היום. פי' שהם המיחדים ועושים הדביקות בשם הוי' ב\\\"ה. וזהו הרמז באות וא\\\"ו בתוך הב' ווין אות א' עולה י\\\"ג כנגד י\\\"ג מכילין דרחמי. וז\\\"ש ר' ישמעאל אומר בשלשה עשרה מדות שהתורה נדרשת בהן. פי' אם הוא בבחי' זו להיות בבחי' צי\\\"ע לעשות היחוד בי\\\"ג מדות אזי התורה נדרשת בהן. פי' שהקב\\\"ה כביכול דורש התורה משמו כמ\\\"ש ואתה דורש מעשה כולם. כמ\\\"ש בגמ' מאיר בני אומר. אליעזר בני אומר. וז\\\"ש אשר יעשה אותם האדם וחי בהם אני ה'. כביכול החיות שלו מגודל קדושת בנ\\\"י הצדיקים. יסודי עולם אתם אותיות אמת. וזה הענין מ\\\"ש כי בן זקונים הוא לו. זקן אהרן שיורד על פי מדותיו. זקן הוא עולם הזקנה כמ\\\"ש עד אברהם לא הי' זקנה. ר\\\"ל שלא הי' מי לעורר אותו העולם. והצדיק אשר הוא במדריגה זו הוא המנהיג ומשפיע לכל הדור ההוא אף בזמן הגלות. וז\\\"ש נוהג בארץ ובחוץ לארץ וכן מצינו ביוסף הצדיק שהי' במצרים לעבד נמכר יוסף כשעמד בניסיון הזה הי' מביא נ\\\"ר בכל העולמות בשעת הניסיון. ופוק חזי מה עלתה בו שמו אדון לביתו ומושל בכל ארץ מצרים. אך אין להסתכל על תכלית המעלה והגדלות שלו רק על הניסיון אשר עמד בו וקיים כל העולם בזה אף אחרי מותו כמ\\\"ש הים ראה וינס ארונו של יוסף ראה. וזה ג\\\"כ פי' הכ' וכל אשר הוא עושה ה' מצליח בידו. פי' שם הוי' הי' מצליח בידו. כמ\\\"ש אנא ה' הושיעה נא. אנא ה' הצליחה נא. וזה ג\\\"כ מצליח בידו הוא יו\\\"ד אשר גם תוכו הוא אות וי\\\"ו ויו\\\"ד רמז לחכמה. כי כתר הוא קמץ כידוע לי\\\"ח והחכמה הוא פתח. פי' הפ' פיה פתחה בחכמה רמז להנ\\\"ל. פותח את ידיך יודי\\\"ך. וכח הצדיק לעורר עולם החכמה ולהביא כל השפעות טובות הן במילי דשמיא ובמילי דעלמא כל השפעות טובות לכלל ישראל אמן:",
            "english_translation": "These are the generations of Jacob Joseph. When we preface what is written to explain the saying \"in vav you shall be bound, \" according to what is known that great is the power of the righteous one who guards the holy covenant which is the channel for all good influences that descend to the world. And at the time of creation it was His blessed will that in every generation there would be a righteous foundation. And this explains \"in vav you shall be bound\" hinting to the righteous ones Jacob and Joseph who are two vavs. And this is what is said in the Shemoneh Esrei prayer formula \"God of Abraham, God of Isaac, and God of Jacob\" with an extra vav hinting to the above. And this is \"in vav you shall be bound.\" As it were, the holy Divine Presence pursues this righteous one to grasp onto him so that influences will descend through him to the Community of Israel.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Torah, Vayeshev 3"
        },
        {
            "section": "Festivals",
            "topic": "Pesach",
            "number": "79",
            "passage": "בגמרא קשה מזונותיו של אדם כקריעת ים סוף. להבין הדמיון בזה. דהנה אמנם ע\\\"י הנס של קריעת י\\\"ס ניתן להם לישראל אח\\\"כ השפעות טובות כמבואר בכתוב מיד אחר קריעת י\\\"ס ניתן להם מים ומזון לדרך. כי נמתקו המים. וסמך אחריו פרשת המן. והנה זהו הענין שביעי של פסח שהוא בבחי' יסוד שבחסד להוריד ולהשפיע תמיד חסדים וטובות לעמו בנ\\\"י. וזהו בחי' יוסף לאמר יוסף ד' עליכם ועל בניכם ברוכים אתם לד'. כי אמנם זהו העיקר להמשיך ולהשפיע לישראל בגלות השפעות טובות אם בעוה\\\"ר עדיין משיח לא בא וארכו ימי הגלות צריך בע\\\"כ להחזיק את ישראל ולהשפיע להם כ\\\"ט למען יוכלו להתקיים עד ביאת המשיח וזה הי' בחי' יוסף שנאמר בו ויכלכל יוסף את אחיו. והוא שנאמר וירא אתם את בנימין וכו' ויבא החדרה ויבך שמה וכו' ויתאפק ויאמר שימו לחם. דקשה למה לא התוודע אליהם מיד לומר אני יוסף. אך כל הענין הזה מרמז על הגלות האחרון עד כי יבא הגואל ב\\\"ב כשראה יוסף את בחי' בנימין כי הוא יהי' עוד המשמש בהגלות כנודע. וידע כי יארכו ימי הגלות ויבא החדרה ויבך שמה על אורך הגלות איך יתקיימו ישראל בכל עת הרב הזה ובכ\\\"ז ויתאפק ויאמר שימו לחם ר\\\"ל מ\\\"מ צריך להשפיע להם לחם ומזון וכ\\\"ט בהגלות עד ביאת הגואל ב\\\"ב. וכן אמר לו אליהו לר' יוסי הי' לך להתפלל בדרך. ר\\\"ל טרם ביאת משיח לקיימם בדרך וזה הוא הקול ששמע אוי להם לבנים שגלו מעל שלחן אביהם כמ\\\"ש תערוך לפני שלחן נגד צוררי. זה השלחן אשר לפני ד':",
            "english_translation": "In the Gemara, a person's livelihood is as difficult as the splitting of the Red Sea. To understand the similarity in this, indeed through the miracle of the splitting of the Red Sea, good influences were given to Israel afterward as explained in the text immediately after the splitting of the Red Sea, they were given water and food for the journey, for the waters were sweetened, and following it the portion about the manna. And this is the matter of the seventh day of Passover which is in the aspect of foundation within kindness to bring down and influence constant kindnesses and goodness to His people Israel. And this is the aspect of Joseph saying may God add upon you and your children, blessed are you to God. For indeed this is the main thing to draw and influence good influences to Israel in exile if unfortunately the Messiah has not yet come and the days of exile are long, it is necessary to sustain Israel and influence them all good so they can exist until the coming of the Messiah and this was the aspect of Joseph about whom it was said Joseph sustained his brothers. And it is said he saw Benjamin with them etc. and he went into the chamber and wept there etc. and he restrained himself and said set bread. It is difficult why he did not reveal himself to them immediately to say I am Joseph. But this whole matter hints at the final exile until the redeemer comes speedily in our days when Joseph saw the aspect of Benjamin for he will still serve in exile as is known. And he knew that the days of exile would be long and he went into the chamber and wept there about the length of exile how Israel would survive all this great time and nevertheless he restrained himself and said set bread meaning nevertheless it is necessary to influence bread and food and all good in exile until the coming of the redeemer speedily in our days. And so Elijah said to Rabbi Yosi you should have prayed on the way meaning before the coming of Messiah to sustain them on the way and this is the voice he heard woe to the children who were exiled from their father's table as it is written you prepare a table before me in the presence of my enemies this is the table which is before God.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Festivals, Pesach 79"
        },
        {
            "section": "Torah",
            "topic": "Vaera",
            "number": "7",
            "passage": "והוצאתי אתכם מתחת סבלות מצרים והצלתי אתכם מעבודתם. יש להבין לשון סבלות מצרים וכן וידעתם כי אני ה' המוציא אתכם מתחת סבלות מצרים ובכל מקום נאמר לשון עבודה קשה.אך הנ\\\"ל בזה כי התורה מלמד' אותנו עיקר ענין הסגולה אשר בעבורה יצאו ממצרים והוא בהיות עם בנ\\\"י זרע יעקב בחירו עם קדוש גם בהיותם במצרים תחת כור הברזל ויעבידו מצרים אותם בכל עבודה קשה בכל זה נאמנה את אל רוחם ולא הרעו בלבבם לאמר למה זה אנחנו בנ\\\"י עניים ומרודים יותר מכל שארי האומות להיות נרדים בעבודת הפרך. וכי מפני שאנחנו מיוחסים לבני אבותינו הקדושים אנו נשתעבד למצרים הפחותים ושפלים. אך בכל העת ההיא קבלו הכל באהבה וסבלו עליהם גזירת הקב\\\"ה כי אם בעיניו הוא טוב גם לנו ביושר. וז\\\"ש ויצא משה אל אחיו וירא בסבלותם וכי הוא לבדו ראה. אך הכוונה בזה כי משרע\\\"ה ראה ברוה\\\"ק מדת הסבלנות של בנ\\\"י כי נתנו שכמם לקבל הכל באהבה בגזירת הש\\\"י וזה וירא הסתכל היטב בסבלותם כי לא הוקשה בעיניהם כלום על הש\\\"י ולכך זכו לגאולה כי כן נכון להיות האדם מאמין בה' בכל דרכיו ומקריו וכשם שמברכין על הטובה כו' אף אם ישיגוהו פגעי הזמן חלילה ורבו עליו המטרידים ומבטלין אותו מעבודתו ולימודו ולחבירו הגרוע ממנו לו עושר ונכסים ומנוחה. אולי ירע לבבי לאמר למה זה ה' תרדפני באפך חנם ולרעי הפחות ממני נתת כל טוב הלא טוב היה לך להעניקו מטובך כאשר כל כוונתי לשבת בבית ה' באהלי תורה ואלה הסיבות מבטלים אותי חנם. כי לא כן הדבר. כי עמקו מחשבות ה' לא יבינם כל יושבי תבל. כי אולי רצון הש\\\"י לנסותו אם יהרהר אחריו. אך זה ענין עבדות להש\\\"י להאיר מתוך חשיכה את לבבי הזך לשמים כמ\\\"ש בכל נפשך אפילו הוא נוטל את נפשך נפש הוא לשון רצון כמ\\\"ש אם יש את נפשכם. ואמר הכתוב אפי' הוא נוטל את נפשך. פי' רצונך שנוטל ממך הרצון להש\\\"י ע\\\"י טרדת הפרנסה וכיוצא אעפ\\\"כ ואהבת כו' ואל יקשה בעיניך על הש\\\"י וכמו שמצינו בהלל ששמע קול צוחה בעיר ואמר מובטח אני שזה איננו בביתי איך היה בטוח בזה הלא כל ימיו היה נדחק ביסורי עוני. אך ידע כי אין זה מדרך אנשי ביתו לזעוק על הבא להם חלילה כי מדת הסבלנות הוא מלומד בבית הצדיקים כל הימים. נחזור לביאור הכתובים שלפנינו. הנה מדת הסבלנות היא שעמדה להם לאבותינו במצרים ולכך אמר להם פרעה החכם להרע. למה משה ואהרן תפריעו את העם ממעשיו לכו לסבלותיכם. ר\\\"ל למה תפריעו אותם מעבודתם אשר להם עתה בבחי' הסבלנות ותאמרו להם לילך למדבר לעבוד שם את ה' הלא עתה טוב להם העבדות הזאת במדת הסבלנות וזהו לכו לסבלותיכם כנ\\\"ל. וזה שאמה\\\"כ ויעבידו מצרים את בנ\\\"י בפרך ודרשו רז\\\"ל בפה רך. ר\\\"ל שלא היה קשה להם כלל על הש\\\"י וזה תרגומו בפה רך בקשיו. ר\\\"ל כוונת הסט\\\"א להביא את בנ\\\"י בקושי' על הש\\\"י ולא יכלו להם כי היו בפה רך ועי\\\"ז נגאלו. האמנם כי בדור ההוא היו הנשמות הגבוהים מאד כגון נשמת ר\\\"ע וכ\\\"ד אלף תלמידים וכל הדורות האחרונים הצדיקים הגדולים וכדומה והיו יודעים בעצמם כי הם המה יהיו הצדיקים הקדושים ועכ\\\"ז עומד עליו ומכהו ומיסרהו להשלים פעולת הלבינים דבר יום ביומו. והם עמדו בסבלנות גדול כמ\\\"ש כי ראה את ענים ויקדו וישתחוו ר\\\"ל בענים יקדו וישתחוו בשפלות וסבלנות. לכן כתיב והוצאתי אתכם מתחת סבלות מצרים:",
            "english_translation": "And I will bring you out from under the burdens of Egypt and I will save you from their service. You must understand the language of the burdens of Egypt and also you shall know that I am the Lord who brings you out from under the burdens of Egypt and everywhere it speaks of hard labor. But this teaches us the main matter of the virtue for which they left Egypt, being that the people of Israel, the chosen seed of Jacob, were holy even while in Egypt under the iron furnace, and Egypt enslaved them with all hard labor, yet in all this they remained faithful to God in spirit and did not think evil in their hearts saying why are we the children of Israel poor and wretched more than all other nations to be persecuted with crushing labor, and because we are descended from our holy fathers we are enslaved to the lowly and base Egyptians, but throughout that time they accepted everything with love and bore God's decree because if it was good in His eyes it was also right for them, and this is what it means \"and Moses went out to his brothers and saw their burdens\" - did only he see? Rather the intention is that Moses saw with divine inspiration the patience of the children of Israel who gave their shoulders to accept everything with love by God's decree, and this is \"and he saw\" - he looked well at their patience for nothing was difficult in their eyes regarding God and therefore they merited redemption for so it is proper for a person to believe in God in all his ways and occurrences and just as one blesses for the good so too if troubles befall him heaven forbid and many things disturb him and prevent him from his service and learning while his inferior friend has wealth and possessions and rest, perhaps his heart will be troubled saying why God do you pursue me with Your anger for nothing while to my lesser friend You gave all good would it not be better for You to grant Your goodness as all my intention is to dwell in God's house in the tents of Torah and these circumstances prevent me for nothing, but this is not so for God's thoughts are deep and not understood by all inhabitants of the world for perhaps it is God's will to test if one will question Him but this is the matter of service to God to illuminate from within darkness one's pure heart to heaven as it is written \"with all your soul\" even if He takes your soul - soul means will as it is written \"if it is your will\" and Scripture says even if He takes your soul meaning your will that He takes from you the will to serve God through worries of livelihood and the like nevertheless \"you shall love\" and it should not be difficult in your eyes regarding God and as we find with Hillel who heard a cry of distress in the city and said \"I am certain this is not from my house\" - how was he certain of this when all his days he was pressed with poverty? Rather he knew this was not the way of his household to cry out about what befalls them heaven forbid for the trait of patience was learned in the house of the righteous all the days. Let us return to explaining the verses before us. Behold the trait of patience is what stood for our fathers in Egypt and therefore Pharaoh the evil genius said to them \"Why Moses and Aaron do you disturb the people from their work? Go to your burdens.\" Meaning why do you disturb them from their current work which is in the aspect of patience and tell them to go to the desert to serve God there - is not this service now good for them with the trait of patience and this is \"go to your burdens\" as mentioned. And this is what Scripture says \"And Egypt enslaved the children of Israel with rigor\" and our Sages interpreted \"with a soft mouth.\" Meaning it was not difficult for them at all regarding God and this is its translation \"with a soft mouth in hardship.\" Meaning the intention of the Other Side was to bring Israel to question God but they could not overcome them for they were with a soft mouth and through this they were redeemed. Indeed in that generation there were very lofty souls like the soul of Rabbi Akiva and his 24, 000 students and all the later generations of great righteous ones and the like and they knew in themselves that they would be the holy righteous ones and nevertheless one stood over him striking and chastising him to complete the work of the bricks daily and they stood with great patience as it is written \"for He saw their affliction and they bowed and prostrated\" meaning in their affliction they bowed and prostrated with humility and patience. Therefore it is written \"And I will bring you out from under the burdens of Egypt.\"",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Torah, Vaera 7"
        },
        {
            "section": "Torah",
            "topic": "Shemot",
            "number": "21",
            "passage": "א\\\"י לך ואספת את זקני ישראל ואמרת אליהם כו' פקד פקדתי אתכם ואת העשוי לכם במצרים כו' ושמעו לקולך ובאת אתה כו' . עיין רש\\\"י שפי' כשתאמר להם לשון הזה ישמעו לקולך שכבר סימן זה מסור בידם מיעקב ויוסף שבלשון הזה הם נגאלי' . יעקב אמר פקד יפקוד אתכם. יוסף פקד יפקוד אלהים אתכם כו' ע\\\"ש. הנה הרמב\\\"ן ז\\\"ל והראשוני' תמהו איך מפני סימן זה יאמינו לו ישראל הלא גם הוא מבנ\\\"י ויודע הסימן הזה אולי יאמרו כי בזדון דבר הסימן הזה ואיננו גואלם. אך הנ\\\"ל לפרש דהנה כתיב ויצא משה אל אחיו וירא בסבלותם. ויש לדקדק מה זה ראה הוא יותר משאר כל אדם ומה סיפר הכתוב בזה. אך הנה אנו אומרים וכולם מקבלים עליהם עול מלכות שמים זה מזה. יש להבין מה זה העול שייך במלאכים במה שהם מקבלים מלכות שמים הלא זה רוצים באהבה ובתשוקה הגדולה ומאי מסיים אח\\\"כ לאל ברוך נעימות יתנו כו' מצמיח ישועות בורא רפואות מאי ענין זה לכאן. אמנם הנה כבר נתבאר כי ענין יסורים של אהבה הם באותם הצדיקים המקבלים עליהם לסבול היסורים בשביל השכינה כפי המבואר בתיקון שלשה משמורות דשכינתא סובלת צערא בגין ישראל וכן בכ\\\"מ בזוהר עיין בפ' ויקהל דף רי\\\"ב שכן משיח מקבל עליו יסורין וסובל בשביל ישראל. והנה הצדיקים הם המקבלים עליהם יסורין כדי לסלק הדינין מהשכינה וז\\\"ש שם בזוה\\\"ק כגוונא דא ר' אלעזר בארעא לכן הצדיקים שבישראל בכל דור ודור מקבלים עליהם יסורין כדי לגרום אהבה למעלה לסלק הדינין מבנ\\\"י כמ\\\"ש במ\\\"א. וכן היה ר\\\"ח בן דוסא סובל צער הדוחק וע\\\"י כן היה גורם היחוד שכל העולם ניזון בשבילו כנודע. והנה זה הענין שגם המלאכים והנשמות שלמעלה מקבלים עליהם העול והיסורין של השכינה כביכול כדי לסלק הדינין מעליה. וזהו שמקבלים עליהם עול מלכות שמים האמור ביוצר אור. מלכות שמים היא השכינה כנודע והם מקבלים עליהם העול שלה לסבול עבורה. וזה שמצינו בגמ' אצל ר' עקיבא כשהוציאו להריגה והציקו לו היסורין עד מאד היה מקבל עליו עומ\\\"ש היינו הפי' כמו שבארנו. וענין מיתת ר\\\"ע כבר נודע שהיה לתיקון העולמות כמבואר בהאר\\\"י ז\\\"ל. וזה הפי' כאשר הם מקבלים עליהם עומ\\\"ש באהבה כנ\\\"ל לכך עי\\\"כ לאל ברוך נעימות יתנו שנעשה היחוד ועי\\\"כ מצמיח ישועות ורפואות וצדקות וכ\\\"ט לעולם. והנה זהו הענין שהיה ג\\\"כ במצרים שהיו בנ\\\"י מקבלים עליהם הצער והיסורין וקושי השיעבוד בגין השכינה כנ\\\"ל. וזהו כשיצא משה אל אחיו וירא בסבלותם ר\\\"ל ראה והבין זה פיהם מעצמם רוצים לסבול צער קושי השיעבוד הזה בגין השכינה כנ\\\"ל. וזהו שנאמר אח\\\"כ לישראל והוצאתי אתכם מתחת סבלות מצרים היינו שאחם סובלים בעצמיכם כי כבר אמר ואזכור את בריתי שנעשה היחוד כבר. וז\\\"ש ויקם מלך חדש כו' אשר לא ידע אתיוסף היינו שלא נעשה היחיד את יוסף לכך הוכרח להיות למען מנותו בסבלותם ענות\\\"ו הוא עונ\\\"ת וא\\\"ו לשון עונה נעשה היחוד על ידי סבלותם. לכך הנה כאשר יענו אותו כן ירבה וכן יפרוץ ע\\\"י היסורין וקבלת עומ\\\"ש יותר נעשה היחוד יותר וזהו העונה אותי ביום צרתי ע\\\"י יום צרה ח\\\"ו נעשה היחוד כמ\\\"ש וזהו יענך ה' ביום צרה וכן ועת צרה היא ליעקב וממנה יושע כי עי\\\"כ נעשה היחוד כנ\\\"ל. והנה זה ענין הפקידה האמור פקד פקדתי אתכם ואת העשוי לכם במצרי' . מרמז ענין הפקידה הזאת כמו חייב אדם לפקוד כו' . רמז על ענין היחוד הנעשה למעלה ע\\\"י בנ\\\"י וז\\\"ש ואת העשוי לכם במצרים ר\\\"ל היחוד נעשה על ידי ואת לכם שאתם הייתם מקבלים עליכם מעצמיכם קושי השיעבוד וזהו ויאמן העם כי פקד ה' וכי ראה את ענים. ר\\\"ל כאשר שמעו כך אז האמינו לדבריו מפי ה' כי נעשה היחוד כי ראה את ענים. וזה הדבר לא יוכל שום בן אדם לדעת מה היה במחשבתם בשעת העבודה בלתי ה' לבדו שראה את ענים ומחשבתם הטובה בקבלת היסורין של אהבה. וז\\\"ש ושמעו לקולך ע\\\"י הסימן של פקד פקדתי כי זהו סימן מובהק שהוא אך מפי הקב\\\"ה לבדו ית\\\"ש כנ\\\"ל:",
            "english_translation": "Go and gather the elders of Israel and say to them 'I have surely remembered you and what was done to you in Egypt' and they will listen to your voice and you will come. See Rashi who explained that when you say this phrase they will listen to your voice because this sign was already passed down to them from Jacob and Joseph that with this phrase they would be redeemed. Jacob said 'God will surely remember you' and Joseph said 'God will surely remember you.' Behold, the Ramban and early commentators wondered how because of this sign Israel would believe him, for he too was from the children of Israel and knew this sign, perhaps they would say he spoke this sign deceitfully and was not their redeemer. But it should be explained that it is written 'And Moses went out to his brothers and saw their burdens.' One must examine what he saw more than any other person and what the verse is relating here. But behold we say 'and they all accept upon themselves the yoke of heaven's kingdom from one another.' One must understand what yoke applies to angels in that they accept heaven's kingdom, do they not desire this with love and great longing, and what is concluded afterwards 'to the blessed God they give pleasantness' etc. 'who causes salvation to sprout, creates healing' - what is the relevance here.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Torah, Shemot 21"
        },
        {
            "section": "Festivals",
            "topic": "Chanukah",
            "number": "12",
            "passage": "(בפ' מקץ) וימהר יוסף כי נכמרו רחמיו אל אחיו ויבקש לבכות ויבא החדרה ויבך שמה. הנ\\\"ל לבאר בענין הסיפור הכתוב הזה כי מה ענין נכמרו רחמיו בזה מה רחמנות הי' צריך בנימין אצלו גם למה בכה יוסף ולמה ספר הכתוב ויבא החרדה ויבך שמה מה לנו באיזה מקום בכה. אך יש לרמז בזה ע\\\"ד המבו' בפע\\\"ח שער ר\\\"ח פ\\\"ג. כי עשרה טיפין שיצאו מיוסף קבל אותם בנימין זאב יטר\\\"ף יו\\\"ד טרף. שטרף הניצוצין מן החיצונים שהוא בחי' יסוד נוקבא כיל\\\"ח. וזה שהוצרך יוסף להוצאות הני\\\"ק הנה ג\\\"כ תיקון לצורך שאר העלאת הני\\\"ק ממצרים ערוות הארץ כנודע. והנה לכך כשהגיע העת התגלות יוסף לאחיו הוצרך בע\\\"כ להעלות הניצוצין שלו מקודם לחזור אליו. אח\\\"כ יוכל להטיב גם עם שאר אחב\\\"י. שענין התגלות הזה מרמז על התגלות משיח בן יוסף העתיד. ובזה יתורץ קו' הספרים למה הכריח יוסף את בנימין לבא אליו תחלה קודם התגלות ולצער את אביו כ\\\"כ הלא אח\\\"כ באו כולם אליו. אכן כנ\\\"ל ניחא כי לא יכול להתוודע אל אחיו טרם הראותו את בנימין כנ\\\"ל. וזה כשהתחבר עם בנימין שאלו יש לך בנים אמר לו עשרה. שהם היו בניו של יוסף כנ\\\"ל ולכך קראם על שם אחיו. וזהו וימהר יוסף כי נכמרו רחמיו אל אחיו. נכמר\\\"ו נכמ\\\"ר גימ' קר\\\"י והניצוצין שלו חזרו אל וא\\\"ו שהוא יוסף וזה נכמרו ואח\\\"כ אל רחמיו סוד הרחם בסוד זכו\\\"ר אזכרנ\\\"ו עוד רח\\\"ם ארחמנ\\\"ו. וזהו מחי' מתים ברחמים רבים שיש הרבה בחי' נוק' למעלה וכ\\\"א עולה לפי ערכה. וזה מחי' מתים הם הני\\\"ק שנקראו מתים ומעלה אותם ברחמים רבים של נוקבא. וזהו לא המתים יהללו י\\\"ה וכו' ואנחנו נברך י\\\"ה לכך כאשר מחי' מתים הנ\\\"ל אומרים קדושה עמהם נקדישך כו'. נחזור לעניננו הנה זהו בחי' רחמיו סוד הרחם בהעלאת ניה\\\"ק שמה. וזהו ויבא החדרה שבחי' הרחם נקרא חדר כמבו' בגמ'. וזהו ויבך שמה. כי ע\\\"י הבכי' מעלה ניצוצות כמ\\\"ש בבכי יבואו ובתחנונים אובילם. והוא החזירם למקומם שמה. וזהו האמור בתיקון חצות ואטיל דמעין לגו ימא רבא ואדכר לבנוהי מגו בכי'. כי כל הבכיה של רחל מבכה על בני' הוא רק להעלאת ניה\\\"ק. ואדכר הוא לשון דכר להחזיר הכל לשרשו. וזהו ויבך שמ\\\"ה שם ה'. וזהו ויאמר שימו לחם שהאכילה הוא העלאת ניה\\\"ק כנודע. והנה אמנם גם אחיו באו רק להעלות ניה\\\"ק כמבו' לשבור ב\\\"ר ע\\\"כ עכבם שלשה ימים אצלו אח\\\"כ הוצרך הכל לשוב אליו שהוא בחי' היסו\\\"ד. וזהו וישא משאת מאת פניו אליהם. משא\\\"ת הוא ש\\\"ם א\\\"ת. מא\\\"ת הא' מפסיק בין תיבת מ\\\"ת כי כשהעלה ניה\\\"ק מהם הנה נעשו המתים חיים. וזהו מאת פניו אליהם שבהראות פניו אליהם העלה מהם כל אותן הני\\\"ק שהוצרכו בע\\\"כ לשוב אליו כנ\\\"ל לכך ותרב משאת בנימין ממשאת כולם. שהרי בנימין הוא שהי' בו אותן הניצוצין של יוסף לכך רבה חלקו יותר. ועליו הוא שצעק בכל עת הביאו את אחיכם הקטן אלי ואשימה עיני עליו. היינו בראיית העין בו יעלה הני\\\"ק ממנו כמבואר כן בספרים יהב עיני' בו ונעשה גל של עצמות. כי כל הניצוצין שלו ושל אחרים צריכין [תיקון] על ידו כנ\\\"ל. והנה זהו ענין נר חנוכה שהוא העלאת הני\\\"ק יהי אור הוא אור של חנוכה. והנה גימ' יה\\\"י או\\\"ר רל\\\"ב גימ' ארבע שמות כנודע כי אחרי שאמר הכתוב מרחפ\\\"ת מ\\\"ת רפ\\\"ח שהם רפ\\\"ח ניצוצין ויאמר אלהים יהי אור של חנוכה לתיקון הזה של ד' שמות שמכולם נפל כנ\\\"ל וע\\\"י נ\\\"ח יחזרו להתיקון וממשיך יהי שם י\\\"ה ליו\\\"ד להתיקון. וזהו אח\\\"כ ויבדל אלהים בין האור ובין החושך שמתחלה היו משתמשין בערבוביא פי' קודם התיקון הם הני\\\"ק משתמשין בערבוביא. אח\\\"כ נבדלים מעתה. וזהו הרגיל בנר חנוכה הווין לו בנים ת\\\"ח. פי' הבנים הם שלו כי יחזרו אליו. והמעלה ני\\\"ק זוכה גם לת\\\"ח. וזה ענין מרגלי\\\"ם אתם רג\\\"ל י\\\"ם כמו שאמרו עד שתכלה רגל מן השוק להעלות הנפילה מבחי' רגל גימ' ד' שמות מן השוק הוא בחי' הקליפות שוק הוא רה\\\"ר כיל\\\"ח. וזהו הרמז בהאר\\\"י ז\\\"ל. ובא לציון \\\"גואל \\\"ולשבי \\\"פשע \\\"ביעקב \\\"נאום \\\"ד' \\\"ואני כו' ר\\\"ת גו\\\"ף בני\\\"ו כנודע שהוא להחזירם ולהשיבם אל מקומם שזה הוא בחי' מהדרין מן המהדרין. וזהו הוד והדר פעלו. מבחי' הוד של אהרן זה שהי' ע\\\"י כהניך הקדושים הדר פעלו בחי' המהדרין הכל לשרשו בנר חנוכה כנ\\\"ל והבן:",
            "english_translation": "And Joseph hurried because his compassion was stirred toward his brother and he sought to weep, and he went into the chamber and wept there. The aforementioned explains regarding this written story what is the matter of his compassion being stirred in this, what compassion did Benjamin need from him, and also why did Joseph weep and why did the text tell us he went into the chamber and wept there, what does it matter to us where he wept. But this can be hinted at according to what is explained in Pri Etz Chaim Gate of Rosh Chodesh Chapter 3, that the ten drops that came from Joseph, Benjamin received them - wolf shall tear ten tears - that tore the sparks from the external forces which is the aspect of the feminine foundation as is known. And this that Joseph needed to bring out these sparks was also a correction needed for the remaining elevation of sparks from Egypt, the nakedness of the land as is known.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Festivals, Chanukah 12"
        },
        {
            "section": "Torah",
            "topic": "Achrei Mot",
            "number": "5",
            "passage": "כתונת בד קדש ילבש כו'. ד' בגדי כהונה הללו כבר נתבאר בפר' וישב בענין כתונת הפסים מבואר במד\\\"ר שעשה לו ד' בגדים. וצריך להבין מה שקנאו בו אחיו עבור משקל ב' סלעים. אולם יבואר עפ\\\"י הידוע שכל ההשפעות יורדים למטה מעולם העליון מחמת המצות ומעש\\\"ט שנעשי' למטה. אך צריך שמירה גדולה מהחיצונים לבל יבוזו זרים מחמת הפגמים שעושים בנ\\\"א וז\\\"ש ועזבו לאחרים חילם. ובזמן שיש צדיק בעולם אשר ההשפעו' יורדים על ידו הוא עושה להם לבוש לצמצם השפע להיות יורד רק לבנ\\\"י עם סגולתו ולא תתפשט להחיצוני' כלל. וז\\\"ש כי לא המטיר כו' ואדם אין לעבוד את האדמה. פי' כל זמן שלא הי' אדם בעולם להיות צנור היורד השפע על ידו לא הי' יכול להוריד השפעות. ודבר זה הי' משתלשל עד יעקב אבינו ע\\\"השהוא הי' הצי\\\"ע והי' רצונו למסור אותו הכח ליוסף כמ\\\"ש כי בן זקונים הוא לו לכן עשה לו כתונת פסים בחי' לבוש לצמצם השפע היורד על ידו כמ\\\"ש יכין רשע וצדיק ילבש. ר\\\"ל הרשע עושה הכנה לחטוף השפע. והצדיק עושה לבוש להיות מכוסה לבל יבוזו זרים. וזה ג\\\"כ וילבש צדקה כשריון. וז\\\"ש ויברך אלהים את יום השביעי. הצדיק נקרא אור שבעת הימים. ויקדש אותו. מדת היסוד. אשר ברא אלהים לעשות. עולם העשיה מתנהג ע\\\"י הצדיק. ולזה קנאו בו אחיו. במה שבחר בו להיות בחי' היסוד צי\\\"ע. לכן הפשיטו את כתנתו אלו ד' בגדים להפשיט ממנו כח הצי\\\"ע. וזה היה מעוות אשר לא יוכל לתקן כי ירדו כל ההשפעו' למצרי' כמ\\\"ש כי יש שבר במצרים ובביתו של יעקב הי' חסר לחם. וז\\\"ש יעקב כתונת בני חיה רעה אכלתהו טרוף טורף יוסף כי ע\\\"י שהפשיטו את כתונת יוסף ירד השפע להחיצונים וטרף עולה רפ\\\"ח עה\\\"כ כמנין רפ\\\"ח ני\\\"ק שירדו לחיצוני'. חיה רעה אכלתהו. ר\\\"ל הרשעי' יקחו כל ההשפעות. וז\\\"ש ולא נחלו על שבר יוסף. וז\\\"ש ויקח משה את עצמות יוסף עמו כי השבע השביע כו' פקד יפקוד אלהי' אתכם. רצ\\\"ל פקיד' ההשפעה יהי' אתכם לבל יבוזו זרים. וכן הדבר נוקב והולך בכל דור ודור צריך להיות צי\\\"ע שעל ידו ילכו ההשפעו' ביושר לצדיקים לכן מובחר האנושי הוא הכה\\\"ג שנכנם לפני ולפנים בי\\\"כ ואז הורדת השפע על כל השנה עבור בנ\\\"י והי' צריך שמירה מעולה מהחיצונים ולכן כאשר נכנם לפני ולפנים הי' צריך ללבוש ד' בגדים כשנכנם לפנים ובחוץ שמונה בגדים. וזה שמצינו בלשון המשנה במס' יומא בבגדי כהונה בלשון כלים כמ\\\"ש בשחר הי' לובש כו' דהול\\\"ל בגדים. אך כלי הוא לשון בית קבול לרמז על הנ\\\"ל לצמצם השפע רק לכנ\\\"י. וז\\\"ש כאן כתונת בד קדש ילבש כו' בגדי קדש הם שיהי' הקדושה רק לצדיקים לכן נקרא ת\\\"ד י\\\"ג מכילין דרחמי כיל\\\"ח. כי הם ג\\\"כ לשון כלים להכניס בהם השפע עבור כנ\\\"י (ולזה חשבו כל פועלי און. לבטל מבנ\\\"י מצות ה'). והבן:",
            "english_translation": "A holy linen tunic he shall wear and these are the four priestly garments as already explained in the portion of Vayeshev regarding the striped tunic explained in the Midrash that he made him four garments and one must understand why his brothers were jealous of him over the weight of two selas but it will be explained according to what is known that all influences descend below from the upper world because of the commandments and good deeds that are done below but great protection is needed from external forces lest strangers plunder due to the blemishes that people make and this is what is meant by \"they leave their wealth to others\" and when there is a righteous person in the world through whom the influences descend he makes them a garment to constrain the abundance to descend only to the children of Israel His treasured people and not spread to external forces at all.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Torah, Achrei Mot 5"
        },
        {
            "section": "Torah",
            "topic": "Lech Lecha",
            "number": "24",
            "passage": "א\\\"י בדרך זה. ויעל אברם ממצרים. הנה הרמב\\\"ן הקשה למה היה צריך ללכת למצרים ע\\\"ש. וי\\\"ל עפ\\\"י. מ\\\"ש בזוה\\\"ק שלא ירד יעקב אבינו למצרים להשתקע אלא לגור שם. וגם כתיב כי גרים הייתם בארץ מצרים. וכן איתא בגמ' לא גלו ישראל אלא שיתוספו עליהם גרים. דהנה ידוע שיש כמה נשמות קדושות המפוזרים בין עובדי כוכבים לכן ירדו בנ\\\"י למצרים להעלות הני\\\"ק משם. וז\\\"פ כגן ה' כארץ מצרים. כמו שיש נשמות הצדיקים בג\\\"ע כך יש ג\\\"כ נשמות קדושות מפוזר במצרים שצריכים להעלותם למקור מחצבתם. וז\\\"ש לאברהם לך לך מארצך וכו' כי שם כבר תיקן להעלות הני\\\"ק כמ\\\"ש ואת הנפש אשר עשו בחרן. וצוה אותו ללכת למקומות אחרים לתקנם. וזה שגרם לו ללכת ג\\\"כ למצרים. וז\\\"ש לא ירד יעקב למצרים אלא לגור שם פי' לעשותם גרים הם הני\\\"ק וזהו ג\\\"כ מ\\\"ש בגמ' לא גלו ישראל אלא כדי שיתוספו עליהם גרים הם הני\\\"ק כנ\\\"ל. ובזה יובן הכ' אצל נח ויסגור ה' בעדו מה שנזכר כאן שם הוי' יען כי היה צריך לרחמים כי בדור המבול היו נשמות גבוהים אך בגופם קלקלו ורצו להתדבק. בנח כדרך הני\\\"ק הנפזרים תשוקתם להתדבק בצדיקי' החיים בעוה\\\"ז ובנח לא היה כחו גדול להעלותה. וז\\\"ש ויסגור ה' בעדו שלא הניח הנשמות להתדבק בו. אך לאחר יציאתו מן התבה אירע לו המעשה כו' כמובן. וז\\\"ש כאן באברהם ויעל אברם ממצרים שהעלה כל הני\\\"ק. לכן עתה אמר ללוט הפרד נא מעלי כו' כמבואר לעיל. וז\\\"ש הלוך ונסוע הנגבה. היינו הנשמות היבישות כמ\\\"ש ארץ הנגב. כי הנשמו' היבישות נסעו לקראתו וד\\\"ל. וז\\\"ש ויקרא שם אברם בשס ה'. לשון קריאה ואסיפה שהכניס ואסף אותם הנשמות בשס הוי' ב\\\"ה. וזהו \\\"ואגדלה\\\" שמך שהוא וא\\\"ו ה' ובנתים אותיות אגד\\\"ל. וזהו ג\\\"כ \\\"ואברכה\\\" מברכיך ופרש\\\"י זהו שאומרים אלהי אברהם פי' הנשמות שהעלה אותם הם האומרים אלהי אברהם:",
            "english_translation": "And it can be explained in this way. And Abram went up from Egypt. Behold Ramban asked why he needed to go to Egypt, see there. And it can be explained according to what is written in the holy Zohar that our father Jacob did not go down to Egypt to settle but to dwell there. And it is also written that you were strangers in the land of Egypt. And so it says in the Gemara that Israel was only exiled so that converts would be added to them. For it is known that there are many holy souls scattered among idol worshippers therefore the children of Israel went down to Egypt to elevate these holy sparks from there. And this explains \"like the garden of God like the land of Egypt.\" Just as there are souls of the righteous in the Garden of Eden so too there are holy souls scattered in Egypt that need to be elevated to their source. And this is what was said to Abraham \"go forth from your land\" etc. because there he had already fixed to elevate the holy sparks as it says \"and the souls they made in Haran.\" And He commanded him to go to other places to fix them. And this is what caused him to go also to Egypt. And this is what is meant that Jacob did not go down to Egypt except to dwell there meaning to make them converts these are the holy sparks and this is also what the Gemara says that Israel was only exiled so that converts would be added to them these are the holy sparks as mentioned above.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Torah, Lech Lecha 24"
        }
    ],
    "timestamp": "2024-12-24T09:41:40.407429",
    "metadata": {
        "total_passages_processed": 109,
        "selection_criteria": "Passages with average score above 7.0",
        "scoring_version": "3.0"
    }
}