{
    "question": "in which scenario can it appear as if a person is lying in his prayers?",
    "analyzed_passages": [
        {
            "source": "Tiferet Shlomo, Torah, Bereshit 40",
            "relevant_sentences": "אין משפטים ישירים",
            "passage": "וישמעו את קול ה' אלהים מתהלך כו' ויתחבא האדם ואשתו בתוך עץ הגן ויקרא לו ויאמר איכה וכו' ואירא כי עירום אנכי ואחבא. ויאמר מי הגיד לך כי עירום אתה המן העץ אשר צויתיך לבלתי אכל ממנו אכלת. ההרגש בפסוקים הללו מבואר בראשונים. והנראה בפירוש הענין ע\\\"ד מאמרם ז\\\"ל שקראו לאדה\\\"ר גנב שגנב מעץ הדעת לכך ויתחבא כי כאשר הבין האדם בעצמו שחטא מאד כי ראה הנחש כרוך אחריו ורע עליו המעשה כמ\\\"ש וידעו כי עירומים הם ערומים מכל מצוה ומכל טובה לכך ויתחבא בתוך עץ הגן הוא התורה ע\\\"ש ג\\\"ן פרשיות לתורה כמבואר בזוה\\\"ק והתחבא בתורה להמלט מזוהמת הנחש. ויקרא לו ה' איכה. ר\\\"ל איכה תמצא ידך ורגליך אחרי עשות המעשה כזה והשיב את קולך שמעתי ואירא כי עירום אנכי מכל טובה. ואמר לו הקב\\\"ה מי הגיד לך כי עירום אתה כי זה דרך הסט\\\"א וכל הדבקים בה להתנשאות ולגבהות לאמר כי חף אנכי מפשע כמו שאנו רואים כל הרשעים אומרים לנפשם צדיקים אנחנו ולא חטאנו וכמו זה אמה\\\"כ הנני נשפט אותך על אמרך לא חטאתי. כי כן דרך היצה\\\"ר מסמא את עיני אדם לאמור כי בכל אשר הוא עושה עדיין לא חטא כלל ועודנו לא נתרחק כלל מהש\\\"י ואדרבא הוא מתאמר בנפשו עוד לאמור כי מצוה הוא עושה כל הימים כמו שהשיא לחוה לאמר והייתם כאלהים לכן ההתחלת העבדות שיהיה האדם מכיר בעצמו כי חטא לה'. וצריך להיות תמיד פלס ומאזני משפט לפלס דרכיו אם יכונו באמת לה' ולא יעשה בנפשו שקר כמ\\\"ש דוד המלך ע\\\"ה ה' לי בעוזרי ואני אראה בשונאי. ר\\\"ל ה' לי בעוזרי עי\\\"כ אוכל לראות ולהכיר בשונאי לידע מי הוא האוהב אותי ומי הוא השונא המפתה אותי לדרך רעה כי היצה\\\"ט ויצה\\\"ר שניהם מפת' לדרך מצוה אך זה חלקו בחיים וזה אחריתו דרכי מות. לכן הודיעני דרך זו אלך. הורני ה' דרכיך. תעיתי כשה אובד בקש עבדך. ואל יהיה דבר זה קטן בעיני האדם לשום עינא פקיחא על נפשו בכל עניניו כי מצינו כן בצדיקים הגדולים שלא הכירו במעשיהם וחשבו למצוה והיה בהיפך כמו ענין מכירת יוסף כי עברו כ\\\"ב שנים ולא ידעו כי עשו עולה עד שראו תפיסת אחיהם ואת בנימין. אז אמרו אבל אשמים אנחנו וכתיב מיד אחריו כי המליץ בינותם ע\\\"י שהכירו שחטאו נעשה מליץ טוב עליהם. וכן היה רדיפת שאול לדוד כי סבור היה כי הוא מצוה להורגו. מעתה ק\\\"ו ב\\\"ב של ק\\\"ו לאנשים פחותי ערך כמונו עורי לב שכלו ימיהם בהבל צריך להבין ולהשכיל בפתוי היצה\\\"ר להנצל ממצודתו ודבריו הטובי' ולדעת כי איש חוטא הוא. וכזה המליצו חכז\\\"ל יש צדיק וטוב לו צדיק ורע לו רשע וטוב לו. ר\\\"ל שאומרים לנפשם כי טוב הוא ואינם יודעים בעצמם שום חטא כי הוא דומה בעיניו לצדיק וטוב לנפשו מאד. וז\\\"ש ג\\\"כ כאן מי הגיד לך כי עירום אתה המן העץ אכלת ועודך מכיר שחטאת מאין בא לך זאת והשיב כי האשה אשר נתת עמדי היא נתנה לי ומבואר במד\\\"ר כי הוא שוגג ולכך בשוגג כתיב או הודע אליו חטאתו כי עודנו זוכה להתוודע אליו חטאתו אבל במזיד אינו יודע כלל שחטא כי הכל טוב בעיניו וכשר לפניו. וד\\\"ל:",
            "explanation": "ביאור העניין הוא שבשעת התפילה, כאשר האדם אינו מכיר בעצמו כי חטא לה', עלול להיראות כאילו הוא משקר בתפילתו, שכן היצר הרע מסמא את עיניו לחשוב כי הוא צדיק ולא חטא, וכך פיו ולבו אינם שווים."
        },
        {
            "source": "Tiferet Shlomo, Festivals, Shaar Tefillah 12",
            "relevant_sentences": "אין משפטים ישירים",
            "passage": "ר' אלעזר יהיב פרוטה לעני והדר מצלי. היינו לעורר רחמים בעולם עוד י\\\"ל עפ\\\"י דברי רז\\\"ל מרבה צדקה מרבה שלום. שלום יעשה לי שהנותן צדקה עושה שלום בין הקב\\\"ה להעני. שהעני הולך ומהרהר ח\\\"ו בלבו על הקב\\\"ה לכל הוא נותן פרנסה כו'. ור\\\"א הי' נותן על הכוונה זו. לכן הי' נותן לו בבקר מיד כדי שהעני יהי' יכול להתפלל ולהודות להקב\\\"ה שהזמין לו פרנסתו דאל\\\"כ בשעת התפלה הי' יכול העני ח\\\"ו להיות קורא תגר על הקב\\\"ה. וז\\\"פ ר\\\"א יהיב פרוטה לעני והדר מצלי. היינו העני הי' מתפלל אח\\\"כ: (מכי\\\"ק)",
            "explanation": "ביאור העניין הוא שבשעת התפילה, אם העני אינו מקבל פרנסתו, עלול הוא להרהר בלבו ח\"ו על הקב\"ה ולקרוא תגר, ונראה כאילו פיו ולבו אינם שווים, ולכן ר' אלעזר היה נותן צדקה לעני קודם תפילתו כדי שיוכל להתפלל בלב שלם ולהודות להקב\"ה."
        },
        {
            "source": "Tiferet Shlomo, Festivals, Rosh Hashanah 42",
            "relevant_sentences": "אין משפטים ישירים",
            "passage": "וזכור לנו ד' אלהינו אהבת הקדמונים. הנ\\\"ל בענין הזכרונות. דהנה כבר כתבנו בפנים על מ\\\"ש אזהרה בענין הזכרון דכתיב מחה תמחה את זכר עמלק מתחת השמים לא תשכח. הכוונה בזה שהאדם צריך למחות ולעקור ולבטל מקרבו מזכרת של היצה\\\"ר מה שהוא מעורר אותו ומזכירו תאוות וצרכי עולם הזה בדברי שוא ותפל ומה גם כי בשעת התפלה ולימוד התורה כשאדם נותן אל לבו להיות נכון לעמוד לפני הש\\\"י הוא מבלבל אותו בתחבולותיו ומזכירו דאגת עולם הזה וצרכי ביתו ופרנסתו. לכן גם מה שלומד בעת ההיא בא לבחי' השכחה כי איננו יכול לעבוד בשמחה. לכן הזהיר הכ' מחה תמחה את זכר עמלק הוא היצה\\\"ר מה שהוא מזכירך ומבלבל אותך תמחה מלוח לבבך. עי\\\"כ לא תשכח את כל דברי התורה שתלמוד. אך זאת יעלה על זכרונו כי הוא עומד לשרת לפני ד' ית\\\"ש. וז\\\"ש ד' הפיר עצת גוים הניא מחשבות עמים. רבות מחשבות בלב איש ועצת ד' היא תקום. ר\\\"ל ד' נותן לו עוז לאדם להפר ולהניא מלבו המחשבות רעות של העמים ותאוותם רק עצת ד' מה שנוגע לעבדות הש\\\"י היא תקום. והנה כאלה מחשבות וזכרונות הש\\\"י הוא הנכון. וזה שהבטיח הש\\\"י בתוה\\\"ק וזכרתי להם ברית ראשונים ר\\\"ל אעלה להם בלבבם לזכרון העבדות של הראשונים האבות הקדושים שהמשיכו אל העולם עבודה וקדושה. וז\\\"ש מבקשים זכרנו בזכרון טוב לפניך וזכר לנו ד' אלהינו אהבת הקדמונים בחי' האהבה של הקדמונים שעבדו את ד' מאהבה לנכון וזהו הזוכר למזכיריו טובות זכרונות. הש\\\"י הוא.. המזכיר אותנו זכרונות טובות של הקדושה כנ\\\"ל. וזהו הפי' זכרנו לחיים מלך חפץ בחיים. ר\\\"ל תזכירנו למה אנו חיים בזה כדי שיהי' לנו חיים אמיתים במה שהמלך חפץ בחיים כאלה. כמ\\\"ש ושמרתם מצותי וכו' וחי בהם אני ד'. וז\\\"ש בגמ' אמרו לפני פסוקי מלכות כדי שתמליכוני עליכם זכרונות כדי שיעלה זכרוניכם לפני. ר\\\"ל ע\\\"י שתמליכוני עליכם ותקבלו עליכם עול מלכותי עי\\\"כ יעלה זכרוניכם לפני. שיהי' לכם מחשבות קדושות שתזכרו תמיד באחדות הש\\\"י. וז\\\"ש ביעלה ויבא וכו' זכרונינו ופקדונינו. פי' שנזכור תמיד להתפלל על משיח בן דוד וירושלים ועל כל בית ישראל לטובה. וזהו ענין תפלת הזכרונות וע\\\"ז סיום הברכה זוכר הברית שהקב\\\"ה יזכירנו ברית האבות לעבדו באמת כמוהם לעולם אמן כי\\\"ר:",
            "explanation": "ביאור העניין הוא שבשעת התפילה, כאשר האדם עומד לפני השם יתברך, היצר הרע מבלבל אותו במחשבות על דאגות העולם הזה, וכך נראה כאילו פיו ולבו אינם שווים, ולכן יש למחות את זכר עמלק מלוח לבבו כדי שיוכל לעבוד את השם בשמחה ובכוונה טהורה."
        },
        {
            "source": "Tiferet Shlomo, Festivals, Shemini Atzeret 27",
            "relevant_sentences": "\"מכ\\\"ש אם ח\\\"ו האדם חוטא בברית פשיטא שאין תפלתו נשמעת ואין תורתו עולה למעלה.\"",
            "passage": "ה' עוז לעמו יתן ד' יברך את עמו בשלום. ויהיו נא אמרינו לרצון לפני אדון כל. הסמיכות של ב' הפסוקים הללו. נקדים לפרש הפסוק בתהלים. יפיפית מבני אדם הוצק חן בשפתותיך. חגור חרבך על ירך גבור הודך והדרך. עוד נקדים לפרש הפסוק. כל ארחות ד' חסד ואמת לנוצרי בריתו ועדותיו. דהנה ידוע שברית הלשון וברית המעור מכוונים זה כנגד זה כמבואר בספרים הקדושים דאם האדם איננו שומר את הדיבור אז ממילא בא לידי פגם הברית ח\\\"ו כמ\\\"ש בס' ראשית חכמה ובס' תומר דבורה על פסוק אל תתן את פיך לחטיא את בשרך. בשרך היינו הברית קודש כמ\\\"ש ועל בריתך שחתמת בבשרנו ע\\\"ש. ומכ\\\"ש אם ח\\\"ו האדם חוטא בברית פשיטא שאין תפלתו נשמעת ואין תורתו עולה למעלה. ובזה פרשתי המשנה אל תרבה שיחה עם האשה כו' מכאן אמרו המרבה שיחה כו' ובוטל מדברי תורה היינו שמבטלים דברי תורה שלו שלמד ושילמוד הכל הולך לסט\\\"א וכעין שאמרו מדאורייתא בביטול בעלמא סגי ולהוי כעפרא כו' אמרו פ\\\"ה גימט' מיל\\\"ה ובזוהר הקדוש \\\"מי \\\"יעלה \\\"לנו \\\"השמימה ר\\\"ת מילה. דהיינו אם האדם שומר את הברית אז תפלתו עולה השמימה. ובזה פרשתי והי' עקב תשמעון. עקב הוא שמירת הברית כידוע. ושמר ד' אלהיך לך את הברית לא יהי' בך עקר ועקרה ודרשו רז\\\"ל לא תהי' תפלתך עקורה היינו ע\\\"י שמירת הברית לא תהי' תפלתך עקורה ותהי' נשמעת למעלה. ובז\\\"פ נצור לשונך מרע ושפתיך מדבר מרמה. כפל הלשון לשונך ושפתיך. רמוז על שמירת הלשון וברי\\\"ק. וכ\\\"ז שהאדם אינו נשמר משמירת הברית ושמירת הפה אין המצות ומעש\\\"ט שלו הולכים למעלה רק לסט\\\"א ח\\\"ו. ולזה אמר מי האיש החפץ חיים כו' נצור לשונך מרע. ולזה אמר כל ארחות ד' חסד ואמת לנוצרי בריתו ועדותיו. דהיינו שהחסדים הולכים רק לבני ישראל שהם נוצרי בריתו ועדותיו. ונבוא לביאור הפסוקים הללו. יפיפית מבני אדם הוצק חן בשפתותיך. הנה ידוע שלא נכתב לשון חן רק לשומרי בריתו כגון אצל נח כתיב ונח מצא חן בעיני ד'. שכל דורו לא היו שומרים את הברית ונח שמר בריתו. ואצל יוסף כתיב ג\\\"כ לשון חן וימצא חן בעיניו. ויתן חנו בעיני שר בית הסוהר. וזהו חן וכבוד יתן ד' לא ימנע טוב להולכים בתמים. תמים הוא מי ששומר הברית כידוע בזוה\\\"ק. ויעקב איש תם נח צדיק תמים. ולזה יתן להם חן ולא ימנע טוב שיסוד העליון נקרא טוב כידוע. ולזה אמר הוצק חן בשפתותיך. היינו שהתפלות יתקבלו למעלה. וגם מצא חן בעיני ד' וע\\\"ז אמר מהיכן האדם זוכה לזה. חגור חרבך על ירך גבור הודך והדרך היינו שמירת היסוד כמבואר בזוהר הקדוש (פ' וארא דף כ\\\"ו). שפסוק הזה מרמז על שמירת הברית. ולזה אמר ד' עוז לעמו יתן הוא ספירת היסוד כמבואר בכוונת האר\\\"י ז\\\"ל ד' יברך את עמו בשלום. שלום הוא ג\\\"כ יסוד כמ\\\"ש במקום אחר מזה. ולזה אמר ויהיו נא אמרינו לרצון לפני אדון כל. אדון הוא ספירת המלכות כידוע כל הוא ספירת היסו\\\"ד כמבואר בכתבי האר\\\"י ז\\\"ל על ואתה מושל בכל ע\\\"ש. אדו\\\"ן כ\\\"ל הוא יחוד הוי' אדנ\\\"י וק\\\"ל. ולזה אנו אומרים בברכת המזון. במרום ילמדו עליו ועלינו זכות שתהא למשמרת שלום. היינו שמירת הברית הוא יסו\\\"ד ונמצא חן ושכל טוב וכו' שלאחר שמירת היסוד נמצא חן בעיני אלהים ואדם כמו שמצינו ביוסף הצדיק וק\\\"ל: (מכי\\\"ק)",
            "explanation": "ביאור העניין הוא שכאשר האדם חוטא בברית, תפילתו אינה נשמעת ותורתו אינה עולה למעלה, ולכן נראה כאילו הוא משקר בתפילתו, שכן פיו ולבו אינם שווים, כי אין כוונתו מתקבלת בשמים."
        },
        {
            "source": "Tiferet Shlomo, Torah, Miketz 4",
            "relevant_sentences": "אין משפטים ישירים",
            "passage": "ויהי מקץ וכו'. פרש\\\"י כל לשון קץ סוף הוא. הנראה לרמז בדבריו הקדושים עפ\\\"י מ\\\"ש בפי' הפיוט קדם רבון עלמין במילין סתימין וכו'. להורות לכל איש בגשתו אל הרנה ואל התפלה על כל מחסורו בעניני עוה\\\"ז אשר יחסר לו לא ישים מגמתו על מצוקותיו רק יהיה עיניו ולבו על גודל צער גלות השכינה כמ\\\"ש בספרים על המשנה באבות דע מה למעלה ממך. פי' מהחסרון שחסר לך למטה תוכל להבין החסרון שנוגע למעלה צער גלות השכינה. וז\\\"ש ושמחתים בבית תפלתי תפלתם לא נאמר אלא תפלתי. פי' שיהיה עיקר תפלתם למען כבודו ית\\\"ש. וזה הרמז בגמ' שנים שנכנסו להתפלל. פי' בשעת התפלה צריך להיות בשני בחי'. מה שנוגע למעלה וגם בצרכי נפשו למטה. לכן במשה רבינו כשהיה מתפלל עבור אחותו כתיב אל נא רפא נא לה. הרמז בזה רפא נא לה' האחרונה בשם הוי' לעשות היחוד למעלה ואז ממילא תתרפא. וז\\\"פ לא על צדקותינו אנחנו מפילים תחנונינו לפניך כי על רחמיך הרבים. וז\\\"ש ואתה ברחמיך הרבים עמדת להם בעת צרתם. פי' שהעמידו נגד עיניהם צער גלות השכינה שהקב\\\"ה כביכול סובל גודל צער בנ\\\"י וכאשר באו למדריגה זו לעורר רחמי שמים אז נצמח להם הישועה רבת את ריבם. העולה מזה כי גם בכל נוסח התפלה שאנו מתפללים בשמ\\\"ע רפאנו ברך עלינו וכדומה הנראי' לעיני בשר כי הם דברים פשוטים הנצרכים בעוה\\\"ז. אמנם הם עומדים ברומו של עולם. וז\\\"פ קדם רבון עלמין במילין סתימין. כי במחשבה היא דברים סתומים לכן עולה לרצון למעלה. וז\\\"ש שועתנו קבל ושמע צעקתנו יודע תעלומות. פי' מה שאנו צועקים על מחסורינו אתה היודע תעלומות לבבנו כי כל כוונתינו על צער גלות השכינה כנ\\\"ל. ונחזור לענין הנ\\\"ל שזה רמז בדברי רש\\\"י במתוק שפתיו. רהי מקץ כל לשון קץ. פי' הצדיק כזה אשר כל לשונו בתפלתו הוא רק על הקץ ומצפה לישועת ה'. סוף הוא. פי' הוא אשר יזכה להיות בסוף ולראות במהרה בישועה ונחמה בבוא הגאולה ב\\\"ב. אמן:",
            "explanation": "ביאור העניין הוא שבשעת התפילה, כאשר האדם מתמקד רק בצרכיו האישיים ואינו שם לב לצער גלות השכינה ולכבוד ה', נראה כאילו תפילתו היא שקרית, כי עיקר הכוונה צריכה להיות למען כבודו יתברך ולא רק על מחסורו הפרטי."
        },
        {
            "source": "Tiferet Shlomo, Festivals, Rosh Hashanah 17",
            "relevant_sentences": "\"אין משפטים ישירים\"",
            "passage": "א\\\"י אתם נצבים היום כולכם לפני ד' אלהיכם. ידוע מ\\\"ש המפרשים שזה רמז על יום ר\\\"ה. היום זה ר\\\"ה. ומרמז לנו הכתוב דרך הישרה בגשתו אל הרנה ואל התפלה להיות כל מגמתו רק על מה שנוגע לכבוד הבורא ב\\\"ה על צער גלות השכינה. וז\\\"ש הרמב\\\"ן על מ\\\"ש בגמ' ולעבדו בכל לבבכם עבודה זו תפלה כי הוא באמת עבודה קשה לגמור כל נוסח התפלה במחשבה נכונה שיהי' כוונתו למעלה. כי אם ישים כל מגמתו מה שיחסר לו היא תפלה פסולה כנודע. וזה הי' מעלת ר\\\"ח בן דוסא שאמרו עליו כל העולם ניזון בשביל חנינא בני וחנינא בני די לו בקב חרובין. כי הי' מסתפק במיעוט בדבר המצוי לו בכל עת ולא הוצרך לבקש עבור צרכיו מאומה רק מה שנוגע למעלה כבוד הבורא וכללות ישראל לכן הוא הי' צנור השפע לכלל ישראל. וזה הפי' (בתהלים ק\\\"א). תפלה לעני כי יעטוף ולפני ד' ישפוך שיחו. פי' שהוא עני כי יעטוף לשון איחור כמ\\\"ש והיו העטופים כו' וישליך אחר גיוו כל הצטרכות שלו הנוגע לעצמו. רק לפני ד' ישפוך שיחו. מה שנוגע לכבוד הבורא יהי' עיקר תפלתו כנ\\\"ל. וזה הרמז (בר\\\"ה דף ח' ע\\\"ב) במאמר הגמ' דאמר רב חסדא מלך וצבור מלך נכנס תחלה לדין וכו'. איבעית אימא לאו אורח ארעא למיקם מלכא אבראי כו'. רב חסדא פי' רב חסד. מלך וצבור פי' מה שנוגע לכבוד המלך ממ\\\"ה הקב\\\"ה. וצבור היינו מה שנוגע צרכי כללות בנ\\\"א. מלך נכנס תחלה. פי' תחלת ועיקר מגמת תפלתו יהי' מה שנוגע לכבוד הבורא מלכו של עולם על צער גלות השכינה דלאו אורח ארעא דליקום מלכא אבראי. והבן. כי כאשר האדם עומד בר\\\"ה במסירות נפש ולא ישגיח עבור עצמו כלל רק עבור גלות השכינה אז ממילא בטילים כל המקטריגים ומסטינים אשר עליו. כמ\\\"ש כתות מכתת שיעורי'. כי אם האדם שפל בדעתו ובטל במציאותו מחמת המסירות נפש וכל העומד לשרוף כשרוף דמי והוא כאין ומי יעמוד עליו לשטנו. ואז ממילא ימולא כל משאלות לבו וכל צרכיו לטובה. כי באמת יש לנו להשען על אבינו שבשמים כי הוא אדון המושיע בכל צרותינו. אך השכינה הקדושה אין עוזר לה בלתי אם אנו נתעורר תחלה באתערותא דלתתא. וז\\\"ש ימלא ד' כל משאלותיך ר\\\"ל כל משאלות לבבך יהי' ימלא ד' שיהי' שם הוי' בשלימות בלי פירוד. וז\\\"ש אתם נצבים. אתם אותיות אמת. נצבים היום כולכם. היום הוא ר\\\"ה יהי' כל עמדו ומצבו לתפלה. לפני ד' מה שנוגע לכבוד הש\\\"י. ואז ממילא ישמע לקול תפלתנו למלאות כל משאלות לבבינו אמן:",
            "explanation": "ביאור העניין הוא שבשעת התפילה, כאשר האדם מכוון את תפילתו רק לצרכיו האישיים ולא לכבוד הבורא ולצער גלות השכינה, אזי תפילתו נחשבת כפסולה ונראה כאילו הוא משקר בתפילתו, שכן עיקר התפילה צריך להיות למען כבוד השם וכלל ישראל."
        },
        {
            "source": "Tiferet Shlomo, Torah, Vaetchanan 20",
            "relevant_sentences": "גם בעמדם בתפלה שפתותיהם נעות ולבם בל עמהם.",
            "passage": "רק השמר לך ושמור את נפשך מאד כו' ופן יסור מלבבך כל ימי חייך והודעתם לבניך ולבני בניך כו' יום אשר עמדת כו' אשר ילמדון ליראה אותי כל הימים אשר הם חיים עלהאדמה ואת בניהם ילמדון. הנה לכאורה אין קשור לפסוקים הללו. גם מה שאמר פן יסורו מלבבך והודעתם לבניך. כיון שיסורו מלבבו איך יודיעום לבניהם. ונראה לפרש בדרך צחות על אותן בני אדם שהם עסוקים בהבלי עולם ומטפשין ומסירים מעל לוח לבם מצות השי\\\"ת. גם בעמדם בתפלה שפתותיהם נעות ולבם בל עמהם. ורק את בניהם אשר יוולד להם הם מייסרין אותם ללכת אל בית הספר שלא לבטל רגע אחת רק יעסקו בתורה ותפלה. והוא אינו משים אל לבו מה שהוא ממעט בעבודתו ית\\\"ש ואיך ימלא לבבו להוכיח אחרים בשבט מוסר ובניו מומם ואינו מרגיש מומו הפוסל אותו. וזה שמרמז הכתוב השמר לך כו' ופן יסורו מלבבך. ר\\\"ל אתה בעצמך תסור מלילך בדרכי השם. והודעת' לבניך. היינו שתוכיח רק את בניך שהם ילמדו ועל עצמך לא תשגיח כלל. לא זו הדרך ישכון אור רק אשר ילמדון ליראה כו' שהם עצמם ילמדו מקודם ליראה כו' ואח\\\"כ את בניהם ילמדון:",
            "explanation": "ביאור העניין הוא שבשעה שאדם עומד בתפילה ושפתותיו נעות אך לבו אינו עמו, נראה כאילו הוא משקר בתפילתו, שכן פיו ולבו אינם שווים, והרי זה כאילו הוא עוסק בהבלי עולם ומסיר מעל לוח לבו מצות השי\"ת."
        },
        {
            "source": "Tiferet Shlomo, Torah, Toldot 9",
            "relevant_sentences": "כאשר נמצא רבים מעמי הארץ כי בשעה שעוסק בתורה ותפלה לבבו כלפיד יבער. וכאשר התעיף בו ואיננו כי אחר התפלה תיכף הולך בשרירות לבו חומד ומתאוה.",
            "passage": "ויתרוצצו הבנים בקרבה ותאמר אם כן למה זה אנכי כו'. ופרש\\\"י עוברת על פתחי תורה יעקב מפרכס לצאת. עוברת על פתחי ע\\\"ג עשו מפרכס לצאת. הנה בפ' זו מורה לנו התורה הקדושה דרך הישרה לעבודת הבורא ב\\\"ה שיהיה באמת ובתמים ולא יהיה דרכו דרך הפכפך וזר עד ארגיעה לשון שקר. כאשר נמצא רבים מעמי הארץ כי בשעה שעוסק בתורה ותפלה לבבו כלפיד יבער. וכאשר התעיף בו ואיננו כי אחר התפלה תיכף הולך בשרירות לבו חומד ומתאוה. וז\\\"פ הענין וירא אלהים את האור כי טוב כו' ודרשו חז\\\"ל שאיננו ראוי שישתמשו האור והחשך בערבוביא כו'. לכאורה אין להבין איך שייך לומר אור והחשך יחד בערבוביא תרתי דסתרי אהדדי. אך הרמז בזה. כי דרכי התורה ועבודה המה רומזים לאור. ותאוות העולם השפל והנבזה הם דומים לחשך. והאדם צריך לשמור מזה לבל יהי' בערבוביא פוסח על שני הסעיפים פעם הולך בדרכי התורה ופעם פונה לדרכי החשך ח\\\"ו. וכזה פרשנו בפ' צרופה אמרתך מאד ועבדך אהבה. כי זהו הצירוף והבחינה אם התו\\\"מ מביאים את האדם לידי האהבה לבל יסיר מני דרך הישרה. לכן עתה כאשר ראתה רבקה אמנו שהתרוצצו הבנים סברה כי הוא אדם אחד אשר פעם חשקו ללכת לבהמ\\\"ד ופעם חשקו ללכת לפתחי ע\\\"ג כדרך אנשי רשע כאשר יבוא בין הצדיקים יתלוה עמהם לעשות כמעשיהם. וכאשר פונה מהם ופגעו בו אנשים פוחזים וריקים הנה הוא כאחד מהם. לכן ותלך לדרוש את ה' מה יהיה בסופו. כי לא זה הדרך ישכון אור רק כיתד שלא תמוט. לזה כתיב ויאמר ה' לה שני גוים בבטנך. כי באמת הם שנים יעקב ועשו זה פונה לרשעו ותאוותו הרעה. וזה פונה לתומו וצדקתו לעד עומדת בל ימוט לנצח. ובזה יש לרמז מ\\\"ש להלן ויהי אך יצוא יצא יעקב מאת פני יצחק אביו והנה עשו אחיו בא מצידו. לרמז על הנ\\\"ל ויהי לשון צער כאשר נמצא איש הפכפך במעשיו אשר בשעת עשיית המצוה הוא בבחי' יעקב. וכאשר יצא מאת פני יצחק אביו בגמר תפלתו ועבודתו והנה חוזר לסורו נהפך לאיש אחר והנה עשו אחיו בא מצידו. מצידו. כי הסט\\\"א גובר עליו בתאוות עוה\\\"ז. אך צריך האדם להיות חזק ואמיץ כיתד שלא תמוט להשגיח על כל דרכיו בתם וביושר:",
            "explanation": "ביאור העניין הוא שבשעה שהאדם עוסק בתורה ותפילה ולבו בוער כלפיד, אך לאחר התפילה הולך בשרירות לבו וחומד ומתאוה, נראה כאילו פיו ולבו אינם שווים, שכן בשעת התפילה הוא כאילו יעקב, ולאחריה הוא כאילו עשו, ובכך מתגלה כמי שמשקר בתפילתו."
        },
        {
            "source": "Tiferet Shlomo, Festivals, Shaar Tefillah 23",
            "relevant_sentences": "\"וז\\\"פ צדקתך לא כסיתי בתוך לבי היינו בעת שהתפללתי והי' עת רצון לא המשכתי את הישועה לעצמי רק נחלק בשוה עם כל העולם.\"",
            "passage": "הודו לד' כי טוב כי לעולם חסדו. הנה עיקר ההודאה והשבח הוא בשביל כללות ישראל. כי אם האדם נותן הודאה על עצמו. חוץ דהוא גריעות בנפש שאינו שמח בישועת בנ\\י אך הוא ג\\\"כ גרעון בהודאה עצמה. למשל בשנה זו שהקב\\\"ה נתן מטר על הארץ והארץ נתנה יבולה. אם האדם יתן הודאה על עצמו לבד אין ההודאה גדולה כל כך אך אם האדם נותן הודאה על כל העולם שריחם על נפשות האומללים והרעבים אזי נותן האדם הודאה עצומה. ובפרט מי שיש לו קצת עושר אזי בשביל עצמו אינה נחשבת לו כ\\\"כ הטובה הזאת. אבל אם מסתכל על כל העולם כולו אזי רואה גודל החסד שעשה הקב\\\"ה בשנה זאת. וז\\\"פ הכ' הודו לד' כי טוב כי לעולם חסדו. לא תהללו בשביל עצמיכם רק כל אחד יהלל לד' עבור כל העולם שנעשה עמהם חסד. וז\\\"פ הכ' גם את העולם נתן בלבם. כדי להודות ולהלל להקב\\\"ה על כל הטובות ולהתפלל עליהם. וז\\\"פ הכ' ופדויי ד' ישובון ובאו ציון ברנה ושמחת עולם על ראשם שהשמחה לא תהי' על כל אחד לעצמו רק כ\\\"א יהי' שמח בשמחת חבירו ובשמחת כל העולם. ובזה תגדל השמחה על כל העולם ועל הצדיקים עד מאד. ובזה יהי' ששון ושמחה ישיגו. אך לזה צריך להיות לו טהרת הנשמה והנפש לקיים ואהבת לרעך כמוך. וז\\\"פ בידיד נפש כו' בהראות לה נועם זיווך אז תתחזק ותתרפא והיתה לה שמחת עולם. עיקר הרפואה הוא לאדם אם יש לו שמחת עולם מכלל ישראל לראות בישועתם וגדולתם. וכבר אמרתי לפרש בזה דברי הש\\\"ס גדול העונה אמן יותר מן המברך כו' מה טעם לזה. אך הפי' בזה דמצינו תפלות בלשון יחיד דהיינו ברכת השחר שלא עשני עכו\\\"ם וכן כל הברכות כולם הולכים כל אחד ואחד לעצמו. פוקח עורים מלביש ערומים כמבואר במס' ברכות א\\\"כ אם אדם עונה אמן על ברכת חבירו ונותן הודאה לשמים על שחבירו נברא יהודי ורואה בעינים ויש לו מלבושים ושאר ענינים אזי גדול העונה אמן יותר מן המברך. כי זה מברך על עצמו וזה מברך על חבירו. וזה הי' מעלת יתרו ששמח על הטובה אשר עשה ד' לישראל. ויאמר ברוך ד' אשר הציל אתכם מיד מצרים שהוא לא הי' במצרים בכלל השיעבוד ונתן הודאה על ישראל. וזה כוונת המד\\\"ר שזהו הי' גנאי לישראל שלא ברכו להקב\\\"ה עד שבא יתרו ונתן הודאה. והרי ישראל אמרו שירה מקודם. אך הם נתנו הודאה על עצמם וזה אין כל כך חשיבות. אבל יתרו נתן הודאה על אחרים והוא דבר גדול ודו\\\"ק. וז\\\"פ רבים אומרים לנפשי מי יראנו טוב נסה עלינו אור פניך כו' היינו שהם מבקשים עבור עצמם. אבל אני איני כן. נתת שמחה בלבי מעת דגנם ותירושם רבו. וז\\\"פ צדקתך לא כסיתי בתוך לבי היינו בעת שהתפללתי והי' עת רצון לא המשכתי את הישועה לעצמי רק נחלק בשוה עם כל העולם. וזהו לא כחדתי חסדך ואמתך לקהל רב ובזה אתה ד' לא תכלא רחמיך ממני. היינו כל המבקש על חבירו והוא צריך לאותו דבר הוא נענה תחלה דהיינו אם אחד יש לו פרנסה ממסחר התבואה ומתפלל על הגשמים ובשעת הזול אין לו פרנסה. וז\\\"פ והוא צריך לאותו הדבר שיהי' ח\\\"ו יוקר. אז הוא נענה תחלה. כי לא על הלחם לבדו יחי' האדם כו'. וז\\\"פ בגמ' תבוא מארה למי שאשתו ובניו מברכים לו. למה דוקא ברכת המזון. אך הפי' שהוא נותן הודאה רק על מה שאשתו ובניו יש להם פרנסתם. רק ההודאה צריך להיות על כלל העולם. וז\\\"פ הגמ' אצל בועז דכתי' וייטב לבו שהי' מברך ברכת המזון. פי' בשעה שהי' בגורן וראה הברכה בתבואות הי' מברך להקב\\\"ה על הכלל ישראל. וז\\\"פ כי פקד ד' את עמו לתת להם לחם. להם דייקא. משום הכי כתי' כי שמעה. הא כולם שמעו. אלא פי' שמעה לשון שמחה מכלל ישראל ולא השגיחה על עצמה כלל. וז\\\"ש בישעי' ס\\\"ג חסדי ד' אזכיר כעל כל אשר גמלנו ד' ורב טוב לבית ישראל אשר גמלם כרחמיו וכרוב חסדיו ודו\\\"ק. וז\\\"פ הפ' כהניה בעיר גוועו כי בקשו אוכל למו וישיבו את נפשם היינו שהפרנסה אשר בקשו לא הי' רק עבור עצמם. וכן תשובה עבור עצמם. לפי שגם התשובה וכפרת עוונות צריך האדם להתפלל עבור כלל ישראל. וז\\\"פ על זאת יתפלל כל חסיד אליך לעת מצוא רק לשטף מים רבים אליו לא יגיעו. מים הם החסדים. והוא מתפלל רק עבור כלל ישראל לטובתם. אפי' אם הוא אינו נהנה כלל מן החסדים. וזה כל העולם ניזון בשביל חנינא בני כו'. וזהו נפתלי אילה שלוחה הנותן אמרי שפר. אילה היא החסידה שבחיות. והתפלה הזאת בוקעת כל הרקיעים. וז\\\"ש אם שגורה תפלתי בפי. היינו שהוא מתפלל עבור הכלל. התפלה זאת מקובלת ברצון. וז\\\"ש בש\\\"ס אין הקב\\\"ה מואס בתפלתם של רבים שנאמר הן אל כביר לא ימאס. ואמאי אין נשמע עדיין. אך הפי' אם כל אחד מתפלל על חבירו וצרכי רבים אזי תפלתו נשמעת. ובזה י\\\"ל העוסק בתורה ובגמ\\\"ח ומתפלל עם הצבור מעלה אני עליו כאלו פדאני לי ולבני מן הגלות. ג\\\"כ הפי' כן בכל מה שעוסק בתורה הוא עושה עם הצבור דהתורה מגינה ומציל כוונתו בלימודו שכל הצבור יהיו ניצולים מעבירות שבידם. ובגמילות חסדים כוונתו עם הצבור שהשכר של גמ\\\"ח יהי' ג\\\"כ עם הצבור. וכן מתפלל עם הצבור לטובת כלל ישראל",
            "explanation": "ביאור העניין הוא שבשעה שהאדם מתפלל ומבקש ישועה רק לעצמו ולא לכלל ישראל, נראה כאילו הוא משקר בתפילתו, כי תפילה אמיתית צריכה להיות עבור טובת הכלל ולא רק עבור טובת הפרט, ולכן כאשר הוא מחלק את הישועה בשווה עם כל העולם, תפילתו נחשבת כנה ואמיתית."
        },
        {
            "source": "Tiferet Shlomo, Festivals, Shaar Tefillah 6",
            "relevant_sentences": "\"איש מישראל הרוצה להתפלל נזכר מיד עוונותיו העצומים.\"  \n\"ולזה אמר לך דומי' דהיינו מהראוי שלא יתפלל כלל מחמת הטעמים הנ\\\"ל שאדרבא נותן כח התפלה להחיצונים ח\\\"ו.\"",
            "passage": "(תהילים ס״ה:ב׳-ג׳) לך דומי' תהלה ולך ישולם נדר שומע תפלה עדיך וכו'. דברי עוונות גברו מני פשעינו אתה תכפרם וכו'. הסמיכות של הפסוק ולך ישולם נדר לפסוק שלאחריו שומע תפלה כו'. דהנה איש מישראל הרוצה להתפלל נזכר מיד עוונותיו העצומים. ובפרט שמורא עלה על ראשו שלא מיבעיא שתפלתו אינה נכנסת לפני הבורא ב\\\"ה אך גם אדרבא נותן כח בעבודתו ותורתו לסט\\\"א ח\\\"ו כמבואר בספרים הקדושים [ועי\\\"ז יש יניקה להחיצונים מהקדושה] מכח התורה ומצות ח\\\"ו. ולזה היתה כוונת דוד המלך ע\\\"ה (תהילים כ״ז:ח׳) לך אמר לבי בקשו פני את פניך ד' אבקש. (ולזה התפלל אל תסתר פניך ממני) היינו שהאדם נופל בדעתו במורשי לבבו ונפשו חשקה להתפלל. והיינו את פניך ד' אבקש. ולזה התפלל אל תסתר פניך ממני וכו' ונחני באורח מישור. היינו שהתפלות ילכו למעלה בדרך הישר. ולזה אמר אל תתנני בנפש צרי. היינו שהתפלות לא יכנסו ח\\\"ו בנפש הסט\\\"א. אך התיקון לאיש הישראלי שרוצה להתפלל לקבל עליו מכאן ולהבא לעבוד את ד' בכל לבו ולשוב על עוונותיו והימים הראשונים יפלו. והנה אצל הקב\\\"ה המחשבה כמעשה שהקב\\\"ה יודע מחשבות בנ\\\"א שאדם הזה יעשה תשובה נכונה. ולזה אף שלא עשה עדיין תשובה אצל הקב\\\"ה הוא כמעשה. דאצל בני אדם אם אחד חייב ממון לחבירו ואינו רוצה לפרוע לו זמן זמנים ואח\\\"כ נתחרט והוא רוצה לפרוע לו אזי אינו מאמין לו מחמת שכפר לו זמן זמנים עד שיפרע לו אזי הוא מתפייס עמו אבל אצל הקב\\\"ה מיד כשאדם מדבר לפני הש\\\"י ב\\\"ה שבדעתו לשוב בתשובה הקב\\\"ה יודע שיעשה תשובה ומיד מוחל לו וכמו שמצינו בדניאל שמיד שקבל עליו להתענות מיד אמר הקב\\\"ה שנענה כמבואר בש\\\"ס תענית דף ח' ע\\\"ב. וזה דנדר הוא הרי עלי נדר ולזה אמר לך דומי' דהיינו מהראוי שלא יתפלל כלל מחמת הטעמים הנ\\\"ל שאדרבא נותן כח התפלה להחיצונים ח\\\"ו. ולזה אמר ולך דווקא להקב\\\"ה שהוא יודע מה שיהי' בסוף ישולם נדר שהנדר הוא כמו ששלם כבר הנדר. שאצל הקב\\\"ה העבר וההוה והעתיד הוא הכל אחד כמו שאיתא בספרים ולזה אני מקבל עלי שלא אחטא עוד ומקבל עליו לעשות תשובה. ולזה אמר מיד אח\\\"כ שומע תפלה עדיך כל בשר יבואו היינו שמיד שקבל עליו לעשות תשובה מיד הולכים התפלות להקב\\\"ה. דברי עוונות גברו מני פשעינו אתה תכפרם וכו'. ובזה י\\\"ל כוונת הכתוב (בתהילים ל״ב:ה׳) חטאתי אודיעך ועוני לא כסיתי אמרתי אודה עלי פשעי לד' ואתה נשאת עון חטאתי סלה. על זאת יתפלל כל חסיד עליך. דבל\\\"ז אי אפשר להתפלל דסביביו נשערה מאד והיו יראים החסידים להתפלל מחמת יראה הנ\\\"ל. ולזה אמר אודה עלי פשעי היינו שמתוודה ומקבל עליו שלא יחטא עוד עי\\\"ז יתפלל כל חסיד. רק לשטף מים רבים אליו לא יגיעו. הכוונה לסט\\\"א כמ\\\"ש מים רבים לא יוכלו לכבות את האהבה כמ\\\"ש חכז\\\"ל על העובדי כוכבים ומזלות. אליו לא יגיעו. היינו שהתפלות אינם נכנסים ח\\\"ו לסט\\\"א רק לשמים ונעשים עטרה להבורא ב\\\"ה וק\\\"ל: (מכי\\\"ק)",
            "explanation": "ביאור העניין הוא שכאשר איש מישראל רוצה להתפלל ונזכר בעוונותיו העצומים, נדמה לו כי תפילתו אינה מתקבלת ואף נותנת כח לסטרא אחרא ח\"ו, ולכן נראה כאילו פיו ולבו אינם שווים, אך באמת הקב\"ה יודע מחשבותיו ומקבל תשובתו כאילו כבר נעשתה."
        },
        {
            "source": "Tiferet Shlomo, Torah, Pinchas 15",
            "relevant_sentences": "אין משפטים ישירים",
            "passage": "ויקרב משה את משפטן לפני ה'. ויאמר ה' אל משה כן בנות צלפחד דוברות. יל\\\"ד מהו לשון כן הול\\\"ל אמת בנות צלפחד דוברות. אכן הנה כבר ידוע כי כל שאלת האדם בצרכיו מאת השי\\\"ת ותפלותיו הרבים לא נכון להם להתפלל עלצרכי עצמו בעניני עוה\\\"ז רק לכוון בהם להיות בזה כבוד שמים בכל דרכיך דעהו שיהיו כל עניני האדם רק לכבוד הש\\\"י ב\\\"ה על אחת כמה וכמה בשעת התפלה צריך לכוון לבו רק לשמים וממנו בא הישועה גם לעוה\\\"ז כמ\\\"ש ויזעקו אל ה' בצר להם וממצוקותיה' יושיעם. פי' שיהי' כל כוונתם אל ה' שהוא כביכול בצר להם עמהם ממילא ממצוקותיהם יושיעם. והנה עד\\\"ז הוא פי' כל הברכות שבש\\\"ע אע\\\"פ שהם שאלת צרכיו רפואה וברכת השנים הכל הוא למעלה כיל\\\"ח וצריך לכוון להש\\\"י כשמתפלל בהם ליחוד שלמעלה וע\\\"י כן שלום על ישראל. והנה לפעמים מי שאין בו דעת לכל אלה להתפלל על ה' כנ\\\"ל. הנה זהו העצה נכונה כשבא אל הצדיק הדור הנה הוא מליץ טוב בעדו כי גם הוא כוונתו רק לשמים ומקרב את עניניו וצרכיו שהוא ג\\\"כ לצורך גבוה ית\\\"ש. וז\\\"ש בגמרא מי שיש לו חולה בתוך ביתו ילך אצל חכם ויבקש עליו רחמים כי הצדיק הוא היודע להמליץ עליו רחמים בתפלתו וע\\\"ז הבטיח הש\\\"י למשרע\\\"ה וחנותי את אשר אחון ואמרו חכז\\\"ל אעפ\\\"י שאינו הגון ואינו כדאי הפי' שאין כוונתו רצויה להתקבל למעלה אני אעביר כל טובי על פניך שיהיה בך כח כזה להטיב לברואיו להמליץ טוב בעדם וללמד זכות עליהם עי\\\"כ וחנותי את אשר אחון. וז\\\"פ הנה אנכי בא אליך בעב הענן בעבור ישמעו העם בדברי עמך כו' וישב משה את דברי העם אל ה'. ר\\\"ל גם דברי פשוטי העם שאינם יודעים להתפלל באמת ברצוןובכוונה למעלה עכ\\\"ז יעלו לרצון על ידי הצדיק. וזה הענין כשבאו בנות צלפחד לתבוע נחלה בא\\\"י תחלה הנה יש לפרש בזה כוונה פשטיות שרצו בתחלה כדרך הארץ. ויש לפרש בהם עוד שהיה כוונתם על קדושת הארץ שהיו מחבבות הארץ ולכן כשבאו לפני משה ויקרב את משפטן לפני ה'. שהי' מקרב וממתיק אותם שתביעתן הוא ג\\\"כ למקום ב\\\"ה כדרך הנכון להצדיק לקרב את בנ\\\"י לפני הש\\\"י ולזה השיב לו הקב\\\"ה כן בנות צלפחד דוברות אינך צריך עוד להמתיק ולתקן דבריהם בכוונתם. כן בנות צלפחד דוברות מתחלה רק לרצון הש\\\"י:",
            "explanation": "ביאור העניין הוא שבשעת התפילה, כאשר האדם אינו מכוון לבו לשמים אלא לצרכיו האישיים בלבד, נראה כאילו פיו ולבו אינם שווים, אך כאשר הצדיק מקרב את תפילתו וממתיק את כוונתו, אזי תפילתו עולה לרצון לפני השי\"ת."
        },
        {
            "source": "Tiferet Shlomo, Festivals, Sukkot 51",
            "relevant_sentences": "\"אין משפטים ישירים\"",
            "passage": "יהי לבי תמים בחוקיך למען לא אבוש. ובמד\\\"ר שבקש דוד המלך ע\\\"ה אף בשעת עשיית המצוות יהי' לבי תמים כי אע\\\"פ שלכך נברא היצה\\\"ר לבעבור תהי' הבחירה ביד האדם בכל זה צריך להתפלל שיעשה המצות בתמימות בלי שום פני' חיצונית למען לא אבוש כי באמת אם האדם עושה המצוה לשום כוונה חיצונית חלילה אז אח\\\"כ בעולם העליון הוא מתבייש מאד על סכלותו אשר לא טוב עשה וכמעשה המובא בס' ר' ייבא באחד שהגיד לחבירו בחלום איך שהוא מתבייש וחרפה תכסה פניו בהכריז עליו המלאך כוונת המצות אשר עשה בעולם הזה וכל הצדיקים ינוסו לקולם מג\\\"ע בשמעם אוולתו ופגמו ולכך צריך האדם להתפלל שלא יבוש בעה\\\"ב וזהו אחת שאלתי מאת ד' אותה אבקש שבתי בבית ד' כל ימי חיי פי' כל ימי חיי יעלו לפני ד'. לחזות בנועם ד'. פי' שאוכל לחזות ולהתראות לפני ד' ולא אבוש:",
            "explanation": "ביאור העניין הוא שבשעת עשיית המצוות, אם האדם מכוון לשם כוונה חיצונית ולא לשם שמים, אזי בעולם העליון הוא מתבייש על כך, וכך נראה כאילו פיו ולבו אינם שווים בתפילתו, ולכן יש להתפלל שיעשה המצוות בתמימות למען לא יבוש."
        },
        {
            "source": "Tiferet Shlomo, Festivals, Rosh Hashanah 40",
            "relevant_sentences": "אין משפטים ישירים",
            "passage": "א\\\"י אתה זוכר מעשה עולם ופוקד כל יצורי קדם. יבואר הענין כי בר\\\"ה יורד כל ההשפעות גם על המצות ומעש\\\"ט כי הוא הראש והתחלה לכל השנה. וזה הרמז ופוקד כל יצורי קדם. לשון פקודי ד' ישרים הם המצות ומעש\\\"ט וכל זה ע\\\"י מדת היסוד צי\\\"ע שהוא המשפיע בחי' דכר שבא ע\\\"י שמירת הברית. וז\\\"פ אתה זוכר מעשה עולם להביא השפעות טובות ופוקד כל יצורי קדם הם המצות שנקראו פקודי קדם. קדם ידעתי מעדותיך כו' כי כל ברי\\\"ע הי' בשביל ישראל שנקראו ראשית. רק ע\\\"י החטא אדה\\\"ר נתערב טו\\\"ר ע\\\"י עץ הדעת. ובר\\\"ה יצא יוסף מבית האסורים. מדתו של יוסף בחי' צי\\\"ע. ואז ממילא יורדים כל השפעות הן במילי דעלמא ובמילי דשמיא כמ\\\"ש בווין תתקטר. השכינה הקדושה מתדבקת בהצדיק והוא המשפיע לבנ\\\"י. וז\\\"פ אתם נצבים היום זה ר\\\"ה כידוע. ראשיכם שבטיכם וכו' לעברך בברית ד' אלהיך. פי' זה ההבטחה לבני ישראל שיזכו להיות בחי' המשפיע צי\\\"ע שנקרא ברית כיל\\\"ח ואתם תהיו צנור מכל ההשפעות לטובה אמן: כי דורשיך לעולם לא יכשלו כו' כי זכר כל המעשים לפניך בא ואתה דורש מעשה כולם. הנ\\\"ל עפ\\\"י מ\\\"ש בתיקוני הזוהר צווחין ככלבין הב הב. כי דרך האמת למבקשי ד' בימים האדירים האלו לבל ישים האדם מגמתו בתפלתו בכל ענינו מה שחסר לו לבדו רק ישפוך שיחו לטובת הכלל כל ישראל. וזה הרמז כי דורשיך לעולם. מה שמתפלל עבור כללות ישראל בעולם. בזה לא יכשלו. כי איננו נוגע בדבר לכן יעלה תפלתו לרצון למעלה. כי זכר כל המעשים לפניך בא. פי' אם הוא בבחי' המשפיע בחי' דכר לכל המעשים. לפניך בא לקבל ברצון תפלתו. מה דסני לך לחברך לא תעביד. האמנם כי כל צרכי עולם הזה נמאסים בעיניך לחברך לא תעביד ותמיד תבקש רחמים להשפיע כ\\\"ט לעולם:",
            "explanation": "ביאור העניין הוא שבשעת התפילה, כאשר האדם מתפלל רק על צרכיו האישיים ולא על טובת הכלל, נראה כאילו תפילתו אינה כנה ואמיתית, שכן הכוונה האמיתית בתפילה היא להשפיע טוב על כלל ישראל ולא רק על עצמו."
        },
        {
            "source": "Tiferet Shlomo, Torah, Noach 17",
            "relevant_sentences": "\"אינם מתפללים על מה שנוגע לעצמם.\"",
            "passage": "[עוד מכת\\\"י]וזה פי' יראת ה' תוסיף ימים. מי שהוא ירא שמים עליהם נאמר כי אין מחסור ליראיו. פי' אף שיש להם חוסר רב בעניני עוה\\\"ז מ\\\"מ אינם מטריחים את בוראם ואומרים כל מה דעביר רחמנא לטב עביד ואינם מתפללים על מה שנוגע לעצמם.רק. מה שנוגע לכבוד הבורא ב\\\"ה ולכבוד כלל ישראל. צא ולמד מאברהם אבינו ע\\\"ה שלא התפלל על לוט בעבור שהיה אחיו והוה כאלו התפלל על עצמו. וכן לא רצה ג\\\"כ להפוך דעת הבורא ב\\\"ה בעת העקידה שלא לשחוט את בנו יחידו. וזה שאמר לו הש\\\"י מיד אחר העקידה עתה ידעתי כי ירא אלהים אתה:",
            "explanation": "ביאור העניין הוא שבשעה שאדם מתפלל על ענייניו האישיים בלבד, נראה כאילו הוא מתפלל לשם תועלתו הפרטית ולא לשם שמים, ולכן עלול להיראות כאילו פיו ולבו אינם שווים, אך הירא שמים מתפלל רק על כבוד הבורא וכלל ישראל, ובכך ניכרת כוונתו הטהורה."
        },
        {
            "source": "Tiferet Shlomo, Torah, Vaera 1",
            "relevant_sentences": "\"אעפ\"כ מתפללים והערב נא כו' את דברי תורתך בפינו שיהיה בו עריבות ומתיקות לפניך להיות נחת רוח לפני כסא כבודך אע\"פ שהאדם מחויב ללמוד במצות הבורא בחיוב דאורייתא מ\"מ אינו כשאר מלאכות שמחויב לראות להשלים פעולתו אשר נשלח אליה כי אורייתא צריך הקדמת דחילו ורחימו וכן בתפלה ושאר כל המצות כי הוא רק חסד עליון אשר יזכה האדם השפל לעמוד לפניו ולהתפלל כמ\"ש הללו את ה' מן השמים.\"",
            "passage": "וידבר אלהים אל משה ויאמר אליו אני ה' . להבין ענין האמירה הזאת שאמר אליו אני ה' מה אמר לו. אך הנה באה ללמד לאדם דעת להבין בעצמו כי בכ\\\"ע עמדו לפני ה' בתורה ותפלה כי הוא איננו כדאי וראוי לזכות ולעמוד לפתוח פיו לפני הש\\\"י ממה\\\"מ הקב\\\"ה ואינו בכחו לדבר מאומה זולת מחסד הבורא עליו אשר ישים דבר בפיו לאמר כה תדבר כמש\\\"א דוד המלך ע\\\"ה כי אין מלה בלשוני הן ה' ידעת כלה. לכן צריך האדם להכנע ולשבר לבבו קודם הלימוד והתפלה להתפלל לה' ולשאול ממנו מענה לשון כמ\\\"ש בברכת התורה אשר קדשנו במצותיו וצונו לעסוק בדברי תורה. ואעפ\\\"כ מתפללים והערב נא כו' את דברי תורתך בפינו שיהיה בו עריבות ומתיקות לפניך להיות נחת רוח לפני כסא כבודך אע\\\"פ שהאדם מחויב ללמוד במצות הבורא בחיוב דאורייתא מ\\\"מ אינו כשאר מלאכות שמחויב לראות להשלים פעולתו אשר נשלח אליה כי אורייתא צריך הקדמת דחילו ורחימו וכן בתפלה ושאר כל המצות כי הוא רק חסד עליון אשר יזכה האדם השפל לעמוד לפניו ולהתפלל כמ\\\"ש הללו את ה' מן השמים. ר\\\"ל להודות ולהלל לפניו ית\\\"ש הוא ג\\\"כ סיוע מן השמים טוב ה' לכל ורחמיו על כל מעשיו יודוך ה' כו' כל זה מצד הרחמנות אשר יודוך כל מעשיך. לכן אל יפול לב האדם עליו בראותו כי הקדים ליגע קודם התפלה הרבה בלימוד שיעורין כסדרן ואעפ\\\"כ מתהפך הוא בתחבולותיו בשעת התפלה ואיננה שגורה בפיו ואיננו יכול להתפלל כי הכל הוא מן השמים והוא יעשה את שלו. ועל כזה רמזו רז\\\"ל אל תעש תפלתך קבע. ענין הקביעות הוא הבא בכל עת בטבע. כן אל תעש תפלתך מצד שלמדת הרבה קודם התפלה בקביעות ועי\\\"כ נכון לך להתפלל. לא כן אלא רחמים ותחנונים לפני המקום מצד הרחמנות תבא לפני המקום. וכן נאמר ואתחנן כו' פרש\\\"י מתנת חנם אע\\\"פ שיש להם לצדיקים לתלות במעשיהם הטובים אעפ\\\"כ אינם מבקשים רק מתנת חנם. ר\\\"ל שיש להם לתלות שיהיה תפלתם נכונה ע\\\"י מעשיהם הטובים שלמדו הרבה ועשו מעש\\\"ט קודם התפלה אעפ\\\"כ אינם מבקשים ר\\\"ל הבקש' שלהם אינה רק מתנת חנם כנ\\\"ל. וז\\\"ש שצריך לומר קודם שמ\\\"ע אדני שפתי תפתח כי לולא זאת איך יכול לעמוד בתפל' כי איך יזכה ילוד אשה לעמוד לפני הקב\\\"ה. הנה כזה היה הענין אצל משרע\\\"ה ציר נאמן כי שלחו ה' לפדו' את בנ\\\"י ולהוציאם ממצרים ומשרע\\\"ה באהבתו לישראל הלך בהתלהבות לקיים דבר השליחות וכאשר ראה כי לא שמעו לו הרע בעיניו והתחיל לזעוק למה הרעות. אמר לו הקב\\\"ה דע לפני מי אתה עומד כי אני ה' כמו שמבואר בזוה\\\"ק מקמאי מלילת מילין אילין. ודו\\\"ק:",
            "explanation": "ביאור העניין הוא שבשעת התפילה, אף אם האדם למד והכין עצמו כראוי, עדיין ייתכן שיראה כאילו הוא משקר בתפילתו, כי התפילה אינה פעולה טבעית הנובעת מהכנה בלבד, אלא היא חסד עליון ורחמים מהשמים, ולכן יש לבקש מתנת חינם ולא לסמוך על הכנותיו ומעשיו הטובים בלבד."
        }
    ]
}