{
    "question": "מה המוסר השכל של מכירת יוסף",
    "analyzed_passages": [
        {
            "source": "Tiferet Shlomo, Torah, Vayeshev 10",
            "relevant_sentences": "אין משפטים ישירים",
            "passage": "לר נא ראה את שלום אחיך ואת שלום הצאן והשיבני דבר. הנ\\\"ל לרמז בזה עד כמה האדם צריך לשמור את עצמו לבל ישים עוול ודבה על חבירו רק יסתכל במעלת חבירו ויעלים עינו מחסרונו. וז\\\"ש בתהלים ל\\\"ד. מי האיש החפץ חיים אוהב ימים לראות טוב. פי' יסתכל רק הטוב אשר בחבירו. נצור לשונך מרע. סור מרע ועשה טוב. כי כאשר האדם מוציא דבה על חבירו אזי הוא גורם רעה לעצמו להיות נופל ח\\\"ו ברשת היצר. כמו שמצינו ג\\\"כ במלאכים שקטרגו בשעת בריאת עולם מה אנוש כי תזכרנו. אף שהיו אז במעלה גדולה מאד אח\\\"כ נפלו למטה כמ\\\"ש ויראו את בנות האדם כו'. גם בירבעם שהוכיח לשלמה המלך אי' במד\\\"ר שהשיבו לו הוא נכשל באחת ואתה בכמה. והענין הוא כי מלחמת היצר רבה היא מאד ולולי הקב\\\"ה עזרו לא הי' יכול לו. לכן אם האדם מספר בגנות חבירו ודימה בנפשו ובלבבו ירים כי הוא בטוח להנצל מפיתוי היצר. לכן הקב\\\"ה מסיר ממנו העזר ונופל ברשת ח\\\"ו.לכן כאשר תסור מלהסתכל ברע של חבירך אז תוכל לעשות טוב וזה הרמז ג\\\"כ כאן שאמר יעקב אבינו ליוסף לך נא ראה את שלום אחיך. פי' השלימות והטוב אשר באחיך תראה ולא תביט בחסרונם. ואת שלום הצ\\\"אן רמז ליחוד הוי' אדנ\\\"י בגימ' צ\\\"א. נו\\\"ן רמז לנ' שערי בינה. והשיבני דבר. לשון תשובה. תחזור בתשובה על אשר פגמת שהבאת דבתם רעה. אך טוב תראה בבנ\\\"י תמיד:",
            "explanation": "ביאור העניין הוא שהמוסר השכל ממכירת יוסף הוא להימנע מלדבר בגנות חברו ולהתמקד בטוב שבו, שכן דיבור רע עלול להוביל את האדם לנפילה רוחנית, כפי שנרמז בדברי יעקב ליוסף לראות את שלום אחיו ולא להביט בחסרונם."
        },
        {
            "source": "Tiferet Shlomo, Torah, Vayeshev 14",
            "relevant_sentences": "אין משפטים ישירים",
            "passage": "וירד יהודה מאת אחיו. במד\\\"ר רשב\\\"נ פתח כי אנכי ידעתי את המחשבות כו' שבטים היו עסוקים במכירתו של יוסף. ויוסף היה עסוק בשקו ותעניתו וכו' והקב\\\"ה היה עוסק ובורא אורו של משיח ע\\\"כ. הנה יש להעיר בדברי המאמר הזה מהו שייכות יש לכל דברי הצומות והשקים של הצדיקים הללו לברא אורו של משיח וכי לא היה עוד זמן אחר טוב ונרצה לפני הש\\\"י ב\\\"ה להוציא אורו הגדול רק בזמן הזה שכל בני יעקב חגרו שקים ואביהם עמהם. אולם כאשר נעמוד להתבונן מעט על חוקי הנהגת העולם עפ\\\"י הש\\\"י מתחלת הבריאה עד עתה. הנה זה מצאנו ראינו כי כל עניני עוה\\\"ז לא יכלו לצאת אל הפועל הגמור והתכלית האמיתי זולת אחרי ההעדר המוחלט ושיוקדם להם האין הכללי וכמ\\\"ש חכז\\\"ל ההעדר קודם להויה ר\\\"ל כי בחי' ההעדר הוא בהכרח קודם למציאת ההוי' והוא הסיבה למציאת ההו' שיבא אח\\\"כ וכמו שנראה זה בתבואת הזרע אשר לא יעלו ולא יצמיחו זולת אחר הרקבון הגמור בעפר כולו. והנה כן הענין היה בתחלת הבריאה האור שבא מכח החשך הקדום לו כמ\\\"ש והארץ היתה תהו ובהו וחשך ויאמר אלהים יהי אור כי מציאת החשך הוא הסיבה לאור וכן ויהי ערב ויהי בקר מבחי' הערב יבא הבקר אחריו. וזהו יוצר אור ובורא חשך ע\\\"י שבורא החשך תחלה עי\\\"כ יצא האור ובקר אחריו להתגלות. וז\\\"ש יתרון החכמה מן הסכלות כיתרון האור מן החשך ר\\\"ל כמו שיתרון האור לא יכול להיות רק אחר מציאת החשך הקדום לו וממנו יוצא האור וזהו מן החשך עצמו יצא האור כן יתרון החכמה תבא לאדם רק מבחי' הסכלות עצמה. פי' שיעשה האדם עצמו כסכל לעולם ולא יהיה נחשב בעיניו לכלום. אז יגיע למעלת החכמה האמיתית כמ\\\"ש א\\\"א ע\\\"ה הנה נא הואלתי לדבר אל ה' ואנכי עפר ואפר ר\\\"ל מה שהואלתי לדבר הוא יען כי אני יודע בעצמי כי הנני עפר ואפר וז\\\"ש אצל מתן תורה ויהי בשמעכם את הקול מתוך החשך. יש להבין מה אשמעינן בזה בשמיעת הקול מתוך החשך ולא נאמר מתוך האש כמו בזולתו. אך בהיות המעמד המובחר ההוא של מתן תורה התכלית המכוון והקיום האמיתי של בריאת העולם כולו הנה לא יכלו בנ\\\"י לקבל את האור הגדול ההוא זולת ע\\\"י סיבת החשך הקדום לו למציאת האור כמו שהיה כן אצל תחלת הבריאה וחשך על פני תהום ויאמר אלהים יהי אור. נמצא כי אך הסיבה העצמיות לתכלית הויות האור הוא החשך הקדום לו. והנה כזה הוא התכלית למציאת אור ה' נשפע על האדם הוא רק ע\\\"י בחינת החשך אשר תוקדם לו לעולם. אשר ידע ויבין בדעו ושכלו גודל חשכת נפשו כמה הוא מגשש באפילה ובמה נחשב הוא אז עי\\\"כ יזכה אשר השי\\\"ת ב\\\"ה יוציאנו מאפילה לאור גדול כמ\\\"ש אני אשכון את דכא והוא שרמזו רז\\\"ל במשנה במס' נגעים פרק ב' מי שהוא בבית אפל אין פותחין לו חלונות לראות את נגעו. ר\\\"ל מי שהוא בבית אפל על מעשיו אשר לא טובים אין פותחין חלונות שיראו אחרים בנוולתו ונגעי לבבו כי אם הוא ישב בחשך ה' אור לו. וכן אמרו עוד שם במשנה אין רואים את הנגעים שחרית ובין הערבים. ר\\\"ל בזמן תפלת שחרית ובין הערבים לא יבקר אז האדם אחרי נגעי לבבו פן יתעצב אל לבו ולא יהיה יכול להתפלל כדת אך יבחר לו זמן אחר מזמנים הידועים הראוים לכל אלה. נחזור לעניננו הנה מציאת ההעדר הוא הסיבה להויה זהו ג\\\"כ ענין המיתה ר\\\"ל שנקנסה על האדם אשר אחריה נקוה לשוב ולהחיות עוד בתחיית המתים אשר לכאורה אין להבין למה צורך להמית ולהחיות אח\\\"כ טוב היה להניח מזה ומזה ושיחיה האדם לעולם ואם בעבור מירוק העון הלא הרבה צדיקים שמתו בלא עון רק מעטיו של נחש. אך הכוונה הוא ג\\\"כ כנ\\\"ל בהיות כי התכלית הנרצה מה שיהיה לעתיד שיתגלה כבוד מלכותו ית\\\"ש לעיני כל בשר באורו הגדול לכן אין בכח מציאת מין האנושי בעוה\\\"ז לקבל האור הגדול רק ע\\\"י ההעדר הקדום לו במיתה הזאת עתה שהיא הקדמה וסיבת קבלת האור ההיא של תחה\\\"מ. וזהו שסמוך לברכת מחיה מתים קדושת השם נקדישך ונעריצך כסוד שיח שרפי קודש. הכוונה כי אז בתחה\\\"מ נקדישך גם אנחנו כמו שמקדישים אותך בסוד שיח שרפי קודש. ואז כתר יתנו לך מלאכים המוני מעלה עם ישראל קבוצי מטה כי אתה קדוש ושמך קדוש וקדושים בכל יום יהללוך סלה. לכן גם אנחנו מקווי' ומצפים להלל אותך בסוד קדושים הללו. נמצא כי בחי' המיתה הקודמת בבחי' החשך לקבל' האור העתיד וזהו שאנו אומרים מלך ממית ומחיה ומצמיח ישועה. ר\\\"ל מה שהוא ממית הוא כדי להחיות אחר כך כשיצמיח ישועה בקרוב. וז\\\"ש חכז\\\"ל החיים למות והמתים להחיות. ולכאורה קשה מי לא ידע בכל אלה ומהו משמיענו בזה. אך הכוונה כנ\\\"ל מה שהחיים למות הוא כדי שהמתים להחיות בתוקף אור הגדול ביתר שאת ויתר עוז. וזהו שאמרו חכז\\\"ל והנה טוב מאד זה המה\\\"מ כי הוא טוב מאד להיותו הסיבה המיתה וההעדר הכנה לביאת האור הגדול לנפשות העתידים לעמוד בתחה\\\"מ כנ\\\"ל. וכענין הזה הוא שהיה אצל האמהות הקדושות אשר היו עקרות זמן הרב קודם לידתן עד בואם בשנים בקצה האחרון רק אז נפתחו רחמם כמו שרה לא זכתה להריון עד בלותה עפ\\\"י נס. וכן רבקה ורחל ויוכבד היא עלתה על כלנה עד היותה בת ק\\\"ל שנה. וזה קשה להבין למה היתה כזאת שעכבום הש\\\"י עד קצה האחרון. אך כדברינו נכון כי אחרי אשר ראו להאמהות הקדושות האלו להוליד נשמות הקדושות האלו נפשות הצדיקים המאורות הגדולים ההם. הנה לא יתכן להם להוציא האור זולת אחרי ההעדר הקודם לכן המתין להם הקב\\\"ה עד עת זקנתן עד שלא חשבו עוד להיות להם זרע כלל ומן החשך ההוא הוציא להם אור גדול כמשרע\\\"ה והאבות הקדושים ע\\\"ה. והנה כן היה הדבר בהנהגת הש\\\"י עם עמו בנ\\\"י בגלותינו אשר בכל עת ענינו ומרודינו כשהם לוחצים אותנו עד מאד רק אז מן החשך מושיע להם ומוציאם לאור גדול וזהו שצעק הנביא כמו ההרה תקריב ללדת תחיל ותזעק בחבלי' כן היינו מפניך ה' דהנה ההרה הקרובה ללדת גם היא לא תוליד עד אשר תבוא אז בהסכנה העצומה ותגדל חבליה מאד אז בקצה האחרון יושיע לה הש\\\"י כן אנחנו חלנו ואין בנו עוד כח ללידה כמו ילדנו רוח. וזה הוא ענין משיח צדקנו שאמרו חכז\\\"ל כי ביום שנחרב הבהמ\\\"ק נולד משיח וביום שחשב הש\\\"י להשחית חומת ירושלים נטה קו על בנין העתיד כי בהיות החורבן ההוא יום בכי ומספד אף בבתי גואי אשר כמהו לא יהיה עוד אח\\\"כ לכן ביום ההוא מחמת החשך וההעדר ההיא יצא משיח. והנה זה ג\\\"כ ביאור המד\\\"ר הנ\\\"ל כי פרץ וזרח שניהם מורים על משיחנו שיבא ב\\\"ב לכן רק בעת החשך ההוא שכל בית יעקב היו אגודים בצרה בשקם ותעניתם אז זרח בחשך אור לישרים ולהוציא הקב\\\"ה אז אורו של משיחנו ב\\\"ב אמן:",
            "explanation": "ביאור העניין הוא שבזמן מכירת יוסף, כאשר כל בית יעקב היו בצרה ובשקם ותעניתם, דווקא מתוך החשך וההעדר הזה יצא אורו של משיח, ללמדנו כי מתוך הצרה וההעדר באה הישועה והגאולה, וזהו המוסר השכל של מכירת יוסף."
        },
        {
            "source": "Tiferet Shlomo, Torah, Vayeshev 6",
            "relevant_sentences": "\"כי אי אפשר לך זה רק אחר השבירה והירידה מתחלה לכך ויוסף הורד מצרימה ומשם הוא נתעלה אח\\\"כ ונתקן למלוך\"",
            "passage": "במס' ברכות דף כ\\\"ז. כשמינוהו את ר' אלעזר לנשיא א\\\"ל איזיל ואימלך באינשי ביתי' אזיל ואמליך בדביתהו. אמרה לי' דלמא מעברין לך. א\\\"ל יומא חדא לישתמש אינש בכסא דמוקרא ולמחר ליתבר א\\\"ל לית לך חיוורתא ע\\\"ש בגמ'. הנראה לרמז בזה בדבריהם ז\\\"ל כי הנה בכל דבר מעלה ומדריגה טרם תתנשא על מכונה צריך להיות לה בחי' שבירה בתחלה כמו שהי' זה בשעת בריאת העולם בראשית ברא כו'. והארץ היתה תהו ובוהו כי בתחלת הבריאה לא יכלו לסבול את האור הגדול ונשברו ונעשו בחי' תהו ואח\\\"כ נתקנו ויאמר אלהים יהי אור כי עיקר התיקון על מכונו או\\\"א להיות רק אחר השבירה והירידה מתחלתו והירידה היא צורך העלי'. וכן נאמר אצל יוסף כשהתחיל להתנשא ויאמרו לו אחיו המלוך תמלוך עלינו. כי אי אפשר לך זה רק אחר השבירה והירידה מתחלה לכך ויוסף הורד מצרימה ומשם הוא נתעלה אח\\\"כ ונתקן למלוך אמנם בחי' התיקון אחרי השבירה זה בא ע\\\"י בחי' זקן שהוא מבחי' אריך ועתיק והוא בא ע\\\"י י\\\"ג מדות שהאור עובר בהם בבחי' מדה וצמצום. וזהו הענין שהי' אצל הלוחות שהלוחות הראשונים ניתנו בפומבי ובשפע האור הרב ולכך נשברו. אבל בהלוחות השניות נאמר אצלם הי\\\"ג מדות ושכותי כפי עליך שהי' האור בחי' צמצום ומסך מעט ושם נאמר פסל לך שני לוחות אבנים כראשונים. וזה הענין בגדלות ראשון וגדלות שני האמור בכתבי האריז\\\"ל כי ההארה צריך לעבור דרך דרגין כיל\\\"ח. וזה הענין שאמרו בגמ' כי האדם במעי אמו מתחלה הוא יודע כל התורה ואח\\\"כ בצאתו בא מלאך וסטרו על פיו ומשכח הכל כי כן צריך להיות בחי' ההארה והידיעה באדם מתרבה והולכת עמו מעט מעט כפי שניו דרך דרגין דאם לא כן לא הי' יכול לסבול את האור הגדול הקודם. ולכך בא מלאך וסטרו על פיו הוא בחי' השבירה כמו שנתבאר. הנה זה הענין אצל ר\\\"א בן עזרי' כשבא להיות נשיא פתאום א\\\"ל דלמא מעברין לך כי ההתנשאות צריך להיות בחי' שבירה בתחלה כנ\\\"ל. וזה שא\\\"ל יומא חדא לישתמש אינש בכסא דמוקרא ולמחר ליתבר. כי אחרי הבריאה מתחלה בחי' יום אחד ולמחר ליתבר נעשה השבירה. וזה שא\\\"ל והא לית לך חיוורתא כי צריך להמשיך מבחי' י\\\"ג מדות חוורתי כמו שהי' אצל יוסף בצאתו לאסור שריו בנפשו וזקניו יחכם מהזקן עד החכמה זקן זה שקנה חכמה. וזה שאמרו שם ההוא יומא בר י\\\"ח שנין הוה אתעביד לי' ניסא ואהדרי לי' תמני סרי דרי חיורתא. הוא כמו שנתבאר בע\\\"ח בחי' ברכאין. וזהו רמז על י\\\"ג תקוני דיקנא דא\\\"א וה' ראשונים שלו כיל\\\"ח ע\\\"ש.וזהו תמני סרי דרי חיוורתא מבחי' הזקן שלמעלה כמו שנתבאר:",
            "explanation": "ביאור העניין הוא שהמוסר השכל ממכירת יוסף הוא שהשבירה והירידה למצרים היו הכרחיות כדי שיוסף יוכל להתעלות ולהתקן למלוך, וכך נלמד שהירידה היא צורך העלייה והתקון הבא לאחריה."
        },
        {
            "source": "Tiferet Shlomo, Torah, Vayishlach 6",
            "relevant_sentences": "\"אין משפטים ישירים\"",
            "passage": "ויזרח לו השמש כאשר עבר את פניאל והוא צולע על ירכו. עפרש\\\"י ויזרח לו השמש לרפאותו מצלעתו כמ\\\"ש שמש צדקה ומרפא כו'. ועדיין יש לדקדק שלשון הפסוק הוא בהיפך שמתחיל ויזרח לו השמש כו' ואח\\\"כ כתיב והוא צולע על ירכו דהול\\\"ל מקודם שהי' צולע על יריכו ואח\\\"כ ויזרח לו השמש לרפאותו. אכן הנ\\\"ל עפמ\\\"ש בפ' מקץ בפ' לולא התמהמהנו כי עתה שבנו זה פעמי' לרמז בזה כי אם האדם עומד במרדו ואינו תוהא על הראשונות כל דרך איש ישר בעיניו כאשר איננו יודע מה חסר לו כי גם זה הסתת היצר לומר לו כי הכל עושה למצוה רבה ואין בו שום עול. ועל זה צריך להיות לו עזר מן השמים למען ידע כי לא טוב עשה ויתקן המעוות בעוצם התשובה הנכונה. לכן גם השבטים הקדושים כל ך\\\"ב שנה שמכרו את יוסף אחיהם לא ידעו אם עשו שום חטא בזה רק נדמה להם כי זה דרך הטוב והישר. רק כאשר באו למצרים אל יוסף הצדיק והופיע עליהם מגודל קדושתו אז הרגישו כולם מה עשו ובא הרהור תשובה בלבבם אז אמרו אבל אשמים אנחנו על אחינו כו'. וז\\\"ש ליעקב אביהם לולא התמהמהנו כי עתה שבנו זה פעמים כי כן הוא דרך התשובה לעלות בכל יום במעלה יתירה ולהתחזק בכל יום יותר וידע כי ביום אתמול לא הי' במעלה זו ויחזור וישוב בתשובה על יום שעבר. ונחזור לענינינו. ויזרח לו השמש פי' כי השי\\\"ת ברוב חסדיו מאיר לאדם ונותן לו אור הנשמה ואימתי זאת כאשר עבר את פניאל פי' כשעברו ממנו הפניות שהי' לו בהעבדות של תורה ומצות מקודם לזה שלמד תורה שלא לשמה כי לא הי' טהור ועודנו מעונה ומוכה מעצת היצה\\\"ר והי' צריך רפואת הנפש לכן לא הי' מרגיש כלל מה שחסר לו. אך עתה כאשר זרח לו השמש אור הנשמה הבהירות הקדושה מסיעתא דשמיא אזי הוא מבין מדעתו כי הוא צולע על ירכו ועודנו צריך תיקון ורפואה לנפשו כנ\\\"ל:",
            "explanation": "ביאור העניין הוא שמוסר השכל של מכירת יוסף הוא שהאדם עלול לחשוב כי דרכו ישרה ואין בו עול, אך כאשר מופיע אור הקדושה והבהירות, כמו השמש המאיר ליעקב, מתגלה לו חסרונו והוא מתעורר לתשובה, וכך גם השבטים הבינו את חטאם רק כאשר עמדו מול קדושת יוסף."
        },
        {
            "source": "Tiferet Shlomo, Torah, Vayeshev 7",
            "relevant_sentences": "אין משפטים ישירים",
            "passage": "וילכו אחיו לרעות את צאן אביהם בשכם. פרש\\\"י שלא הלכו אלא לרעות את עצמן. הענין בזה יבואר עפ\\\"י הידוע גודל מעלת י\\\"ב שבטי י\\\"ה שהם נגד י\\\"ב צרופי הוי' ב\\\"ה ולכל אחד מהם הי' לו עבדות לכבוד שמים לפי דרכו והלוכו בקודש כמ\\\"ש הלא אחיך רועים בשכ\\\"ם ר\\\"ת \\\"ברוך \\\"שם \\\"כבוד \\\"מלכותו. ובזה יש להבין טעות השבטים שהי' עולה בדעתם לרעות את עצמן פי' שהם רועים בעצמן ואינם צריכין לרב ומנהיג כי כולם קדושים ועובדים הבורא ב\\\"ה בכל לבבם. וזה הרמז בחלומו של יוסף והנה אנחנו מאלמים אלומים בתוך השדה והנה קמה אלומתי וכו' ותשתחוין לאלומתי. שהי' מרמז להם אף כי המה כולם קדושים אעפ\\\"כ הם צריכים לו להיות להם לראש ולמנהיג כי הוא צנור כל ההשפעות בחי' צי\\\"ע. כי כן הי' כוונת הבריאה שיהי' בכל דור צי\\\"ע אור זרוע לצדיק ולישרי לב שמחה כי ע\\\"י הצדיק הולכים כל ההשפעות. ודבר זה גלה לנו הבעש\\\"ט זי\\\"ע שהפיץ אורו על פני תבל כי בלתי דיבוק חכמים שבדור איננו באפשרי להיות קיום לעולם. וזה שהי' כוונת יוסף לטובתם ולא מפני התנשאות עליהם חלילה רק למען החיש טובתם. ולו שמעו ויחלו לקבל עול מלכותו אז יכול להיות גאולה שלימה. כמ\\\"ש ויוסף בן שבע עשרה שנה. עולה בגימ' טו\\\"ב אמרו לצדיק כי טוב. אך מפני כי הלכו לרעות את עצמן כאשר זה הי' ג\\\"כ טעות קרח שאמר כל העדה כולם קדושים ומדוע תתנשאו כו'. ובאמת לא כן הי' רצונו ית\\\"ש אף אמנם כולם קדושים אדרבא לזה הם צריכים למשה רבינו שיהי' המנהיג כדי שילכו ההשפעות על ידו כמ\\\"ש אצל רשב\\\"י באדרא רבא שהי' יושב עמהם ומצוה לתלמידיו שיאמרו כ\\\"א ד\\\"ת לפניו כמ\\\"ש פתח ר' אבא וכדומה לכן תלמידיו של ר\\\"ע אמרו כל הפורש ממך כפורש מן החיים כי כל החיים שלהם הי' על ידו הן השפעות החכמה ועניני עוה\\\"ז ג\\\"כ. וזה הי' ענין יוסף שהוא הי' צדיק הדור כמ\\\"ש לאסור שריו בנפשו וזקניו יחכם. כמ\\\"ש כי בן זקונים הוא לו ותרגומו כי בר חכים הוא לי'. פי' שהי' מעורר עולם החכמה עולם הזקנה. ולזה אחר מכירתו של יוסף כתיב וירד יהודה מאת אחיו. פי' שהי' ירידה במלכות בית דוד. וסוף דבר פוק חזי מה עלתה בם כי גם לחם לא הי' להם עד שירדו למצרים. וזה הענין הי' גם במשרע\\\"ה שאמר יוסף ה' עליכם כו'. פי' בחי' יוסף הוא צדיק הדור יהי' עמכם. ועי\\\"ז יברך אתכם כאשר דבר לכם בשעת מ\\\"ת:",
            "explanation": "ביאור העניין הוא שמוסר השכל של מכירת יוסף הוא ההבנה כי אף שהשבטים כולם קדושים, עדיין יש צורך במנהיג וצדיק הדור, כמו יוסף, כדי להוביל את ההשפעות והברכות לעולם, וכי טעותם הייתה בכך שחשבו שאינם זקוקים למנהיג, מה שהוביל לירידה במלכות ולצורך בירידתם למצרים."
        },
        {
            "source": "Tiferet Shlomo, Torah, Miketz 15",
            "relevant_sentences": "\"אבל הקב\\\"ה היה מסבב להם סיבות במצרים להבין שחטאו במכירת יוסף כדי שיחזרו בתשובה כי באו לידי נסיון מדה כנגד מדה כי לקח מאתם את שמעון.\"",
            "passage": "ויאמרו איש אל אחיו אבל אשמים אנחנו כו' כי המליץ בינותם. הנ\\\"ל לפי מה שבארנו במ\\\"א בענין השבטים שכל ך\\\"ב שנה שמכרו את יוסף אחיהם לא עלתה על לבם כי עשו עוול בזה אך סברו כי עשו מצוה בזה. אך הקב\\\"ה היה מסבב להם סיבות במצרים להבין שחטאו במכירת יוסף כדי שיחזרו בתשובה כי באו לידי נסיון מדה כנגד מדה כי לקח מאתם את שמעון. ויאסור אותו לעיניהם ואח\\\"כ צוה להביא את בנימין. וכאשר הבינו הדבר התוודו על חטאתם באמרם אבל אשמים אנחנו על אחינו כו'. ולזאת סמך הכתוב כי המליץ בינותם. כמ\\\"ש אם יש עליו מלאך מליץ אחד להגיד לאדם ישרו כי על ידי הווידוי היה תיכף מליץ טוב עליהם. וז\\\"ש כי לולא התמהמהנו כי עתה שבנו זה פעמים. כדרך הצדיקים שכל מה שחוזרים בתשובה יותר מתחרטים על יום האתמול שלא הי' במדריגה זו. וזה לשון פעמיים. כמ\\\"ש שובי שובי השולמית שובי שובי כו' כמבואר במ\\\"א:",
            "explanation": "ביאור העניין הוא שהקב\"ה סיבב את העניינים כך שהשבטים יבינו את חטאם במכירת יוסף על ידי ניסיונות מדה כנגד מדה, ובכך ילמדו את המוסר השכל של תשובה והכרה בחטאיהם, כפי שנראה בלקיחת שמעון מהם."
        },
        {
            "source": "Tiferet Shlomo, Torah, Vayeshev 8",
            "relevant_sentences": "אין משפטים ישירים",
            "passage": "ויאמר יעקב הלא אחיך רועים בשכם כו' לך נא ראה את שלום אחיך כו'. יש להמשיך הכתובים הנ\\\"ל בדרך רמז. עפ\\\"י הגמרא ברכות דף ג' ע\\\"א.אמר ר' יוסי פעם אחת כו' ונכנסתי לחורבה אחת מחורבות ירושלים להתפלל בא אליהו כו' ושמר לי על הפתח כו' ואמר לי בני מפני מה נכנסת לחורבה זו אמרתי לו להתפלל ואמרלי הי' לך להתפלל בדרך. יבואר עפ\\\"י מה שמצינו בספרים פי' על המאמר בפרקי אבות דע מה למעלה ממך. פי' לפי גודל הצער שהאדם יש לו בדוחק ובצער יש להתבונן מה שנוגע למעלה בכפלי כפליים בצער גלות השכינה כביכיל עמו אנכי בצרה. וזה דע מה למעלה ממך מן הצער שלך תדע הצער שלמעלה כביכול. לכן היו כמה צדיקים אשר לא הסתכלו כלל על דוחק וצער של בנ\\\"י רק על כללות צער השכינה וכל ימיהם רק זאת הם מצפים ומיחלים על גדלות הבורא ב\\\"ה בקנאת ה' צבאות כמ\\\"ש באליהו הנביא ע\\\"ה קנא קנאתי כו'. אכן בדור שלאחריו יונה בן אמיתי שהי' תלמידו של אליהו לא רצה ללכת בשליחות הנבואה אל נינוה שלא יהי' ח\\\"ו קטרוג על בנ\\\"י כידוע. כי באמת לא זו הדרך ישכון אור הצלחת הצדיק רק כאשר יסתכל ג\\\"כ על טובת בנ\\\"י לעורר עליהם רחמים וחסדים ולהצטער בצרתם. ועיין בעין יעקב בהכותב בפי' הגמ' אר\\\"י פעם אחת נכנסתי לחורבה אחת מחורבות ירושלים. פי' מחשבתו הי' להצטער בצער גלות השכינה וזה חורבות ירושלים. ובא אליהו ושמר על הפתח. אמר לו הי' לך להתפלל בדרך. פי' בעוד שהם הולכים בדרך שהם בגלות להתפלל עליהם להשפיע להם כל טוב להצילם מעניים ומרודם וזה הרמז בפ' הנ\\\"ל באחי יוסף והנה אנחנו מאלמים אלומים בתוך השדה. פי' שהיו מצטערים בצער גלות השכינה ועל חורבן ירושלים דכתיב ציון שדה תחרש והיו מצפים רק על רוממת כבודו ית\\\"ש.וז\\\"ש ג\\\"כ כאן הלא אחיך רועים בשכ\\\"ם ר\\\"ת ברוך שם כבוד מלכותו. וז\\\"ש לו יעקב לך נא ראה את שלום אחיך לראות בטובתם ולהשפיע להם בעודם בגלות. וז\\\"ש וימצאהו איש ויאמר לו מה תבקש. ר\\\"ל מהו עיקר בקשתך. כי על צער גלות השכינה לבד איננה צריכה לרחמנות שלנו כי כביכול הש\\\"י הוא כל יכול לעזור א\\\"ע כרגע כמ\\\"ש ואתה ה' לעולם תשב. רק למה לנצת תשכחנו תעזבנו לאורך ימים. עיקר הצער על אורך הגלות שאנו בנ\\\"י דווים וסחופים. לכן כאשר שמע יוסף דברים הללו השיב לו את אחי אנכי מבקש. פי' טובתם של בנ\\\"י אני מבקש ומצפה לראות בטובתם וישועת' לנצח. ולעורר רחמים עליהם:",
            "explanation": "ביאור העניין הוא שמוסר השכל של מכירת יוסף הוא שעל האדם להתבונן בצערם של אחיו ולבקש את טובתם וישועתם, ולא להסתפק בצער גלות השכינה בלבד, כפי שלמדנו מיוסף שביקש את טובת אחיו גם בעת גלותם."
        },
        {
            "source": "Tiferet Shlomo, Torah, Miketz 17",
            "relevant_sentences": "לכן גם בענין השבטים שמכרו את יוסף לא עלתה על לבם כי עשו עוול בזה כי המה סברו שעשו מצוה ב\"ה לכן לא חזרו בתשובה. אך עתה כאשר באו אל יוסף וראו פניו והוא הי' בדורו בחי' צי\"ע כמ\"ש כי בן זקונים הוא לו. לכן בראיית פניו נתעורר לבבם בהרהור תשובה על מה עשו ככה וז\"ש אבל אשמים אנחנו כו'.",
            "passage": "כי לולא התמהמהנו כי עתה שבנו זה פעמיים. הנראה לרמז בדברים הללו עפ\\\"י מה שאנו אומרים השיבנו אבינו לתורתך. לפמ\\\"ש בגמ' פשפש ולא מצא יתלה בביטול תורה. דלכאורה צריך להבין איך שייך לומר פשפש ולא מצא אם הוא יודע שלא למד. אך באמת אף אם האדם לומד בהתמדה אם איננו שמור מהעבירות אז גם לימודו הוא כדבר בטל כמו בחמץ שהוא בעין ואפ\\\"ה הוא בטל כמו שאינו. וזהו מדאורייתא בביטול בעלמא סגי. כי ענין הלימוד הוא להורות לאדם דרך הישרה לעבודת הבורא ב\\\"ה ואם התורה איננה מדריכו לעבודה היא בבחי' ביטול מעיקרא. וז\\\"ש יתלה בביטול תורה שהלימוד שלו הוא ג\\\"כ בטל. והתקנה לזה מבואר בזוה\\\"ק מי שעומד בחצות לילה ומשים על לבו להתמרמר על חטאיו ומתחרט על הימים אשר עברו וחלפו בהבל וריק אז אורייתא מודעת לי' חובי'. ואז עיניו תחזינה מישרים וחטאתו לנגדו תמיד לשוב בתשובה שלימה. וז\\\"ש השיבנו אבינו לתורתך. כי גם התורה אשר למד צריכה לתשובה שלימה ואז כאשר ידע מה שחטא יכול לשוב בתשובה שלימה. וכדומה לזה מובא באלשיך על פסוק למנצח מזמור לדוד בבוא אליו נתן הנביא כאשר בא אל בת שבע כי עתה הי' שמחתו בזה כאשר ידע כי חטא כי עתה ישוב בתשובה ויעלה לרצון כי עד עתה הי' סבור כי נעשה בהיתר כמ\\\"ש בגמ' כל היוצא למלחמת בית דוד גט כריתות כותב כו'. וזאת ידוע כי ראיית פני הצדיק והתקשרות עמו מועיל לתיקון נשמתו לבא לתשובה שלימה לנכון כידוע המעשה מהרב ר' חייקא המדורא ז\\\"ל וכו'. לכן גם בענין השבטים שמכרו את יוסף לא עלתה על לבם כי עשו עוול בזה כי המה סברו שעשו מצוה ב\\\"ה לכן לא חזרו בתשובה. אך עתה כאשר באו אל יוסף וראו פניו והוא הי' בדורו בחי' צי\\\"ע כמ\\\"ש כי בן זקונים הוא לו. לכן בראיית פניו נתעורר לבבם בהרהור תשובה על מה עשו ככה וז\\\"ש אבל אשמים אנחנו כו'. וז\\\"ש והם לא ידעו כי שומע יוסף כי המליץ בינותם כמ\\\"ש אם יש עליו מלאך מליץ אחד מני אלף. כי כאשר. התוודו על אשר חטאו נתעורר למעלה מליץ טוב בעדם. כי בראיית פניו נמשך עליהם עול מלכות שמים לשוב בתשובה שלימה לפניו. וזה שאמרו כי לולא התמהמהנו לראות פניו המאירים. כי עתה שבנו זה פעמיים. היינו חוזרים בתשובה זה פעמיים כמבואר לעיל:",
            "explanation": "ביאור העניין הוא שהמוסר השכל ממכירת יוסף הוא ההבנה כי גם כאשר האדם סבור שהוא עושה מצוה, עליו להתבונן ולבחון את מעשיו, וכאשר השבטים ראו את פני יוסף, נתעורר לבבם להרהור תשובה, כי הבינו את טעותם וחשו אשמה על מעשיהם, ובכך למדו את חשיבות התשובה וההכרה בחטא."
        },
        {
            "source": "Tiferet Shlomo, Torah, Vayeshev 17",
            "relevant_sentences": "אין משפטים ישירים",
            "passage": "ויהי יוסף יפה תואר ויפה מראה. ערש\\\"י כשראה עצמו מושל התחיל אוכל ושותה ומסלסל בשערו אמר הקב\\\"ה אביך מתאבל עליך כו' ע\\\"ש. הנה יש להבין באמת מה היתה דעת יוסף בזה הלא ידע בצערו של אביו וכמ\\\"ש ראובן אנה אברח מצערו של אבא. אך הנה יבואר ע\\\"ד שאמר ר' יהושע לר\\\"ג אי אתה יודע בצערן של תלמידי חכמים. כי הנה ר\\\"ג הוא שהיה במדריגה העליונה מופשט מתאוות עוה\\\"ז והי' נשיא ומנהיג הדור לתקן אך נשמות ישראל למעלה וכמ\\\"ש דמות צורות לבנו' היה לו לר\\\"ג בעלייתו ובחי' לבנה היא השכינה כנודע ובה היה מסתכל להיו' כל ישראל בני עליה ולכך כשהסתכל למעלה על נשמת ר' יהושע וחביריו הנה הם גדולים וטובים בעיניו. ולא דאג עליהם כלל מי יתן כל ישראל כמותם. אבל ר' יהושע אמר לו כי צריך להסתכל גם למטה בעוה\\\"ז על פרנסת ישראל לבל יחסר להם כל טוב. וזה אי אתה יודע בצערן של ת\\\"ח בעוה\\\"ז כנ\\\"ל. והנה כן השבטים שהיו אצל אביהם המה ראו בעיניהם צערו ואבלו של יעקב אביהם ימים רבים. אבל יוסף הצדיק שהיה מרוחק ממנו והוא שהיה במדריגה העליונה כנ\\\"ל הנה הוא הסתכל רק למעלה. ושם הנה ראה גודל מעלת יעקב אבינו ע\\\"ה דיוקנו של אביו חקוקה בכסא הכבוד וכל שהצטער יותר בעוה\\\"ז הנה נתעלה למעלה יותר ויותר לכך לא דאג כלל על צערו של אביו. וז\\\"ש אוכל ושותה וכו'.אבל הקב\\\"ה אמר כי לא יאות כן רק צריך להסתכל על עניני עוה\\\"ז וז\\\"ש אביך מתאבל כו' וז\\\"ש משפט וצדקה ביעקב אתה עשית. פי' שגם בעת המשפט שם הוא צדקה ביעקב לדורות כי הכל היה תיקון העתיד לזמן הזה. וז\\\"ש לך נא ראה את שלום אחיך. התורה מלמד' להצדיק הדור להסתכל ולראות את שלום אחיך בעוה\\\"ז ואת שלום הצאן. וזהו ענין מעלת נסיעה לצדיק הדור ע\\\"ד בקשת חיי ומזוני בעוה\\\"ז כי למעלה יודעים כי הכל לטובה ואינה רואים שום ריעותא וחסרון בצרכי עוה\\\"ז. אבל הצדיק שהוא אתנו בעוה\\\"ז הנה הוא רואה כל היום בחוסר וצרכי פרנסת עוה\\\"ז וכן שאר דברים בבריאות וכדומה. לכן הנה הוא מתפלל על עמו כל הימים לכן הוא מפיק להם ברכה וחיים ושלום. אמן:",
            "explanation": "ביאור העניין הוא שהמוסר השכל ממכירת יוסף הוא הצורך להסתכל גם על ענייני העולם הזה ולדאוג לצרכי הזולת, כפי שיוסף הצדיק למד מהקב\"ה שעל אף מעלתו הרוחנית הגבוהה, עליו להתחשב בצערו של אביו יעקב ולהבין את חשיבות הדאגה לשלום האחים ושלום הצאן בעוה\"ז."
        },
        {
            "source": "Tiferet Shlomo, Torah, Vayeshev 9",
            "relevant_sentences": "\"אין משפטים ישירים\"",
            "passage": "א\\\"י לך נא ראה את שלום אחיך ואת שלום הצאן וכו'. דהנה מצינו צדיקים גדולים וטובים אשר מעולם המה שלא כוונו כל ימיהם רק על רוממת כבודו ית\\\"ש ולא שתו את לבבם לטובת עוה\\\"ז להשפיע לדורם כמ\\\"ש באליהו הנביא כנ\\\"ל. וכן הי' ענין נדב ואביהוא כתי' בקרבתם לפני ה' וימותו. ומפני כי כל עבודתם הי' רק על כבודו ית\\\"ש כנ\\\"ל. לכן לא הי' להם הנהגה בזה העולם. וכן הי' ענין ער ואונן שהיו נשמות גבוהים מאד כנודע. וחטאו בזה שלא חשבו בטובת אחיהם בעוה\\\"ז כמ\\\"ש לבלתי נתן זרע לאחיו. זרע הוא בחי' האור זרוע לצדיק להצמיח בקרב ישראל יראת שמים והשפעות טובות לכן לא הוטב בעיני ה' כי רוצה ה' בעמו ומרבה להטיב להם ובטובם נתגדל ונתקדש שמו ית' בעולם והנה כן יוסף הצדיק מתחלה לא שת לבו רק לקנא את קנאת ה' צבאות על גדולת הבורא לבד לכן ויבא יוסף את דבתם רעה אל אביהם. כי העבירה הקטנה שנראה לו מהם הי' גדול בעיניו מאד וקנא הוא להשי\\\"ת לכן כתיב וישנאו אותו ולא יכלו דברו לשלום. פי' לא יכלו להתנהג כמדתו. דברו לשון הנהגה. כי לא הוטב בעיניהם מה שלא השגיח להטיב להם. אך כאשר יעקב אמר לו לך נא ראה את שלום אחיך ואת שלום הצאן להשפיע להם. לזאת השיב אל המלאך הדובר עמו את אחי אנכי מבקש להשפיעם כל טוב:",
            "explanation": "ביאור העניין הוא שמוסר השכל של מכירת יוסף הוא ההבנה כי אף הצדיקים הגדולים, אשר כל מגמתם היא רוממות כבודו יתברך, צריכים לשים לב גם לטובת אחיהם בעולם הזה ולהשפיע עליהם טוב, וכאשר יוסף הצדיק למד זאת, ביקש להשפיע כל טוב לאחיו, ובכך נתקן החטא הראשוני של חוסר ההשגחה על טובת הזולת."
        },
        {
            "source": "Tiferet Shlomo, Festivals, Rosh Hashanah 4",
            "relevant_sentences": "וכן ביוסף הי' כזה כל ענין המכירה ואשר שמו אותו בבור הי' תמוה בעיניו כאשר אמר וגם פה לא עשיתי מאומה כי שמו אותי בבור. והאמת הי' כי השיעבוד שלו הי' רק הכנה על גלות מצרים ועל קירוב הגאולה ללקט הני\"ק הנפזרים כידוע מספרים שכל ענין הגלות הוא לרבות גרים הם הניצוצות כידוע. לכן אח\"כ כשירד יעקב למצרים אמר יוסף והגדתם לאבי כל כבודי במצרים. פי' כל ענין הכבוד והגאולה הי' ע\"י ירידתי למצרים.",
            "passage": "(נחמיה ח׳:י׳) ויאמר להם לכו אכלו משמנים ושתו ממתקים ושלחו מנות לאין נכון וכו' כי חדות ד' הוא מעוזכם. ודרשו רז\\\"ל שזה קאי על ר\\\"ה. הנראה לרמז בזה לחזק ידים רפות על מה שאנו רואים כובד הגלות שמתגבר בכל יום כי הוא ענין הנסתר מבני אדם כי באמת הוא טובה גדולה לקרב הגאולה. ונבאר הענין עפ\\\"י משל לרופא מומחא שנכנס אצל החולה בהתחלת החולי שיש לו רק מיחוש בעלמא ועודנו מתחזק כבריא ללכת ברגליו וכאשר בא הרופא אליו לבקרו אומר עליו כי הוא צריך לרחמי' גדולי' ולעסוק ברפואות וסמים. וברבות הימים כאשר הכביד חוליו ושוכב ערש דוי אשר כמעט נתיאשו ממנו נכנס הרופא עוד אליו ואומר לכל הנצבים עליו שלא ידאגו עוד מאומה כי מהר יתרפא ויעמוד מחוליו הקשה הנה בעיני הרואים הוא דבר הפלא ופלא כי הנה בעודנו החולה הזה הולך ומתחזק ברגליו הי' אומר עליו כי הוא מסוכן ועתה כאשר הכביד חוליו ובשרו רזה וכחוש מכף רגליו עד ראשו אין בו מתום הוא אומר עליו כי מהר יתרפא. אך האמת כן הוא כי הרופא הבין כי אז הי' רק התחלה ובוודאי בכל יום יכביד עליו חוליו לכן אז הי' צריך לרפואות ולסמים ולרחמים רבים. אך עתה כאשר עבר עליו כל התלאה הוא בטוח עליו כי יפול עליו זיעה ומהר יתרפא. וכן הוא ג\\\"כ ענין הגלות לפי הנראה בעיני בשר הוא דבר הפלא מדוע עשה ד' ככה. ומי לנו גדול ממשה רבינו ע\\\"ה כאשר ראה קושי השיעבוד הקשה ואמר למה הרעות כו'. והשיב לו הקב\\\"ה וארא אל אברהם כו' לכן אמור לבני ישראל אני ד' והוצאתי אתכם מתחת סבלות מצרים. כי הש\\\"י הי' יודע כי מהר יהי' הישועה כי הקושי שיעבוד ישלים הקץ. וכן ביוסף הי' כזה כל ענין המכירה ואשר שמו אותו בבור הי' תמוה בעיניו כאשר אמר וגם פה לא עשיתי מאומה כי שמו אותי בבור. והאמת הי' כי השיעבוד שלו הי' רק הכנה על גלות מצרים ועל קירוב הגאולה ללקט הני\\\"ק הנפזרים כידוע מספרים שכל ענין הגלות הוא לרבות גרים הם הניצוצות כידוע. לכן אח\\\"כ כשירד יעקב למצרים אמר יוסף והגדתם לאבי כל כבודי במצרים. פי' כל ענין הכבוד והגאולה הי' ע\\\"י ירידתי למצרים. וז\\\"פ בפ' נצבים. ואמרו כל הגוים על מה עשה ד' ככה לארץ הזאת וכו' ואמרו על אשר עזבו וכו'. ולכאורה קשה למה דוקא הגוים יאמרו הלא גם בנ\\\"י יתמהו על כובד יהגלות. אך הפי' בזה כי דוקא הגוים יהיו תולים כי כובד הגלות הוא מחמת אשר עזבו שחטאו בנ\\\"י ושלחם ביד פשעם. אולם הכתוב מסיים ואמר הנסתרות לד' אלהינו והנגלות לנו ולבנינו לעשות כל דברי התורה הזאת. כי ישראל הם מאמינים ובני מאמינים. הם צריכין להבין זאת כי הגלות הוא ענין נסתר ולעתיד הכל ידעו כי הי' לטובה. כמ\\\"ש ישמחו השמים ותג\\\"ל הארץ רומז לשכינה הקדושה. ותג\\\"ל אותיות גלו\\\"ת. ונחזור לעניננו כי בימי עזרא ג\\\"כ היו בנ\\\"י בתכלית השפלות קודם בנין בית שני. לכן אמר להם עזרא לכו אכלו משמני' וכו' ושלחו מנות לאין נכון לו. פי' אפי' מי שלא הכין לבו על הגאולה בתשובה שלימה כראוי בכל ימי הגלות עכ\\\"ז אל תעזבוהו ותחזקו בידו להיות עמכם יחד ולהחזירו בתשובה שלימה. כי חדות ד' הוא מעוזכם פי' כי הבטחת הש\\\"י ב\\\"ה על הגאולה והוא היודע כי מהר יצמיח לכם ישועה. הוא מעוזכם לחזק גם עתה את לבבכם. וכן נזכה לישועה למהר קץ הגאולה במהרה בימינו אמן:",
            "explanation": "ביאור העניין הוא שמכירת יוסף והשמתו בבור, אף שנראו כתמוהים בעיניו, היו למעשה הכנה לגלות מצרים ולקירוב הגאולה, שכן כל ענין הגלות הוא לרבות גרים וללקט ניצוצות קדושה, ולכן אמר יוסף \"כל כבודי במצרים\" כי ירידתו לשם הביאה לגאולה."
        },
        {
            "source": "Tiferet Shlomo, Festivals, Sukkot 62",
            "relevant_sentences": "\"הנה כן צריך ללמוד מזה כי עיקר בחי' הצי\\\"ע הוא רק להשפיע לישראל כל טוב ולא לצורך עצמו כלל.\"  \n\"והנה כמו שמבואר בגמ' נשיאות אני נותן לך עבדות אני נותן לך ר\\\"ל כל עניניך יהי' רק להשפיע לאחרים.\"  \n\"והוא שנאמר אצל יוסף שאמר לו אביו לך נא ראה את שלום אחיך להשפיע להם ולא לעצמך כלל.\"  \n\"ויען לאמור את אחי אנכי מבקש ר\\\"ל מעתה אני יודע כי צריך אני רק לבקש את אחי ולהשפיע להם כל טוב:\"",
            "passage": "(בפ' וישב) וימצאהו איש והנה תועה בשדה וכו' ויאמר את אחי אנכי מבקש. הנראה ברמז הכתוב מבלי שנאריך בדקדוקים. דהנה כתיב בע\\\"ח בשער הכללים בענין סוד שבירת הכלים וז\\\"ל.. והנה כשהגיע האור אל היסוד באו ב' אורות א' שלו וא' לתת אל המלכות והחלק שלו להיותו גדול לא יכול לסבלו ונתבטל כמו האחרים. אך חלק המלכות שקבל הוא נשאר בו ולא נתבטל. וז\\\"ס בן ישי חי על האדמה ולכן נקרא יסוד ח\\\"י ע\\\"כ. המבואר מזה כי עיקר קיום הבחי' של יסוד הי' רק במה שהוא להשפיע לאחרים אבל לא מה שצריך לעצמו כי שלו נתבטל רק מה שהוא להשפיע לאחרים זה מתקיים בידו. הנה כן צריך ללמוד מזה כי עיקר בחי' הצי\\\"ע הוא רק להשפיע לישראל כל טוב ולא לצורך עצמו כלל. וזהו הרמז בפסוק ואלה המלכים שזה מוסב על סוד שבירת הכלים כמבו' בזוה\\\"ק. ואמר הכתוב כי סיבת שבירתן הי' לפני מלוך מלך לבני ישראל שלא השפיעו לכנ\\\"י. ולכך הנה זה הענין האמור אצל יוסף הצי\\\"ע שהוא בבחי' היסודות שלמעלה כאשר אמר לאחיו והנה תסובנה אלומותיכם ותשתחוין לאלומתי שרמז כי כולם צריכין לעבור על ידו שזהו בחי' ההשתחוואה כנודע כי הכל עובר דרך היסוד. אכן הם סברו בו כי מתנשא הוא למלוך לעצמו. ולכך אמרו לו המלוך תמלוך עלינו ר\\\"ל אם סבור אתה למלוך לעצמך הנה בלי ספק תתבטל כמו שנתבאר לכך נאמר ולא יכלו דברו לשלום ר\\\"ל לא היו יכולים להנהיג השפעתו לשלום מלכות כנ\\\"ל. והנה כמו שמבואר בגמ' נשיאות אני נותן לך עבדות אני נותן לך ר\\\"ל כל עניניך יהי' רק להשפיע לאחרים. והוא האמור אצל מלך ישראל לבלתי רום לבבו מאחיו ר\\\"ל לבל יסלק השפעתו מהם אז יהי' למען יאריך ימים על ממלכתו הוא ובניו בקרב ישראל להשפיע לישראל והוא שנאמר אצל יוסף שאמר לו אביו לך נא ראה את שלום אחיך להשפיע להם ולא לעצמך כלל. וכן כשראה א\\\"ע תועה וישאלהו האיש מה תבקש ר\\\"ל מה דעתך עתה ויען לאמור את אחי אנכי מבקש ר\\\"ל מעתה אני יודע כי צריך אני רק לבקש את אחי ולהשפיע להם כל טוב:",
            "explanation": "ביאור העניין הוא שהמוסר השכל ממכירת יוסף הוא שהצדיק האמיתי, כמו יוסף, תפקידו להשפיע טובת ישראל ולא לצורך עצמו, וכפי שנאמר \"את אחי אנכי מבקש\" להורות כי כל עניינו הוא לבקש את טובת אחיו ולהשפיע להם כל טוב, וכך גם נאמר בגמרא שהנשיאות היא עבדות, דהיינו שכל ענייניו יהיו להשפיע לאחרים ולא לעצמו."
        },
        {
            "source": "Tiferet Shlomo, Torah, Vayeshev 4",
            "relevant_sentences": "\"וזה שהשיב להם יוסף והנה תסובינה אלומותיכם ותשתחוין לאלומתי. כי הכל תלוי בו. כי הצדיק הוא העמוד שהעולם קיים על ידו והם לא האמינו לדבריו והפשיטו את כתנתו את כתונת הפסים והוא הי' עיקר הפגם של השבטים במכירת יוסף.\"",
            "passage": "וישראל אהב את יוסף מכל אחיו ועשה לו כתונת פסים. ויקנאו בו אחיו וכו'. בגמ' שבת דף י' בשביל משקל ב' סלעים מילת שנתן יעקב ליוסף יותר משאר בניו נתקנאו בו אחיו ונתגלגל הדבר וירדו אבותינו למצרים. הנה הדברים האלו לפי פשוטן אין להם שחר. האם יתכן בקדושי עליון שבטי י\\\"ה כי יתקנאו עבור ב' סלעים מילת וכתונת. אמנם שורש הענין הוא ע\\\"ד שכתוב והבדילה הפרכת לכם בין הקודש ובין קודש קדשים למה הוצרך עוד הפרכת להבדלה הלא כבר מקודש החצר והמשכן עד מאד ומה תוסף עוד הפרכת להבדלה יכול להיות קדשי קדשים בלא הבדלה מהפרכת. אולם להבין זה הנה ידוע לי\\\"ח מענין הצמצום הרבים אשר בשעת בריאת עולם כדי שיוכלו העולמות למטה. להכיל אור א\\\"ם ב\\\"ה כי יש כמה וכמה אלפים ורבבות עולמות למעלה מעולם האצילות בבחי' לבושים זה בתוך זה וכן בד' עולמות אבי\\\"ע יש בהם שבא האור ההוא למטה דרך חלון ומסך ולבוש והיכלות כי זה בלא זה לא היו יכולין לקבל האור המתנוצץ עד עולם העשי' וממנו לעולם השפל הזה ג\\\"כ כזה כי שמש ומגן ה' כו' ד\\\"מ כמו אור השמש אשר לא יוכלו הבריאים להנות ממנו ולקבל אורו הגדול רק ע\\\"י מעבר החלון ומסך והיכלות. והנה בזמן שהי' בהמ\\\"ק קיים ואור ה' הופיע על הבהמ\\\"ק בקדשי קדשים בשפע רב לא הי' העולם יכול לסבול ולקבל האור היוצא בביהמ\\\"ק לכן הוצרך הפרכת להבדלה ד\\\"מ למען יוכלו הבריות לקבל אור השפע העליון אחרי מסך הפרכת והאולם וההיכל. וכן הי' הענין בבגדי כהונה (של)הכה\\\"ג חושן אפוד וכתונת וכו' להיות דוגמת האדם העליון והאורות החסדים בוקעים ומאירים בו הוצרך לבגדים יתירים האלו כמבואר בכתבי האריז\\\"ל סוד הלבושים. אך כאשר נכנם לפני ולפנים הי' לבוש רק ד' בגדים דוגמת ד' עולמות אבי\\\"ע. ולכך כה\\\"ג המחוסר בגדים פסול לעבודה. וזה הי' ג\\\"כ ענין הכתוב ופרשו עליו בגד תכלת וכסו בה את ארון העדות. בהיות הארון מקום השראת הקדושה האור העליון הוצרך הכיסוי תכלת שהוא בחי' צמצום כי תכלת דומה לכסא כבוד בחי' היראה כמבואר בזוה\\\"ק דתכלת היא תכלא דשצי כולא והוא בחי' גבורה והוא בחי' לבוש לצמצם האור כנ\\\"ל. וזה ג\\\"כ ענין המשמורות כהונה ולווי' שהיו בבהמ\\\"ק כי גם הלוים הי' בבחי' גבורה וצמצום על אור החסד שהיו הכהנים משפיעים לבל יצאו החוצה ואל יבוזו זרים והוא הענין התכלת האמור בציצית ונתנו על ציצית הכנף פתיל תכלת. שאור הציצית יהי' בחי' צמצום נגד החיצונים. כי ע\\\"ז מורה ענין התכלת בחי' גבורה וצמצום. וז\\\"ש בלשם יחוד בעטיפת הטלית. ובזכות מצות ציצית תנצל נפשי וכו' והטלית יפרוש כנפיו עליהם. כי הטלית הוא בחי' אור המקיף להנצל מן החיצונים. ולכך מתעטפין בטלית בשעת התפלה על התפילין לצמצם האורות של התפילין. וזש\\\"א מה יקר חסדך וכו' ואח\\\"כ משוך חסדך ליודעיך פי' אחר שנתעטף בטלית לצמצם החסדים מן החיצונים אז משוך חסדך ליודעיך כנ\\\"ל. ונחזור לענינינו. הנה כי זה הי' סוד כתונת יוסף שעשה לו אביו כתונת פסים. ומבואר במדרש שעשה לו ד' בגדים הרמז סוד לבושים הנ\\\"ל שהי' כה\\\"ג לובש בהם כי אמנם ידוע היות יוסף בחי' היסוד מכל העולמות צי\\\"ע והוא צנור ההשפעות. וכח הצדיק לצמצם ההשפעות לבל יתפשטו בין החיצונים כמ\\\"ש כי בן זקונים הוא לו. וזה שעשה לו אביו כתונת פסים ד' לבושים הנ\\\"ל בסוד ד' עולמות אבי\\\"ע כי יעקב ויוסף הם הצי\\\"ע כמ\\\"ש בווין תתקטר תרין ווי\\\"ן לכך הי' צריך הלבוש להיות נעשה ע\\\"י יעקב בעצמו לקשר ולדבק בו בחי' צי\\\"ע ולהיות מסך להשפעה העוברת על ידו להשמר מן החיצונים כמ\\\"ש שומר ה' את כל אוהביו. דלכאורה תיבת כל הוא מיותר. אך ידוע כי כל רומז לצי\\\"ע וכאשר הש\\\"י שומר ההשפעות ע\\\"י בחי' כל הוא הצדיק. אזי ממילא כל הרשעים ישמיד וכידוע ענין סוד כתונת אור של אדה\\\"ר להיות בסוד הלבישה כנ\\\"ל. וזה שאמרו חכז\\\"ל גנזו לצדיקים לע\\\"ל שהאור הראשון נגנז לצדיקי הדור שירדו ההשפעות על ידם וממילא הם נשמרים מן החיצונים והיא הגנוזה בהם. והוא שמצינו אצל רבקה ותקח את בגדי עשו בנה החמודות שחמד אותם מנמרוד שהי' לו מאדה\\\"ר וע\\\"י הקלקול באו לידי עשו. ורבקה נתכוונה להוציאם מידו להלביש את יעקב בנה הצדיק כי לו יאתה לקחת אותם. והנה בהיות הכרח סוד הלבושים האלו ליוסף להיות מסך נגד האור והחסד העובר על ידו לכן קנאו בו אחיו. באמרם כי גם המה בחי' צי\\\"ע. וזה שהשיב להם יוסף והנה תסובינה אלומותיכם ותשתחוין לאלומתי. כי הכל תלוי בו. כי הצדיק הוא העמוד שהעולם קיים על ידו והם לא האמינו לדבריו והפשיטו את כתנתו את כתונת הפסים והוא הי' עיקר הפגם של השבטים במכירת יוסף. וזו שהשמיענו הכתוב בזה שהפשיטו את כתנתו לומר שרצו לקחת ממנו בחי' הלבושים הנ\\\"ל לכך באו לכל הצרה הזאת ולולי כי הפשיטו את כתנתו לא הי' להם כח להזיקו במכירתם. אך מחמת כי הפשיטו את כתנתו הורידו את השפע לחיצונים. כמ\\\"ש להלן וישבו לאכול לחם וכו' וגמליהם נושאים כו' הולכים להוריד מצרימה פי' ההשפעות הלכו למצרים וז\\\"ש והשליכו אותו הבורה והבור ריק אין בו מים. ודרשו רז\\\"ל אבל נחשים ועקרבים יש בו. תיבת אותו רומז לבחי' אות ברית צי\\\"ע כי המדה זאת ירד להחיצונים. ולזה ויברך ה' את בית המצרי בגלל יוסף. וז\\\"ש יעקב כתונת בני חי' רעה אכלתהו טרוף טורף יוסף. לפי פשוטו אין הבנה לזה איך יצא מפיו של אותו צדיק דבר אשר לא כן הי' כי באמת הי' יוסף חי במצרים. אך לפי הנ\\\"ל הפי' בזה כי מפני שהפשיטו את הכתנת בחי' הלבוש כמ\\\"ש כתונת בני שעשה לו יעקב בעצמו בחי' לבוש כנ\\\"ל טרוף טורף יוסף רמז לרפ\\\"ח ני\\\"ק ובגלות הוא נטרף לחיצונים. וזה שהתמרמר יעקב אבינו כי ארד אל בני אבל שאולה. ר\\\"ל כי אצטרך לירד להוציא מהם ההשפעות והני\\\"ק שנפלו. וז\\\"ש ויבך אותו אביו בחי' או\\\"ת כנ\\\"ל ולכך כאשר נדחה השפע לחיצוני' לכן נשארו השבטים חסר לחם. ויוסף בהיותו בגלות הי' רוצה לעשות לו בעצמו לבושים ולא הועיל כדכתיב ותתפשהו בבגדו כו' פי' בגד שלו. אבל בבגד של אביו לא הי' לה שליטה. וזה ויעזוב בגדו בידה וינס ויצא החוצה. כידוע ענין עשרה הרוגי מלכות שנתגלגל עי\\\"ז כיל\\\"ח אך כאשר יצא יוסף מבית האסורין כתיב ויגלח ויחלף שמלותיו כי אז חזר בחי' הלבושי' ע\\\"י אורו עוטה כשלמה כמו שהי' בתחילה. וז\\\"ש יוסף לפרעה בלעדי אלהים יענה את שלום פרעה. כי כאשר היניקה יורד להחיצונים הוא בחי' אלקים. וז\\\"ש יוסף בלעדי אין לך משלי כלום כי אני מבחי' הוי'. רק אלהים יענה את שלום פרעה היניקה שלך הוא מבחי' אלקים. אשר נמשך החיות לבהמות וחיות אפי' הטמאות כמ\\\"ש ר' אליעזר אפי' בהמה טמאה נפשה לשמים. החיות שלה מבחי' אלקים ע\\\"י צמצום והשתלשלות עד אשר נעשה חלילה אלקים אחרים וחיצונים ר\\\"ל. אולם אח\\\"כ כשבאו אחי יוסף ונעשה היחוד וצירוף בשם הוי' וחזר בחי' היסוד אז אמר יוסף שימו לחם סוד ג' הויו\\\"ת. וז\\\"ש ויתן להם לבדם ולמצרים לבדם כי לא יוכלון המצרים לאכול את העברים לחם כי תועבה הוא למצרים. ר\\\"ל כי המצרים ניזונים מבחי' אלקים אחרים ובישראל כתיב לא תאכל כל תועבה. וזה שאמר יוסף חי פרעה אם תצאו מזה. ר\\\"ל אם תצאו מזה הנה תשוב החיות לפרעה. וזש\\\"א בשבת יום קדוש הוא מבואו ועד צאתו. כי השפע היורד בשבת הוא מצד הקדושה בחי' יסוד צדיק כמ\\\"ש וזכרת כי עבד היית במצרים לעבד נמכר יוסף כמבואר במ\\\"א. לכן השפע היורד בשבת מעולם העליון הוא בשמירה מהחיצוני' כי הוא מצד הקדושה מבואו ועד צאתו לעוה\\\"ז. לכן כל זרע יעקב יכבדוהו כו' ואל יבוזו זרים. ודברינו הנ\\\"ל נרמזו בדברי הזוה\\\"ק פ' בלק דף רד ע\\\"ש והבן:",
            "explanation": "ביאור העניין הוא שהמוסר השכל ממכירת יוסף הוא ההבנה כי הצדיק, שהוא עמוד העולם, נדרש ללבושים רוחניים המגנים עליו ומצמצמים את השפעותיו, וכאשר השבטים הפשיטו את כתונת יוסף, הם פגעו בסדר הרוחני והורידו את השפע לחיצונים, ובכך נגרמה הירידה למצרים."
        }
    ]
}