{
    "question": "our existence on this world is in the merit of the prayers of our forefathers",
    "analyzed_passages": [
        {
            "source": "Tiferet Shlomo, Torah, Beshalach 22",
            "relevant_sentences": "\"אין משפטים ישירים\"",
            "passage": "א\\\"י זה אלי ואנוהו כו' . פרש\\\"י אלהי אבי לא אני תחלת הקדושה אלא מוחזקת ועומדת לי הקדושה ואלקותו עלי מימי אבותי. הנה כבר נתבאר במ\\\"א כי זהו מנת חלק אבותינו הקדושים בכל צדקתם ועבודתם להש\\\"י להוריד ולהשאיר ברכה לזרעם אחריהם כיום הזה וכוונתם הי' מאז להיות בניהם אחריהם עובדים את ה' באהבה ויראה ובתמימות כמוהם אשר ע\\\"כ יתארו בשם אבות להיותם נאמנים לתולדותם הבאים אחריהם מכחם. וע\\\"כ הצדיקים הקדושים ההם בחייהם ובמותם לא נפרדו מזרעם אחריהם בכל דור וכח האב דבוק בבן לא נפרד ממנו גם עתה. א\\\"כ כל עניני המצות ומעש\\\"ט אשר בנ\\\"י עושים שייך ומגיע לשורש נשמתם של אבותינו הקדושים ומיוחס להם לכך צריך האדם לומר מתי יגיעו מעשי למעשה אבותי להדבק בשורש האבות כנ\\\"ל. וזש\\\"א אלהינו ואלהי אבותינו האלקות מאבותינו נמשך לנו כן כל ענין כריתות ברית עם האבות הי' רק למען תת השפעות טובות לבנים כי כן מורה ענין הברית וכרות עמו הברית לתת ר\\\"ל כל ענין הברית רק לתת כו' לכן נאמר וזכרתי להם ברית ראשונים כנ\\\"ל. וכ\\\"נ וארא אל האבות כו' ואזכור את בריתי כו' . ר\\\"ל כבר הראיתי להאבות כל הטוב והשפעות טובות אשר יגיע לבנ\\\"י זרע ברך ה' בשם אל שדי לכן ואזכור את בריתי. והנה כי כן כי כל הטובות אשר יגיע לעם בנ\\\"י הם נוגעים אל האבות ומטובתם של הבנים מגיע שמחה להאבות אשר עמנו כהיום הזה משרשם. לכן רמזו בתפלת י\\\"ח אתה גבור כו' מחיה מתים ורב להושיע. מכלכל חיים בחסד כו' סומך נופלים ורופא חולים כו' . לכאורה מה ענין סומך נופלים וכו' לענין מחי' מתים. אבל לפי דרכינו יאמר בזה שאתה גבור ובעל גבורות ונמתקין בשרשם ורב להושיע בזה מחי' מתים הם האבות ובמה שאתה מכלכל חיים בחסד וסומך נופלים בזה מקיים אמונתו לישיני עפר דמיכי חברון כמ\\\"ש במ\\\"א ע\\\"פ כי ידעתיו למען אשר יצוה את בניו כו' למען הביא ה' על אברהם כי באמת הכל שב אל אברהם וכן ביעקב מה זרעו בחיים אף הוא בחיים כנ\\\"ל. וז\\\"ש ומשמחתך ששמחת בו ביעקב כי לו מגיע השמחה ואח\\\"כ נאמר בפ' ק\\\"ש שמע ישראל ישראל סבא ושמעו אל ישרא\\\"ל אביכם. ונחזור לענין הנה בקריעת ים סוף לא הי' כל הגדולות והונראות רק זאת לבד להעביר את ישראל בחרבה כי לכאורה לא הי' ענין הכרחי כמבו' בספרים. אך באמת גבהו מחשבות ה' בענין קריעת י\\\"ס וסודו ידוע להמשכילים כמבו' בזוה\\\"ק בעתיקא תליא מלתא וכדי לדכאינן במיין עלאין בבחי' נחל קדומים לגוזר ים סוף לגזרים והעביר ישראל בתוכו כנודע בספרים. ע\\\"כ כמוהו יעברו גאולים לעתיד כמ\\\"ש והכהו לשבעה נחלים והדריך בנעלים כי הוא ענין עבדות טהרה וקדושה לכן אחרי העבירם בים סוף נתקדשו ואמרו תיכף שירה ולא אמרו זאת אחר צאתם ממצרים. ולכן נאמר וירא ישראל ישראל סבא כנ\\\"ל. וזה שפרש\\\"י מוחזקת ועומדת היא הקדושה ואלקותו מימי אבותי כי אלקותו ועוצם הקדושה היא באה לי מכח חזקה זה היא של אבותי אשר השאירו אחריהם ברכה אתנו כנ\\\"ל:",
            "explanation": "ביאור העניין הוא שהקדושה והאלקות המוחזקת לנו מימי אבותינו הקדושים, היא המאפשרת את קיומנו בעולם הזה, שכן כל מעשינו ומצוותינו נמשכים מכחם וברכתם של האבות, אשר תפילותיהם ועבודתם לה' השאירו ברכה לזרעם אחריהם."
        },
        {
            "source": "Tiferet Shlomo, Torah, Eikev 5",
            "relevant_sentences": "אין משפטים ישירים",
            "passage": "(מכי\\\"ק)א\\\"י והי' עקב תשמעון כו' אשר נשבע לאבותיך. הנ\\\"ל דהנה כתיב מכלכל חיים בחסד מחיה מתים ברחמים רבים. והוא ע\\\"ד המבואר בזוה\\\"ק שלולי תפלת האבות והמתים שהם מתפללים על החיים לא הי' העולם קיים. וכן ידוע שע\\\"י הצדיקים החיים בעוה\\\"ז שמתפללים על העולם הם מקיימין את העולם וזה הפי' שיתף עמו מדה\\\"ר היינו תפלת הצדיקים שני אלפים שנה הי' העולם קיים בשביל אברהם אבינו שיהי' בעולם כמ\\\"ש קבל שכר כנגד כולם. וז\\\"ש אשר עשה אתך את הגדולות והנוראות האלה פי' אתך רק על ידך עשה כל זאת וכן אשר אני עושה עמך על ידך ועמך בשיתוף אני עושה הכל כי הכל עבור הצדיקים ברוך מרחם על הבריות ברוך משלם שכר טוב ליראיו. פי' החסד שעושה הקב\\\"ה עם העולם ומרחם על הבריות הנה הוא תולה הכל ביראיו כדי לשלם להם שכר טוב שהם מקיימין את העולם כנ\\\"ל. וכן המתים ששוב אינם עושים מצות ובמה יתרבה להם שכר טוב בעוה\\\"ב. הוא בעבור שהם מקיימין את העולם לאחר מותם. וזה הפי' מכלכל חיים בחסד היינו החסדים שבאים לעולם תולה אותם בצדיקים החיים ונותן להם שכר. מחי' מתים ברחמים רבים. פי' וגם המתים מחי'אותם ומשפיע להם שכר טוב ברחמים רבים היינו ברחמים רבים הבאים לעוה\\\"ז עבורם בזה מחיה המתים לעוה\\\"ב וכמו שמצינו במשרע\\\"ה זכור לעבדיך לאברהם ליצחק וליעקב ונתרצה הקב\\\"ה בזכותם. ובזה נתרבה שכרם לעוה\\\"ב. וזהו המתים להחיות פי' להחיות העולם ובזה מקיים אמונתו לישיני עפר. וזהו הברכה מחיה המתים בעבור שהם מתפללים על החיים. וז\\\"ש בחייהם ובמותם לא נפרדו לעשות רצון קונם. פי' שבחייהם ובמותם לא נפרדו מלהתפלל על העולם וזהו הוא רצון קונם. וזהו הפי' והי' עקב תשמעון כו' ושמר ה' אלהיך לך את הברית. פי' ישמר לך לטובה ולברית שלום את החסד שעושה וגם אשר נשבע לאבותיך גם להם יהי' שכר טוב בעוה\\\"ב עבור זה שמתפללים כל הימים עליכם לטובה:",
            "explanation": "ביאור העניין הוא שהקיום שלנו בעולם הזה תלוי בזכות תפילות האבות והצדיקים, הן החיים והן המתים, אשר מתפללים על העולם ומקיימים אותו, ובכך מתרבה שכרם לעולם הבא, כפי שמבואר בזוהר הקדוש ובדברי התפארת שלמה."
        },
        {
            "source": "Tiferet Shlomo, Torah, Toldot 4",
            "relevant_sentences": "\"אין משפטים ישירים\"",
            "passage": "א\\\"י ואלה תולדות יצחק בן אברהם אברהם הוליד את יצחק. לכאורה הם כפולות הדברים הלא כבר כתיב יצחק בן אברהם. אכן הנ\\\"ל עפ\\\"י מ\\\"ש כי זכר את דבר קדשו את אברהם עבדו. להראות גודל מעלת א\\\"א ע\\\"ה אשר הוא היה הראשון לעשות היחוד בעולמות העליונים כמ\\\"ש עד אברהם לא היה זקנה כנ\\\"ל. וזה כי זכר את דבר קדשו בחינת זכר הוא המשפיע דכר הוא היחוד כמ\\\"ש ראוה מדברת כו' לכן בכח גודל קדושתו שהתחיל לעשות היחוד זה העומד לעזר ולסייע לכל הדורות הבאים אחריו. כמ\\\"ש (תהילים ע״ח:ה׳) ויקם עדות ביעקב ותורה שם בישראל אשר צוה את אבותינו להודיעם לבניהם לשון צוותא והתחברות עם כל הדורות אשר יבואו אחריו להיות מסייע לכל הבא לטהר ולעמוד לשרת לפניו ית\\\"ש. כמ\\\"ש בגמ' כל הקובע מקום לתפלתו אלהי אברהם בעזרו. יכול להמשיך עליו הקדושה והעבדות של א\\\"א ע\\\"ה. אלהי אברהם היינו האלקות שהמשיך אברהם על העולם כי הוא היה הראשון שהכיר הבורא ב\\\"ה והוא העומד לנו לעזר. וז\\\"ש בכל יום עזרת אבותינו אתה הוא מעולם כו' אשרי האיש שישמע למצותיך וכו'. פי' עיקר העזר הוא מאבותינו הקדושים אברהם אך אשרי האיש שישמע למצותיך ועודנו בחיים חיותו לעורר בעבודתו עזרת האבות כמ\\\"ש הארון נושא את נושאיו. וזה הנוהג בכל יום בעמדו בתפלה כמ\\\"ש בזוה\\\"ק בהקדמה דף י\\\"א ע\\\"א וז\\\"ל. ובצפרא קם מערסי' בעי לברכא למאריה ולמיעל לביתיה ולמסגד קמי היכליה בדחילו סגיא ובתר כן יצלי צלותי' ויסב עיטא מאינון אבהן קדישין דכתיב ואני ברב חסדך אבא ביתך כו' הכי אוקמוה לא לבעי לי' לבר נש לאעלא בי כנישתא אלא אי אמליך בקדמיתא באברהם יצחק ויעקב. וז\\\"ש בהודו אשר כרת את אברהם ושבועתו ליצחק ויעמידה ליעקב כו':",
            "explanation": "ביאור העניין הוא שהזכרת אבותינו הקדושים בתפילה, ובפרט אברהם אבינו, היא המאפשרת את קיומנו בעולם הזה, שכן בכוח קדושתם וייחודם בעולמות העליונים הם מסייעים ומחזקים את כל הדורות הבאים אחריהם, וכך תפילותיהם עומדות לנו לעזר בכל יום."
        },
        {
            "source": "Tiferet Shlomo, Torah, Toldot 1",
            "relevant_sentences": "אין משפטים ישירים",
            "passage": "אלה תולדות יצחק בן אברהם אברהם הוליד את יצחק. הנ\\\"ל דהנה כתיב אלה תולדות השמים והארץ בהברא\\\"ם באברהם. והנה שמים וארץ הם בבחי' דכר ונוקבא. ואמר הכתוב כי כל תולדות זו\\\"נ ויחודם וזיווגם תחלה היה רק באברהם הוא היחוד דאזיל עם כולהו יומין. ולכך גם אח\\\"כ כל יחודי העולמות וקיומם ומה שמתחדשים בכל יום תמיד הוא רק באברהם. ובזכותו הוא מקיים כל העולמות מאז ועד עולם. והנה כשנסתלק א\\\"א ע\\\"ה והשאיר את יצחק בנו לבדו בעולם. היה הוא ירא מי יקיים העולמות ויעשה יחודים מעתה עוד כאשר ידע כי כל קיום העולמות רק באברהם ומי כמוהו הלא כל העולם אך חסד יבנה בבחי' חסד יבנה ויעשה היחוד. לכן הנה יצחק תיקן ברכת מחיה מתים להחיות זכותו של א\\\"א ע\\\"ה גם אח\\\"כ להתקיים כל העולמות בשבילו. וכל ימיו של יצחק אך בזה היה מכוון ומתהלך להיות כל היחודים בזכותו וכחו של אברהם נעשים כנ\\\"ל. וזש\\\"א אלה תולדות יצחק בן אברהם. פי' הנה תולדות יצחק. מה שהוליד והמשיך חיות להעולמות כולם היה הוא מכוון רק להיותו בן אברהם. ולכך נחמו הקב\\\"ה אח\\\"כ גם כן אל תירא כי אע\\\"פ שמת אברהם הנה זכותו וכחו קיים לעד כל ימי עולם עקב אשר שמע אברהם בקולי ולעולם יקרא זרע אברהם עבדי. וז\\\"ש אח\\\"כ אברהם הוליד את יצחק כי באמת כן היה כי בחי' אברהם פעל הלידה ביצחק כי ביצחק יקרא לך זרע. מה שהוליד יצחק הנה יקרא לך זרע ההוא. ואברהם הוליד את יצחק גם אחר שנסתלק הנה אך בזכות אברהם נעשה הכל כל ימי עולם. וזה תחיית המתים מן התורה. מכלכל חיים בחסד מחיה מתים כו' פי' מה שמכלכל חיים בחסד בחי' אברהם. אע\\\"פ שנסתלק כו'. כי הנה מחיה מתים ברחמים רבים ר\\\"ל מחיה בכל עת בחי' חסד אברהם גם אחרי שמת ונסתלק מעוה\\\"ז. ובזה סומך נופלים ורופא חולים מצמיח ישועה:",
            "explanation": "ביאור העניין הוא שהקיום המתמיד של העולמות והיחודים שבהם תלוי בזכות אברהם אבינו, וכך גם תפילותינו וזכויותינו נמשכות מכוחו וממשיכות לקיים את העולם, כפי שיצחק תיקן ברכת מחיה מתים להחיות זכותו של אברהם ולהמשיך את קיום העולמות בזכותו."
        },
        {
            "source": "Tiferet Shlomo, Torah, Toldot 2",
            "relevant_sentences": "\"אין משפטים ישירים\"",
            "passage": "א\\\"י ואלה תולדות יצחק בן אברהם אברהם הוליד את יצחק. הנ\\\"ל דהנה ברכת מחיה מתים הוא כנגד יצחק כנודע. והענין הוא כי כן כתיב אצל יצחק והקמותי את השבועה אשר נשבעתי לאברהם אביך והרביתי את זרעך כו' והתברכו בזרעך כל גויי הארץ עקב אשר שמע אברהם בקולי כו'. שמהדבור הזה שמע יצחק כמה גדול כחם של הצדיקים שאף אם נסתלקו מעוה\\\"ז והלכו לעולמם הנה הקב\\\"ה זוכר צדקותם כאלו הם חיים בעוה\\\"ז להשפיע כ\\\"ט לבניה' אחריהם כמ\\\"ש ליצחק כי הכל עושה בזכות אברהם עקב אשר שמע אברהם בקולי כי הצדיקים במיתתם קרוים חיים והוא שכתוב אני אמית ואחיה. אף לאחר המיתה אני אחיה אותם בטוב מעשיהם. ולכך תיקן יצחק ע\\\"ז ברכת מחיה מתים. וכמ\\\"ש מכלכל חיים בחסד הוא בזכות שהוא מחיה מתים ברחמים רבים ומקיים אמונתו לישיני עפר ומביא גואל לבני בניהם כי כל זה שמע יצחק מפי הקב\\\"ה בדבור הזה. וזהו עיקר תולדותיהן של צדיקים מעשים טובים. שבכח של מעשיהם הטובים הם משפיעים כ\\\"ט לתולדותיה' להחיותם ולקיימם בעוה\\\"ז. וזהו העיקר לתולדות כנודע. והוא הרמוז בלשון תולדותיהן של צדיקים הם ההשפעות שבא ע\\\"י היחוד למעלה שנעשה ע\\\"י הצדיקים וזהו מעשיהם הטובים טו\\\"ב יסו'ד מלכו\\\"ת. וזהו ואלה תולדות יצחק בן אברהם פי' מה שיצחק היה מוליד ומשפיע חסדים בחי' אברהם ולא הגבורות ח\\\"ו אמר הכתוב כי אברהם הוליד את יצחק כי בחי' ההשפעה של יצחק היא באה מבחי' אברהם והוא הוליד ומוליד חסדים תמיד אל יצחק להשפיע לעוה\\\"ז. והוא שכתוב וזכרתי את בריתי אברהם ואת בריתי יצחק כו' כי ההשפעות של יצחק הם מבחי' אברהם כמ\\\"ש עקב אשר שמע אברהם בקולי כו':",
            "explanation": "ביאור העניין הוא שכוחם של הצדיקים, אף לאחר פטירתם, ממשיך להשפיע על העולם בזכות מעשיהם הטובים, וכך תפילותיהם וזכויותיהם של האבות הקדושים מחיים ומקיימים את זרעם בעוה\"ז, כפי שנרמז בברכת מחיה מתים שתיקן יצחק בזכות אברהם."
        },
        {
            "source": "Tiferet Shlomo, Torah, Toldot 15",
            "relevant_sentences": "\"וז\\\"ש לו הש\\\"י אל תירא כו' בעבור אברהם עבדי. כי כל ההשפעות עודם יורדים בזכות אברהם.\"",
            "passage": "וירא אליו ה' בלילה ההוא ויאמר אנכי אלהי אברהם אביך אל תירא כי אתך אנכי וברכתיך כו' בעבור אברהם עבדי. הנראה לבאר עפ\\\"י מ\\\"ש בענין ג' ברכות הראשונות מגן אברהם הוא כנגד א\\\"א. מחיה מתים נגד יצחק. אתה קדוש נגד יעקב אבינו ע\\\"ה. והנה בברכה השניה יש בו ערבובי דברים פעם אחת מדבר נגד החיים ופעם נגד המתים מכלכל חיים כו' מחיה מתים. ומקיים אמונתו לישיני עפר. ומסיים מחיה מתים. הענין כאשר בארנו במ\\\"א במעלת הצדיקים אשר גם אחר סילוקם מעול' הזה נשאר רושם הקדושה בעוה\\\"ז להגן עלינו ומפיהם אנו חיים כמ\\\"ש בא\\\"א ויגוע ויאסף אל עמיו. וזה שאמרו כל המכבד את התורה גופו מכובד על הבריות להשפיע טובות וברכות לבריות אשר חיים עודנה כמ\\\"ש בכיבוד אב מאכילהו ומשקהו. וזש\\\"א וגנותי על העיר הזאת להושיעה למעני ולמען דוד עבדי. וז\\\"ש בזוה\\\"ק דומה דודי לצבי. מה הצבי מחזיר ראשו לאחוריו. פי הצדיקים בגן עדן עודם עיניהם פקוחות להשפיע כ\\\"ט לעוה\\\"ז. וז\\\"ש לו הש\\\"י אל תירא כו' בעבור אברהם עבדי. כי כל ההשפעות עודם יורדים בזכות אברהם. ולזה פתח ואמר בברכת מחיה מתים. כי הענין הזה התחיל בראשונה אצל יצחק שהיה לו עזר וסעד מאביו. הראשון היה א\\\"א ע\\\"ה בדבר זה:",
            "explanation": "ביאור העניין הוא שהשפעות הברכה וההגנה עלינו בעולם הזה נמשכות בזכות תפילותיהם ומעשיהם של אבותינו הקדושים, ובפרט בזכות אברהם אבינו, כפי שנאמר \"בעבור אברהם עבדי\", שמורה על כך שכל ההשפעות הטובות יורדות לעולם בזכותו."
        },
        {
            "source": "Tiferet Shlomo, Festivals, Introduction 4",
            "relevant_sentences": "עיקר קיום החיים בעולם הזה הוא רק ע\"י הזכות והתפלות של אבותינו הראשונים והקדושים אשר מעולם שהם מקושרים עם ישראל בכל מקומות מושבותם.",
            "passage": "וז\\\"פ הפ' והיתה נפש אדוני צרורה בצרור החיים כו'. דהנה כבר נתבאר בזוהר הקדוש סוד השארת הנפש של הצדיקים בעולם הזה ורוחם ונשמתם עולה למעלה וזהו לטובת החיים בעולם הזה כדי שיהיה להם התקשרות מה עם החיים בעולם הזה לדעת כל אשר יעשון ולהרגיש בצערם ולהתפלל עליהם כי עיקר קיום החיים בעולם הזה הוא רק ע\\\"י הזכות והתפלות של אבותינו הראשונים והקדושים אשר מעולם שהם מקושרים עם ישראל בכל מקומות מושבותם וכשישראל הם בטובה האבות שמחים עמהם כמבו' ברש\\\"י ויוציאך בפניו בפני האבות. ובזוהר הקדוש וירא ישראל ישראל סבא וכן כתיב יגל יעקב ישמח ישראל. וכדאי' במד\\\"ר שאמר הקב\\\"ה למשה לך ובשר להאבות שאני מנחיל לישראל את הארץ. וז\\\"פ מכלכל חיים בחסד מחיה מתים. פי' כאשר הש\\\"י ב\\\"ה מכלכל החיים בזה מחיה מתים שיש להם נחת רוח וחיות ע\\\"י הטובה שבאה לישראל וכן ע\\\"י שסומך נופלים ורופא חולים ומתיר אסורים בזה מקיים אמונתו לישיני עפר ששמחים באמונתם כי נתקבלה תפלתם. וז\\\"פ מלך ממית ומחיה ומצמיח ישועה אע\\\"פ שממית מ\\\"מ מחיה אותם ע\\\"י שמצמיח ישועה להחיים. אמנם עוד יש דרך וענין אחר כמו שמבואר למעלה כי השארת הנפש בין החיים הוא להתדבק עמהם להורותם וללמדם שהם מתעוררים בסוד היחוד נר\\\"נ והם שבים ובאים להתלמידים אחריהם לגלות להם סודות ורזין דאורייתא מעולמות העליונים כנ\\\"ל וז\\\"פ והיתה נפש אדוני צרורה בצרור החיים בעולם הזה בין החיים כנ\\\"ל. וזה הענין דאמרינן בכתובות פרק הנושא דף ק\\\"ג אצל פטירת רבינו הקדוש שאמרו כל מאן דאמר נח נפשיה דרבי ידקר בחרב. והוא קשה להבין מה בכך אם לא יאמר סוף הדבר להתגלות. אכן כדברינו ניחא כי אמנם כבר נודע כי הצדיקים אין להם מנוחה גם בעה\\\"ב כי תמיד הם שבים ללכת לבא אל התלמידים אשר בעולם הזה ללמדם דרכי השם וכאשר באמת נראה הדבר אצל רבי כי כל בי שמשי הוה אתי לביתי' מעולם העליון ולכך כל מאן דאמר נח נפשי' דרבי ר\\\"ל שהוא במנוחתו בעוה\\\"ב הנה זהו מורה על פחיתת מדריגתו כי לא בא לעולם הזה כנ\\\"ל לכן ידקר כו'. וזהו ג\\\"כ הענין בגמ' ברכות דף מ\\\"ג כי נח נפשיה דרב אזלו תלמידיו בתריה כי הדרו יתבי וקאכלי קא מבעי' להו הסבו מאי כו' לא הוה בידיהו קם ר' אדא בר אהבה אהדר קרעי' לאחורי' וקרע קריעה אחרת אמר נח נפשי' דרב וברכת מזונא לא גמרינן. ויש להבין למה קרע קריעה אחרת הזאת. אך הכוונה כנ\\\"ל כי בתחילה כאשר נסתלק רב מהם סברו כי עוד ישוב אליהם להורותם כנ\\\"ל אך כאשר ראו כי לא ידעו ההלכה הבינו כי נח נפשי' דרב ר\\\"ל בא אל מקום מנוחתו כבוד ולא ישוב אליהם כי נעלמה ההלכה מהם ואינו מזכירם לכך אז קרע קריעה אחרת כי בשעה הזאת נצטערו עד מאד אשר לא הגיעו למדריגה הזאת שיבא אליהם רבם הגדול כנ\\\"ל:",
            "explanation": "ביאור העניין הוא שעיקר קיום החיים בעולם הזה תלוי בזכות ובתפילות של אבותינו הקדושים, אשר נשמותיהם מקושרות עם ישראל בכל מקומות מושבותיהם, ומתפללים עליהם, ובכך מתקיימת השארת הנפש לטובת החיים בעולם הזה, כפי שמבואר בזוהר הקדוש ובדברי חז\"ל."
        },
        {
            "source": "Tiferet Shlomo, Festivals, Pesach 59",
            "relevant_sentences": "\"אולם גם אחרי שנסתלקו האבות הנה זה כחם לבניהם אחריהם בכל דור ודור והנה הצדיקים הם המושלים בקרב תבל בכל הנהגת העולם\"",
            "passage": "מה תצעק אלי דבר אל בני ישראל ויסעו. ויש להבין מה שאמר לו הקב\\\"ה מה תצעק אלי וכי מה הי' יכול משה רבינו עליו השלום לעשות בעת הצרה הזאת רק לצעוק אל ד' כי ראה כי אין מנוס לישראל כי הים לפניהם והמצרים מאחריהם. אכן הנה כתי' וישאו בנ\\\"י את עיניהם והנה מצרים נוסע אחריהם ויצעקו בנ\\\"י אל ד' וכפרש\\\"י תפסו אומנות אבותם באברהם הוא אומר אל המקום אשר עמד שם וביצחק כנ\\\"ל ע\\\"ש. ויש לשום לב לדברי רש\\\"י ז\\\"ל בזה שתפסו אומנות אבותם וכי בלא זה לא יכלו לצעוק אל ד' הלא גם בהיותם במצרים כתי' ויזעקו ותעל שועתם אל האלהים ולמה לא פרש\\\"י שם כי תפסו אומנות אבותם. אמנם הנה כבר נודע כי מאז ברא ד' את העולם ומלואו הנה בחסדו הגדול מסר את כל חוקי ההנהגה וטבעי העולם הזה וכל כחות צבאי השמים ממעל להיותם כולם נשמעים אל הצדיקים אשר בעולם הזה וביד עבדיו הצדיקים לשנות את מנהגם ולעשות מופתים בשמים ובארץ בעת הוצרך אליהם וזהו הוא אחרי כי כל העולם ומלואו נברא בשביל הצדיקים ועליהם הוא מתקיים. לכך הם המושלים בקרב תבל. ולא יעשה ד' אלהים דבר כי אם גלה סודו אל עבדיו הנביאים. והנה מאז הבריאה היו נשמעים אליהם. ומשתנים על פיהם בעת הצורך להם כמבואר בכתוב להמעיין בכל הניסים שנעשו להם בכל עת ובכל שעה. אולם גם אחרי שנסתלקו האבות הנה זה כחם לבניהם אחריהם בכל דור ודור והנה הצדיקים הם המושלים בקרב תבל בכל הנהגת העולם כמבו' זה במד\\\"ר על פסוק ולמשול ביום ובלילה ע\\\"ש והנה בצאת ישראל ממצרים הנה המה היו כולם צדיקים כולם קדושים והיתה כח הממשלה של העולם בידם הנ\\\"ל. וכמו שאמר הכתוב בצאת ישראל ממצרים היתה יהודה לקדשו ישראל ממשלותיו. פי' היתה יהודה לקדשו למסירות נפש כי שורש הקדושה הוא מסירות נפש וכמבו' במד\\\"ר שקפצו תחלה לתוך הים. וזהו ישראל ממשלותיו כמ\\\"ש צדיק מושל ביראת אלהים והיו הם המושלים בקרב תבל כנ\\\"ל. והנה זהו שפרש\\\"י ז\\\"ל שתפסו אומנות אבותם. ר\\\"ל כי פי' אומנות הוא כמו האומן העושה בהכלי כרצונו לפי פעלו ברצותו מרחיב וברצותו מקצר כאשר נראה לו. כן כל הנהגת העולם הי' ביד אומנות אבותינו לפעול בהם כרצונם. הן בדרך טבעי הן לפעול ניסים. ועד\\\"ז אמרו חכז\\\"ל שהתורה היתה כלי אומנות של הקב\\\"ה ר\\\"ל שעל ידי התורה מנהיג את העולם ברצונו. ולכך הנה בצאת ישראל ממצרים באותות ומופתים והוצרכו לילך אל המדבר אל מקום תוהו ומה גם לעבור דרך הים ביבשה. הנה הצדיקים האלה תפסו אומנת הזאת של אבותם בהנהגת העולם על פיהם לעשות להם ניסים ונפלאות בים ובמדבר וע\\\"ז הוא ויצעקו בנ\\\"י אל ד' לכן פרש\\\"י באברהם הוא אומר וכו' וכן ביצחק וכן ביעקב. כי באמת כן מתעורר עמהם כח שלשת האבות בקריעת י\\\"ס כמו שרמוז להמעיין ויהי באשמורת הבקר זה בקר של אברהם ויבקע\\\"ו המים אותיות יעקב בתוכו. וכן הים ראה וינס בכח יוסף וכן כולם ע\\\"ש. והנה כאשר מאז החזיקו בנ\\\"י באומנת אבותם הלא בלי ספק אין להם לירא כלל מפחד מצרים ומהים ולכך הוא שאמר הקב\\\"ה למשה מה תצעק אלי הלא כבר נמסר הכל בידם ואין הים עומד בפניהם דבר אל בנ\\\"י ויסעו כדאי הם לקרוע להם את הים כנ\\\"ל:",
            "explanation": "ביאור העניין הוא שכוחם של האבות הקדושים ממשיך לפעול בבניהם הצדיקים בכל דור ודור, ובזכות תפילותיהם ומעשיהם של האבות, הצדיקים שבכל דור יכולים למשול בהנהגת העולם ולעורר ניסים ונפלאות, ולכן קיומנו בעולם הזה תלוי בזכות תפילותיהם של האבות."
        },
        {
            "source": "Tiferet Shlomo, Torah, Yitro 7",
            "relevant_sentences": "והוא שאנו אומרי' על אבותינו ועלינו על בנינו ועל דורותינו על אבותינו באה תחלה הקדושה של דבריו חיים וקיימים ומהם בא עלינו ועל בנינו. וזה אלהי אברהם אלהי יצחק ואלהי יעקב וכו' וזוכר חסדי אבות ומביא גואל לבני בניהם כל הגאולה וישועה מן האבות בא לבני בניהם.",
            "passage": "ויבא משה ויקרא לזקני העם וכו' ויענו כל העם יחדו כל אשר דבר ה' נעשה. יל\\\"ד הלא משרע\\\"ה קרא רק לזקני העם וישם לפניהם את כל הדברים האלה אשר צוהו ה' ואיך ענו אותו כל העם לאמר כל אשר דבר ה' נעשה הלא לא להם קרא ולא היו בזה. גם באמת יש להבין למה לא קרא משרע\\\"ה לכל ישראל מיד לומר להם כל אשר צוה ה' כאשר כן נצטווה כה תאמר לבית יעקב ותגיד לבני ישראל. ולמה קרא רק לזקני העם. אכן הנה זקני העם הוא מורה על האבות שנקראים זקנים כמ\\\"ש ואברהם זקן. ביצחק ויהי כי זקן יצחק. ביעקב ועיני ישראל כבדו מזוקן. והוא שכ' מזקנים אתבונן.כי הנה כן ענין קבלת התורה היא באה ע\\\"י כחות האבות הקדושים כי משנולד אברהם אבינו התחיל שני אלפים תורה והוא שכתוב בו ואת הנפש אשר עשו בחרן ומתרגם דשעבידו לאורייתא כי ממנו התחיל שיעבודא דאוריי' והוא היה כלול כל ס' רבוא נשמות ישראל ושיעבדום לאורייתא כולם כאחד בקרבו כמ\\\"ש בו וישמר משמרתי מצותי חקותי ותורותי. וכן היה ביצחק ויעקב והוא שכתוב במתן תורה ותחת כי אהב את אבותיך ויבחר בזרעם אחריהם כי כל האבות היו בשעת קבלת התורה וכן כל הקדושות וכל הישועות של ישראל כולם עוברים דרך מערת המכפלה כמבואר בזוה\\\"ק. והוא שכ' וארא אל האבות תחלה ואח\\\"כ אמור לבני ישראל והוצאתי והצלתי וגאלתי ולקחתי כי על ידי האבות עוברים כל הישועות וכמש\\\"א בעבור אבותינו שבטחו בך ותלמדם חוקי חיים כן תחננו ותלמדנו. פי' בעבור אבותינו שעברו ע\\\"י אבותינו כנ\\\"ל. והוא שאנו אומרי' על אבותינו ועלינו על בנינו ועל דורותינו על אבותינו באה תחלה הקדושה של דבריו חיים וקיימים ומהם בא עלינו ועל בנינו. וזה אלהי אברהם אלהי יצחק ואלהי יעקב וכו' וזוכר חסדי אבות ומביא גואל לבני בניהם כל הגאולה וישועה מן האבות בא לבני בניהם. וז\\\"ש וארא אל האבות באל שדי א\\\"ל שד\\\"י גימ' מש\\\"ה כי כן הראה הש\\\"י להאבות שיהיה משה הגואל אותם לכן בע\\\"כ אמר לו הש\\\"י בסנה לילך ולגאול אותם כמו שכן הראה לאבות. והנה כאשר כל התורה התחילה מא\\\"א ע\\\"ה כמ\\\"ש לכך אמר לו הש\\\"י הנה אנכי בא אליך בע\\\"ב הענ\\\"ן ע\\\"ב הוא שם ע\\\"ב שבחסד אברהה הענ\\\"ן גימ' קע\\\"ה מנין שנותיו של אאע\\\"ה כי אברהם זקן בא בימים עם כל הימים בא בתורה למעלה וזהו ויאסף אל עמיו כל הקדושה שלו נאסף לישראל. הנה לכך גם משרע\\\"ה תחלה קרא והתעורר לזקני העם הם האבות למתן תורה אז על ידי כן התעוררו כל ישראל וזהו ויענו כל העם אשר דבר ה' נעשה: (עוד בפסוק הזה כבר נדפס בחלק א' ):",
            "explanation": "ביאור העניין הוא שהקדושה והישועה של ישראל נובעות מכוח האבות הקדושים, אשר תפילותיהם וזכויותיהם עומדות לנו ולבנינו בכל הדורות, וכך כל הגאולה והישועה באות מהם לבני בניהם, כפי שנאמר \"וזוכר חסדי אבות ומביא גואל לבני בניהם\"."
        },
        {
            "source": "Tiferet Shlomo, Torah, Eikev 11",
            "relevant_sentences": "\"הרמז בזה הוא על הגאולה וירושת הארץ לעולם בביאת משיחנו ב\\\"ב שהוא אך לקיים את הדבר אשר נשבע לאבותינו שהם הצטערו והתפללו על אורך גלות ישראל וגלות השכינה.\"",
            "passage": "לא בצדקתך וביושר לבבך אתה בא לרשת כו' ולמען הקים את הדבר אשר נשבע ה' לאבותיכם לאברהם ליצחק וליעקב . הנ\\\"ל לבאר דהנה מצינו בהפטרה של פרשה הזאת. הביטו אל אברהם אביכם ואל שרה תחוללכם כי אחד קראתיו וכו' כי נחם ה' ציון נחם כל חורבותי' כו'. יש לדקדק מה ענין הסמיכה זה לזה פתח בשבחו של א\\\"א ע\\\"ה ומסיים בנחמת ציון. אולם כבר בארנו במ\\\"א פי' הגמ' כל המתאבל על ירושלים זוכה ורואה בשמחתה. הפי' הוא שזוכה מיד לראות בעוה\\\"ז הנחמות של עתיד שע\\\"י שהצדיק מצטער ומתאבל על חורבן ירושלים הוא מעורר הגאולה לכן מראים לו תיכף הנחמות העתידים כמו שראה ישעי' הנביא כל הישועות העתידי' וז\\\"ש עולמך תראה בחייך. וז\\\"ש עמו אנכי בצרה אחלצהו ואכבדהו. פי' מי שהוא מצטער על גלות השכינה ומשתתף עמה בצרה שזהו עמו אנכי בצרה. לצדיק כזה אחלצהו ואכבדהו אורך ימים אשביעהו ואראהו בישועתי. פי' מיד אראהו בישועה העתידה. וכן מצינו אצל נח זה ינחמנו כאשר בארנו במ\\\"א באריכות. והנה זה שהי' אצל א\\\"א ע\\\"ה שהי' מצטער מאד על זה שראה כולם עובדי ע\\\"ג ואין מזכיר שם כבודו ית\\\"ש בעולם כולם עוברי רצונו והשכינה בגלות ביניהם. לכך אמר לו הש\\\"י ב\\\"ה לך לך מארצך כו' אל הארץ אשר אראך. פי' אראך הישועות והנחמות העתידים כי אז יהי' ה' למלך על כל הארץ. והאלילים כרות יכרתון. ונשגב ה' לבדו ביום ההוא. וזהו אשר אראך. לכך בנה שם מזבח לה' על שראה הישועה הזאת. והנה כן הראה הש\\\"י כל זה לכל האבות הקדושים אשר מעולם דור ודור ודורשיו דור ודור ושופטיו עד היום האחרון של ביאת המשיח. והם נצטערו מאד על גלות השכינה ואורך הגלות והתפללו ע\\\"ז לכך הראה להם הש\\\"י שוב הישועות ונחמות של הגאולה כנ\\\"ל. וזש\\\"נ והי' עקב תשמעון את המשפטים האלה. והי' לשון שמחה עקב הוא סוף ואמה\\\"כ השמחה שיהי' לבסוף באחרית הימים בהגאולה תשמעון עתה בהגלות את המשפטים האלה עם המשפטים והיסורין שיש לכם בהצער של גלות השכינה תזכו עי\\\"ז לשמוע מיד שמחות והישועות העתידין כנ\\\"ל. הנה ע\\\"ז שאמה\\\"כ הביעו אל אברהם אביכם כו\\\" כי אחד קראתיו כשהי' הוא אחד עובד ה' בעולם קראתיו ואברכהו וארבהו כי הוא הי' מצטער מאד על גלות השכינה בעולם שלא היו עובדי השם לכן גרם לעורר הגאולה העתידה כי נחם ה' ציון ניחם כל חורבותי' כמ\\\"ש. והנה זה שאמה\\\"כ לא בצדקתך וביושר לבבך אתה בא לרשת את ארצם. הרמז בזה הוא על הגאולה וירושת הארץ לעולם בביאת משיחנו ב\\\"ב שהוא אך לקיים את הדבר אשר נשבע לאבותינו שהם הצטערו והתפללו על אורך גלות ישראל וגלות השכינה. ולכך הם גרמו להביא אותנו אל הארץ בביאת משיחנו במהרה. והוא שסדרו אנשי כנה\\\"ג וזוכר חסדי אבות ומביא גואל לבני בניהם בא\\\"י מגן אברהם כי א\\\"א ע\\\"ה גרם בחסדו להביא הגואל. וברכת מחי' מתים הוא נגד יצחק שבזכות יצחק יהי' תחיית המתים לעתיד. וברכת אתה קדוש הוא נגד יעקב אבינו שבזכות יעקב יהי' סוף ותכלית הכל הוא אחר הגאולה להודות ולהלל לשמו הגדול כל הימים וזהו וקדושים בכל יום יהללוך סלה שזה מוסב לעתיד כנ\\\"ל. וז\\\"ש יהי' כבוד ה' לעולם ישמח ה' במעשיו. הנה מעשיו הם הצדיקי' כמ\\\"ש ועמך כולם צדיקים וכו' כו' מעשי ידי להתפאר ואמה\\\"כ במה שיהי' כבוד ה' לעולם בהגאולה בזה ישמח ה' משמח את הצדיקי' שהם מעשיו כנ\\\"ל שהוא מראה להם עתה הגאולה העתידה וזהו אשר נשבע לאבותיך לשון שובע שמחות שהשביעם בנחמות העתידין להיות לישראל בב\\\"א:",
            "explanation": "ביאור העניין הוא שהגאולה וירושת הארץ בביאת משיחנו תלויות בתפילותיהם וצערם של האבות הקדושים על גלות ישראל והשכינה, ובזכותם אנו זוכים לקיום ההבטחה האלוקית, כפי שנאמר \"הרמז בזה הוא על הגאולה וירושת הארץ לעולם בביאת משיחנו ב\\\"ב שהוא אך לקיים את הדבר אשר נשבע לאבותינו שהם הצטערו והתפללו על אורך גלות ישראל וגלות השכינה.\""
        },
        {
            "source": "Tiferet Shlomo, Festivals, Shaar Tefillah 23",
            "relevant_sentences": "אין משפטים ישירים",
            "passage": "הודו לד' כי טוב כי לעולם חסדו. הנה עיקר ההודאה והשבח הוא בשביל כללות ישראל. כי אם האדם נותן הודאה על עצמו. חוץ דהוא גריעות בנפש שאינו שמח בישועת בנ\\י אך הוא ג\\\"כ גרעון בהודאה עצמה. למשל בשנה זו שהקב\\\"ה נתן מטר על הארץ והארץ נתנה יבולה. אם האדם יתן הודאה על עצמו לבד אין ההודאה גדולה כל כך אך אם האדם נותן הודאה על כל העולם שריחם על נפשות האומללים והרעבים אזי נותן האדם הודאה עצומה. ובפרט מי שיש לו קצת עושר אזי בשביל עצמו אינה נחשבת לו כ\\\"כ הטובה הזאת. אבל אם מסתכל על כל העולם כולו אזי רואה גודל החסד שעשה הקב\\\"ה בשנה זאת. וז\\\"פ הכ' הודו לד' כי טוב כי לעולם חסדו. לא תהללו בשביל עצמיכם רק כל אחד יהלל לד' עבור כל העולם שנעשה עמהם חסד. וז\\\"פ הכ' גם את העולם נתן בלבם. כדי להודות ולהלל להקב\\\"ה על כל הטובות ולהתפלל עליהם. וז\\\"פ הכ' ופדויי ד' ישובון ובאו ציון ברנה ושמחת עולם על ראשם שהשמחה לא תהי' על כל אחד לעצמו רק כ\\\"א יהי' שמח בשמחת חבירו ובשמחת כל העולם. ובזה תגדל השמחה על כל העולם ועל הצדיקים עד מאד. ובזה יהי' ששון ושמחה ישיגו. אך לזה צריך להיות לו טהרת הנשמה והנפש לקיים ואהבת לרעך כמוך. וז\\\"פ בידיד נפש כו' בהראות לה נועם זיווך אז תתחזק ותתרפא והיתה לה שמחת עולם. עיקר הרפואה הוא לאדם אם יש לו שמחת עולם מכלל ישראל לראות בישועתם וגדולתם. וכבר אמרתי לפרש בזה דברי הש\\\"ס גדול העונה אמן יותר מן המברך כו' מה טעם לזה. אך הפי' בזה דמצינו תפלות בלשון יחיד דהיינו ברכת השחר שלא עשני עכו\\\"ם וכן כל הברכות כולם הולכים כל אחד ואחד לעצמו. פוקח עורים מלביש ערומים כמבואר במס' ברכות א\\\"כ אם אדם עונה אמן על ברכת חבירו ונותן הודאה לשמים על שחבירו נברא יהודי ורואה בעינים ויש לו מלבושים ושאר ענינים אזי גדול העונה אמן יותר מן המברך. כי זה מברך על עצמו וזה מברך על חבירו. וזה הי' מעלת יתרו ששמח על הטובה אשר עשה ד' לישראל. ויאמר ברוך ד' אשר הציל אתכם מיד מצרים שהוא לא הי' במצרים בכלל השיעבוד ונתן הודאה על ישראל. וזה כוונת המד\\\"ר שזהו הי' גנאי לישראל שלא ברכו להקב\\\"ה עד שבא יתרו ונתן הודאה. והרי ישראל אמרו שירה מקודם. אך הם נתנו הודאה על עצמם וזה אין כל כך חשיבות. אבל יתרו נתן הודאה על אחרים והוא דבר גדול ודו\\\"ק. וז\\\"פ רבים אומרים לנפשי מי יראנו טוב נסה עלינו אור פניך כו' היינו שהם מבקשים עבור עצמם. אבל אני איני כן. נתת שמחה בלבי מעת דגנם ותירושם רבו. וז\\\"פ צדקתך לא כסיתי בתוך לבי היינו בעת שהתפללתי והי' עת רצון לא המשכתי את הישועה לעצמי רק נחלק בשוה עם כל העולם. וזהו לא כחדתי חסדך ואמתך לקהל רב ובזה אתה ד' לא תכלא רחמיך ממני. היינו כל המבקש על חבירו והוא צריך לאותו דבר הוא נענה תחלה דהיינו אם אחד יש לו פרנסה ממסחר התבואה ומתפלל על הגשמים ובשעת הזול אין לו פרנסה. וז\\\"פ והוא צריך לאותו הדבר שיהי' ח\\\"ו יוקר. אז הוא נענה תחלה. כי לא על הלחם לבדו יחי' האדם כו'. וז\\\"פ בגמ' תבוא מארה למי שאשתו ובניו מברכים לו. למה דוקא ברכת המזון. אך הפי' שהוא נותן הודאה רק על מה שאשתו ובניו יש להם פרנסתם. רק ההודאה צריך להיות על כלל העולם. וז\\\"פ הגמ' אצל בועז דכתי' וייטב לבו שהי' מברך ברכת המזון. פי' בשעה שהי' בגורן וראה הברכה בתבואות הי' מברך להקב\\\"ה על הכלל ישראל. וז\\\"פ כי פקד ד' את עמו לתת להם לחם. להם דייקא. משום הכי כתי' כי שמעה. הא כולם שמעו. אלא פי' שמעה לשון שמחה מכלל ישראל ולא השגיחה על עצמה כלל. וז\\\"ש בישעי' ס\\\"ג חסדי ד' אזכיר כעל כל אשר גמלנו ד' ורב טוב לבית ישראל אשר גמלם כרחמיו וכרוב חסדיו ודו\\\"ק. וז\\\"פ הפ' כהניה בעיר גוועו כי בקשו אוכל למו וישיבו את נפשם היינו שהפרנסה אשר בקשו לא הי' רק עבור עצמם. וכן תשובה עבור עצמם. לפי שגם התשובה וכפרת עוונות צריך האדם להתפלל עבור כלל ישראל. וז\\\"פ על זאת יתפלל כל חסיד אליך לעת מצוא רק לשטף מים רבים אליו לא יגיעו. מים הם החסדים. והוא מתפלל רק עבור כלל ישראל לטובתם. אפי' אם הוא אינו נהנה כלל מן החסדים. וזה כל העולם ניזון בשביל חנינא בני כו'. וזהו נפתלי אילה שלוחה הנותן אמרי שפר. אילה היא החסידה שבחיות. והתפלה הזאת בוקעת כל הרקיעים. וז\\\"ש אם שגורה תפלתי בפי. היינו שהוא מתפלל עבור הכלל. התפלה זאת מקובלת ברצון. וז\\\"ש בש\\\"ס אין הקב\\\"ה מואס בתפלתם של רבים שנאמר הן אל כביר לא ימאס. ואמאי אין נשמע עדיין. אך הפי' אם כל אחד מתפלל על חבירו וצרכי רבים אזי תפלתו נשמעת. ובזה י\\\"ל העוסק בתורה ובגמ\\\"ח ומתפלל עם הצבור מעלה אני עליו כאלו פדאני לי ולבני מן הגלות. ג\\\"כ הפי' כן בכל מה שעוסק בתורה הוא עושה עם הצבור דהתורה מגינה ומציל כוונתו בלימודו שכל הצבור יהיו ניצולים מעבירות שבידם. ובגמילות חסדים כוונתו עם הצבור שהשכר של גמ\\\"ח יהי' ג\\\"כ עם הצבור. וכן מתפלל עם הצבור לטובת כלל ישראל",
            "explanation": "ביאור העניין הוא שהתפילות וההודאות של אבותינו היו תמיד עבור כלל ישראל ולא עבור עצמם בלבד, ולכן בזכות תפילותיהם אנו קיימים בעולם הזה, שכן תפילה עבור הכלל יש לה כוח רב יותר והיא מתקבלת ברצון לפני הקב\"ה."
        },
        {
            "source": "Tiferet Shlomo, Torah, Noach 12",
            "relevant_sentences": "\"והטעם הוא כי הצדיקים מקיימין את העולם כי הם מעוררים רחמים וחסדים תמיד ולבטל כל הגזירות קשות ובזה הוא שותף במע\\\"ב.\"",
            "passage": "ויבא נח ואשתו וכו'. ופרש\\\"י אף נח מקטני אמנה היה כו'. לכאורה יפלא לומר כן כאשר מ\\\"מ דבר ה' עמו פעם בפעם ואיך יהיה מקטני אמנה. אך הנה נודע כי שגגה גדולה היתה לו שלא התפלל על הדור אולי הועיל להציל אותם משחת והחסרון היה לו שהיה בדעתו שהוא קטן בעיני הש\\\"י ולא עלה על לבו שיהיה הקב\\\"ה חפץ בתפלתו ולא האמין זאת שהש\\\"י ישמע אליו ויעתר לו אחרי שכבר נגזרה הגזירה. אבל חשב בלבבו שזה יהיה נגד רצון הש\\\"י לבטל גזירתו. והאמת הוא להיפך כי זה חפץ ה' וזהו רצונו שיהיה הצדיק מבטל כל הגזירות וכמו שעמד א\\\"א ע\\\"ה ואמר חלילה לך מעשות כדבר הזה. וכן משה רבינו אמר למה יאמרו מצרים. וכן הוא המדה מתחלת בריאת העולם כמאמרם ז\\\"ל בתתלה עלה במחשבה לבראו במדה\\\"ד וכו' ושתפו מדה\\\"ר למה\\\"ד. הכוונה בזה ע\\\"ד שאמרו כי הצדיק נקרא שותף במע\\\"ב כמו הדן דין אמת לאמיתו כאלו נעשה שותף וכיוצא בזה. והטעם הוא כי הצדיקים מקיימין את העולם כי הם מעוררים רחמים וחסדים תמיד ולבטל כל הגזירות קשות ובזה הוא שותף במע\\\"ב. וזה היה כוונת הבריאה מתחלה כאשר בכל מע\\\"ב לא נזכר רק שם אלהים רק אחר שנאמר בהברא\\\"ם אותיות באברהם מיד נאמר ביום עשות ה' אלהים מדה\\\"ר עמו כי כן על הצדיקים שם הוי' על פניהם תמיד כמ\\\"ש וראו כל בשר יחדיו כי ה' נק' עליך. וז\\\"ש שתפו מדה\\\"ר הם הצדיקים העומדים בפרץ להשיב חמתו מהשחית העולם. וז\\\"פ נח מקטני אמנה היה ולא האמין בעצמו כי יועיל בתפלתו. ובמד\\\"ר איתא נח מחוסר אמנה היה כי אמונה שלימה הוא אמן ו\\\"ה יחוד הוי' אדנ\\\"י ו\\\"ה מראש ועד סוף כי וא\\\"ו רומז לצדיק כמו יעקב ויוסף תרין ווין בווין תתקטר וכן הוא אומר באברהם והאמין בה' ויחשבה לו צדקה והאמין אמן ו\\\"ה הוא אמונה שלימה אבל נח היה מחוסר אמנה חסר וא\\\"ו מן האמונה. לכן כתיב את האלהים התהלך נח עמו יחד כמובן. אבל באברהם כתיב התהלך לפני להיות בבחי' ותגזר אומר ויקם. והבן:",
            "explanation": "ביאור העניין הוא שהצדיקים, בתפילתם ובמעשיהם, מעוררים רחמים וחסדים ומבטלים גזירות קשות, ובכך מקיימים את העולם, ולכן קיומנו בעולם הזה הוא בזכות תפילותיהם של אבותינו הצדיקים שהיו שותפים במעשה בראשית."
        },
        {
            "source": "Tiferet Shlomo, Festivals, Shaar Keriat Shema 29",
            "relevant_sentences": "אין משפטים ישירים",
            "passage": "מכלכל חיים בחסד מחי' מתים ברחמים רבים. הנ\\\"ל לפרש דהנה אמנם גם הצדיקים שכבר מתו ונסתלקו לעולם העליון הנה גם שמה עיקר חיותם ושפעם בא ע\\\"י התעוררת התחתונים מה שבעולם הזה מסגלים על ידיהם תורה ומצות ע\\\"י קדושתם שהשאירו אחריהם בעולם הזה. והנה ע\\\"י מעשי התחתוני' בעולם הזה ממשיכין שפע וחיות האלקות לנשמות הקדושות אשר בג\\\"ע. וז\\\"ש עזרת אבותינו אתה הוא מעולם פי' עזרת אבותינו בג\\\"ע העליון אתה הוא מעולם הזה להריק להם שפע. אך עי\\\"כ אח\\\"כ מגן ומושיע לבניהם אחריהם בכל דור ודור כי כל ההשפעות טובות עוברות ע\\\"י האבות כמ\\\"ש בעבור אבותינו שבטחו בך לשון העברה ע\\\"י האבות הקדושים כנ\\\"ל. וז\\\"פ מכלכל חיים בחסד עי\\\"ז מחי' מתים שיש להם נחת רוח וחיות בג\\\"ע כשישראל הם בטובה. וזה ע\\\"י המצות ומעש\\\"ט הוא מחי' מתים וכו' וסומך נופלים וכו' ומקיים אמונתו לישיני עפר כי יש מעלה נפלאה וסוד עמוק בענין מיתת הצדיקים שחוזרים לעפרם הוא כדי שיהיו נקשרים עוד בעולם הזה שהוא לטובתם ולטובת בנ\\\"י בכלל. וזהו ומקיים אמונתו לישיני עפר כי לכך נשארו בעולם הזה כדי להתוסף להם חיות ע\\\"י המעש\\\"ט של התחתונים כמ\\\"ש חכז\\\"ל שפתותיו דובבות בקבר וכמו שעשו הקדושים מעולם ע\\\"י יחודם בנשמות הקדושים הצדיקים בהתדבקות רוחא ברוחא שיהי' עי\\\"ז טוב להם בג\\\"ע ולישראל ג\\\"כ בעולם הזה. וזה מלך ממית ומחי' ומצמיח ישועה ע\\\"י מעשה התחתוני' הטוב והישר כנ\\\"ל:",
            "explanation": "ביאור העניין הוא שהקיום שלנו בעולם הזה תלוי בזכות תפילות ומעשי האבות הקדושים, שכן מעשיהם ותפילותיהם ממשיכים להשפיע שפע וחיות לנשמותיהם בג\"ע, ובכך הם מגינים ומושיעים לבניהם בכל דור ודור, כמבואר בדברי התפארת שלמה על הקשר בין מעשי התחתונים לחיות האלקות לנשמות הצדיקים."
        },
        {
            "source": "Tiferet Shlomo, Festivals, Shaar Keriat Shema 11",
            "relevant_sentences": "\"אולם יש עוד בחי' גבוה' מזו כי הצדיק העושה המצוה לא לבד שמתעורר כל מעשי עצמו כנ\\\"ל. כי גם מעורר עמו מעשי אבותיו והם עצמם באים עמו לסייעו בסוד העבור כידוע וזה הבא לטהר מסייעין אותו וזה מתי יגיעו מעשי למעשי אבותי לעוררם כנ\\\"ל.\"",
            "passage": "והיו הדברים האלה כו' על לבבך ושננתם לבניך ודברת בם וקשרתם לאות על ידך וכו' וכתבתם על מזוזות ביתך ובשעריך. הנה כאשר נשים לב להתבונן על סדר ענין הפרשה הזאת. הנה מנה הכתוב בזה סדר קיום המצות על ארבעה פנים. א' לקיים הדברים בלב. ב' לקיימם בדבור בפה. ג' לקשרם עליו בבחי' לבוש של תפילין. ד' לכתבם על מזוזות הבית משכן לו. הנראה לרמז בזה עפ\\\"י המבואר בע\\\"ח כי אצילות הנאצל הזה של האדם בכללו עם כל הצריך לקיומו הוא בציור דוגמת ד' בחי' אורות העליונים ובמצב ד' בחי' עולמות אבי\\\"ע שהם ד' אותיות הוי' ב\\\"ה. כי כן הפנימיות של האדם יש בו ד' בחי' נר\\\"נ ונשמה לנשמה. והאדם עצמו יש בו ד' בחינות. א' הנשמה אשר באפו. ב' הוא הגוף על הנשמה. ג' הלבושים על הגוף. ד' הבית שיושב בו היכל לכולם ע\\\"ש והבן. ועתה כאשר תבנית האדם בתחתונים הוא על מצב ארבע בחינות העליונים. הנה לכך גם התורה והמצות שהם עיקר החיות והקיום של האדם והן הנה אורות העליוני' היוצאות מפי הש\\\"י ב\\\"ה. ג\\\"כ ארבע פנים להנה. כדי להחיות ד' בחי' האדם. כמוהם על ארבעת רבעיהם ילכו. והנה זהו הוא סדר ד' בחי' של קיום המצות שבפרשה הזאת. כאשר יקבל עליו עול מלכות שמים בהיחוד של שמע ואהבת הנה נאמר תחלה והיו הדברים האלה על לבבך. כי הלב היא עיקר החיות של האדם בגשמי ודוגמתו ברוחניות הוא ראשית כל פועל או מעשה אשר יעשה האדם והלב הוא תחלת כל מחשבה או התעוררות לאהבה או ליראה ושם משכן כל רצונות טובות של האדם. אך משם יפרד והיה לארבעה ראשים. יש מהן מצות התלויות בלב שגם תכלית קיומם ועבודתם הוא נשאר רק בהלב כמו מצות אהבה ויראה הפנימית ומצות קבלת היחוד של שמע וכדומה. ויש מצות אשר יוצאות מן הלב להתגלות מעט על תנועת האיברים כמו מצות תלמוד תורה של ודברת בם וכדומה שהם מפעלות הגוף. ויש מצות אשר יוצאות להתגלות יותר על האדם ללבוש בהם כמו מצות וקשרתם לאות על ידך ומצות ציצית וכדומה. ויש מצות אשר יוצאות להתגלות יותר נגלה בקיומם כמו וכתבתם על מזוזות ביתך ובשעריך. והוא הדבר אשר דברנו כי קיום המצות בתחתונים הם מיוסדים על ארבעה פנים של האורות העליונים שהם עיקר החיות וקיום של האדם כנ\\\"ל. אמנם עוד צריך לדעת כי אף אם כל המצות הם יוצאים מן מחשבת הלב לפועל הנה גם אחרי צאתם עוד רושם הקדושה של התעוררות המצוה לעשותה נשאר תמיד במקורו בהלב ששם הוא אור היוצא בתחלה ממנו אל האיברים להתגלות הפעולה. ובכן כל ענין המצוה אשר יעשה האדם בגופו ותנועת אבריו בפועל. או גם במקום אשר יבחר האדם לעשות בו איזה מצוה. הנה תמיד יהי' נשאר רושם הקדושה של המצוה שעשה על אבר שעשה בו המצוה ועל המקום הנעשה בו כי בעשיית המצוה נעשה האבר הפועל והמקום הנפעל בו מרכבה להקדושה ולא תסור ממנה לעולם. הלא כבר אמרו חכז\\\"ל בגמ' בענין עבירות עוונותיו חקוקים על עצמותיו וקורות ביתו מעידים עליו וכדומה. עאכ\\\"ו במדה טובה שהיא מרובה וכמבואר זה ליודעים. וכן הוא מפורש בזוהר הקדוש פ' פנחס (דף ר\\\"כ ע\\\"א) וז\\\"ל. דתנינן דכל אתר דצדיקיא אתחדש בי' מילי דאוריי' כד איהי בהאי עלמא פקיד להאי אתר ואתי לי' לגבייהו וכש\\\"כ כד שריאן בגוויה צדיקיא אחרינן לחדתא בההוא אתר דאמרין מילא דאורייתא וכו' ע\\\"ש. וכן בקדושת אבר העושה מצוה כבר נודע כי הוא כלי שרת קודש לד'. אך בהלב שם משכן מקור הקדושה של כל האיברים כי כל המצות יוצאות ממחשבת הלב וממנו תוצאות חיים לכולם כי הכוונה היא נשמה אל המעשה ואחר כוונת הלב מן הדברים. נמצא כי בלב הוא התחלת כל המצות אף של מצות מעשיות והלב עם כל המצות תמיד נשמה להחיותם כנ\\\"ל. הנה לכך אמרו חכז\\\"ל דברים היוצאים מן הלב נכנסים אל הלב כי אחרי כי בלב שם צרורות המצות כולם כאחד הנה בהנשא המצוה האחת ינשאו לעומתם גם האחרים וישלימו ויסייעו להדבור לצאת בקדושה כי כן כל המצות מחוברים כאחד כמו הרמ\\\"ח איברים של האדם. וזהו שנאמר כאן והיו הדברים האלה על לבבך ואח\\\"כ ושננתם לבניך כמ\\\"ש בכל המצות כתבם על לוח לבך ואח\\\"כ ושננתם לבניך ודברת בם כי כן כאשר ילמוד האב לבנו יתכוון להכניס בקרבו את כל מחשבות לבו להבינהו לנכון. וזהו הציווי של ושננתם לבניך אחרי והיו הדברים האלה על לבבך ר\\\"ל ללמוד לבנו הוא תלמידו בקדושה ולהכניס בקרבו דברים היוצאים מן הלב אוצר הקדושה כנ\\\"ל. וזהו שנאמר אלה הדברים אשר דבר משה וכו' ככל אשר צוה ד' אותו אליהם. פי' כי אלה הדברים אשר דבר משה אל ישראל הי' בכל לבו שיצאו הדברים מאוצר הקדושה של לבו של משה רבינו עליו השלום כי אחר כוונת הלב הן הדברים. וזהו ככל אשר צוה ד' אותו אליהם ולא השאיר לעצמו דבר כי זהו הי' שבח רעיא מהימנא שהי' רק כמו צנור המשפיע לישראל. נחזור לענינינו. הנה גם בכל פעולה מעשיות אשר יעשה האדם איזה מצוה בכוונה. הנה נשאר הקדושה במקום הזה לעולם. הנה זה שנאמר מיד בפ' הזאת וקשרתם לאות כי בהמצות הנחת תפילין בכוונת הלב יתעורר עם המצוה הזאת בפעם ההיא כל המצות שעשה מימיו שנשאר רושם קדושתם במקום ההוא מכבר כנ\\\"ל. וזהו ודברת בם בשבתך בביתך ובלכתך בדרך כו'. פי' שיהיו המצות הולכים תמיד עמך בכל מקום וכו'. וזה שאמרו חכז\\\"ל בגמ' וראו כל עמי הארץ כי שם ד' נקרא עליך אלו תפילין שבראש. ר\\\"ל כי ע\\\"י התפילין מתעוררין גם כל המצות עמה שעשה כבר וזה שאנו אומרים ותרי\\\"ג מצות התלוים בה. וזה שאנו אומרי' בכל מצוה אשר קדשנו במצותיו לשון רבים כי ע\\\"י מצוה אחת מעורר עמה מצות רבות שעשה. וזהו מצוה גוררת מצוה. וז\\\"ש נאמנים כל פקודיו סמוכים לעד לעולם עשוים באמת וישר. הנה פי' נאמן הוא הנותן לזולתו. וזהו הפי' הפקודים הם המצות עצמם נאמנים ועומדים עם האדם להתעורר כשיעשה איזה מצוה מחדש יתעוררו עמו לסייעו. וזהו סמוכים לעד לעולם. פי' הם סמוכים מיד להאדם לעוזרו לעתיד לעשות המצות באמת וישר. וזהו את משפטי תעשו ואת חוקותי תשמרו ללכת בהם. פי' ללכת בהם לעשות עוד מצות רבות. וזהו מיד ושמרתם את משפטי כו' כי ע\\\"י ללכת בהם ושמרתם וכו' כי המצות הולכים תמיד עם האדם והם המסייעים לו לעשות עוד. וזהו אם בחקותי תלכו. פי' לעשות עוד מצות עמהם. וזהו וזכרתם את כל מצותי לשון זכרות והשפעה לעתיד לעשות כנ\\\"ל והבן. אולם יש עוד בחי' גבוה' מזו כי הצדיק העושה המצוה לא לבד שמתעורר כל מעשי עצמו כנ\\\"ל. כי גם מעורר עמו מעשי אבותיו והם עצמם באים עמו לסייעו בסוד העבור כידוע וזה הבא לטהר מסייעין אותו וזה מתי יגיעו מעשי למעשי אבותי לעוררם כנ\\\"ל. אמנם גדול מזה הי' כח אבותינו הקדושים שבכח מצותיהם שעשו היו משפיעים קדושה לבניהם אחריהם לעשות בקדושה כמוהם. וזהו כי ידעתיו למען אשר יצוה את בניו ושמרו וכו' וזהו אצל העקידה אנו אומרים וזכר לנו אהבת הקדמוני' פי' להשפיע לנו מאהבת הקדמונים. והבן:",
            "explanation": "ביאור העניין הוא שבכח מעשי הצדיקים, לא רק שהם מעוררים את מעשיהם עצמם, אלא גם מעוררים את מעשי אבותיהם הקדושים, והם באים לסייעם, ובכך מתקיימת השפעת תפילות האבות על קיום הדורות הבאים, כפי שנאמר \"מתי יגיעו מעשי למעשי אבותי לעוררם\"."
        },
        {
            "source": "Tiferet Shlomo, Torah, Lech Lecha 16",
            "relevant_sentences": "אין משפטים ישירים",
            "passage": "דורשי ה' זרע אברהם אוהבו. הנ\\\"ל דהנה כל עיקר הכח של העבדות בנ\\\"י במצות ומעש\\\"ט באה להם מן האבות הקדושים אשר הם בעבודתם הגדולה ישרו לנו בערבה מסלה לאלהינו וע\\\"י קדושתם הנחילו לבניהם אחריהם קדושה לעתיד להיותם עובדים הש\\\"י באהבה ויראה באמת ותמים. ולולי הם לא היינו יכולים לעשות דבר ולא זכינו לכל הגדולה והמעלה של התורה הזאת. והוא שאמה\\\"כ רק באבותיך חשק ה' לאהבה אותם ויבחר בזרעם אחריהם בכם מכל העמים. ר\\\"ל כי גם ענין הבחירה הזאת אשר בחר בנו מכל העמים ונתן לנו את תורתו גם היא מורשה לנו מכח אהבת אבותינו הקדושים ורק בזכותם בחר בנו מכל העמים ועל ידיהם נתן לנו התורה הזאת. וכן הוא אומר ותחת כי אהב את אבותיך ויבחר בזרעו אחריו. ולכך אנו מבקשים וזכר לנו ה' אלהינו אהבת הקדמונים פי' להשפיע לנו אהבת הקדמונים אשר הטביעו בנו לאהוב את ה' ית\\\"ש למען נשלים כוונתינו אליו. וז\\\"ש ה' אלהי ישראל אהבת תמים ה' אלהי ישראל תשועת עולמים \\\"ה' אלה\\\"י ישרא\\\"ל גימט' תרי\\\"ג ר\\\"ל כל התרי\\\"ג מצות הם באו לנו ע\\\"י אהבת תמים פי' אהבת א\\\"א שנאמר בו התהלך לפני והיה תמים וע\\\"י כן הוא תשועת עולמים. הנה כי כן מהראוי לנו להחזיק טובה לאבותינו הקדושים שאלמלא הם לא היינו נחשבים כלל לכן בכל הברכות אנו אומרים אלהינו ואלהי אבותינו ר\\\"ל מה שהוא עתה אלהינו הוא ע\\\"י שהיה אלהי אבותינו תחלה. וזה האמור כאן דורשי ה' זרע אברהם אוהבו. ר\\\"ל אלה דורשי ה' הם באים רק מכח כי הם זרע אברהם אוהבו והוא אשר הנחיל אהבתו להם כל הימים כמ\\\"ש כי ידעתיו למען אשר יצוה את בניו ואת ביתו אחריו ושמרו דרך ה' כו':",
            "explanation": "ביאור העניין הוא שהכח והזכות לעבודת ה' ולתורה שבידינו הם בזכות האבות הקדושים, אשר בעבודתם וקדושתם הנחילו לנו את היכולת והזכות להיות נבחרים מכל העמים, ולכן אנו מזכירים תמיד את אבותינו בתפילותינו כהודאה על זכותם."
        }
    ]
}