{
    "question_id": "062b5f01-d3e3-413d-a166-e110e2a2f782",
    "question": "in which scenario can it appear as if a person is lying in his prayers?",
    "selected_passages": [
        {
            "section": "Torah",
            "topic": "Toldot",
            "number": "9",
            "passage": "ויתרוצצו הבנים בקרבה ותאמר אם כן למה זה אנכי כו'. ופרש\\\"י עוברת על פתחי תורה יעקב מפרכס לצאת. עוברת על פתחי ע\\\"ג עשו מפרכס לצאת. הנה בפ' זו מורה לנו התורה הקדושה דרך הישרה לעבודת הבורא ב\\\"ה שיהיה באמת ובתמים ולא יהיה דרכו דרך הפכפך וזר עד ארגיעה לשון שקר. כאשר נמצא רבים מעמי הארץ כי בשעה שעוסק בתורה ותפלה לבבו כלפיד יבער. וכאשר התעיף בו ואיננו כי אחר התפלה תיכף הולך בשרירות לבו חומד ומתאוה. וז\\\"פ הענין וירא אלהים את האור כי טוב כו' ודרשו חז\\\"ל שאיננו ראוי שישתמשו האור והחשך בערבוביא כו'. לכאורה אין להבין איך שייך לומר אור והחשך יחד בערבוביא תרתי דסתרי אהדדי. אך הרמז בזה. כי דרכי התורה ועבודה המה רומזים לאור. ותאוות העולם השפל והנבזה הם דומים לחשך. והאדם צריך לשמור מזה לבל יהי' בערבוביא פוסח על שני הסעיפים פעם הולך בדרכי התורה ופעם פונה לדרכי החשך ח\\\"ו. וכזה פרשנו בפ' צרופה אמרתך מאד ועבדך אהבה. כי זהו הצירוף והבחינה אם התו\\\"מ מביאים את האדם לידי האהבה לבל יסיר מני דרך הישרה. לכן עתה כאשר ראתה רבקה אמנו שהתרוצצו הבנים סברה כי הוא אדם אחד אשר פעם חשקו ללכת לבהמ\\\"ד ופעם חשקו ללכת לפתחי ע\\\"ג כדרך אנשי רשע כאשר יבוא בין הצדיקים יתלוה עמהם לעשות כמעשיהם. וכאשר פונה מהם ופגעו בו אנשים פוחזים וריקים הנה הוא כאחד מהם. לכן ותלך לדרוש את ה' מה יהיה בסופו. כי לא זה הדרך ישכון אור רק כיתד שלא תמוט. לזה כתיב ויאמר ה' לה שני גוים בבטנך. כי באמת הם שנים יעקב ועשו זה פונה לרשעו ותאוותו הרעה. וזה פונה לתומו וצדקתו לעד עומדת בל ימוט לנצח. ובזה יש לרמז מ\\\"ש להלן ויהי אך יצוא יצא יעקב מאת פני יצחק אביו והנה עשו אחיו בא מצידו. לרמז על הנ\\\"ל ויהי לשון צער כאשר נמצא איש הפכפך במעשיו אשר בשעת עשיית המצוה הוא בבחי' יעקב. וכאשר יצא מאת פני יצחק אביו בגמר תפלתו ועבודתו והנה חוזר לסורו נהפך לאיש אחר והנה עשו אחיו בא מצידו. מצידו. כי הסט\\\"א גובר עליו בתאוות עוה\\\"ז. אך צריך האדם להיות חזק ואמיץ כיתד שלא תמוט להשגיח על כל דרכיו בתם וביושר:",
            "english_translation": "And the children struggled within her, and she said if it is so why am I thus, and Rashi explained when she passed by the doors of Torah study Jacob would stir to come out, when she passed by the doors of idol worship Esau would stir to come out, behold in this portion the holy Torah shows us the straight path to serve the Creator blessed be He that it should be in truth and sincerity and one's path should not be fickle and strange until suddenly speaking falsehood, as is found among many common people for in the hour they engage in Torah and prayer their heart burns like a torch, and when you look away it is gone for after prayer they immediately go after their heart's desires lusting and craving, and this explains the matter \"And God saw the light that it was good\" and our sages interpreted that it is not fitting for light and darkness to be used in mixture, at first glance it is incomprehensible how light and darkness could be together in mixture as they contradict each other, but the hint in this is that the ways of Torah and service allude to light, and the desires of this lowly despised world are like darkness, and a person must guard against this so it won't be mixed straddling two branches sometimes going in Torah's ways and sometimes turning to ways of darkness God forbid, and thus we explained the verse \"Your word is very pure and Your servant loves it\" for this is the refinement and test if Torah and commandments bring a person to love so they won't turn from the straight path, therefore now when Rebecca our mother saw the children struggling she thought it was one person who sometimes desired to go to the study hall and sometimes desired to go to doors of idol worship like the way of wicked people when they come among the righteous they join with them to act like them, and when they turn from them and encounter worthless frivolous people behold they are like one of them, therefore she went to inquire of God what would be in the end, for this is not the path where light dwells but rather like an unmovable stake, for this it is written \"And God said to her two nations are in your womb\" for truly they are two Jacob and Esau this one turns to his wickedness and evil desire and this one turns to his integrity and his righteousness stands forever never to be moved, and in this there is a hint to what is written later \"And it happened just as Jacob went out from before Isaac his father and behold Esau his brother came from his hunting\" hinting to the above \"and it happened\" is an expression of distress when there is found a fickle person in their deeds who during performance of a commandment is in the aspect of Jacob, and when he goes out from before Isaac his father upon completing his prayer and service and behold he returns to his ways transformed to another person and behold Esau his brother comes from his hunting, from his hunting because the Other Side overpowers him with worldly desires, but a person must be strong and courageous like an unmovable stake to watch over all his ways in integrity and uprightness.",
            "average_score": 9.0,
            "reference": "Tiferet Shlomo, on Torah, Toldot 9"
        },
        {
            "section": "Festivals",
            "topic": "Shaar Tefillah",
            "number": "12",
            "passage": "ר' אלעזר יהיב פרוטה לעני והדר מצלי. היינו לעורר רחמים בעולם עוד י\\\"ל עפ\\\"י דברי רז\\\"ל מרבה צדקה מרבה שלום. שלום יעשה לי שהנותן צדקה עושה שלום בין הקב\\\"ה להעני. שהעני הולך ומהרהר ח\\\"ו בלבו על הקב\\\"ה לכל הוא נותן פרנסה כו'. ור\\\"א הי' נותן על הכוונה זו. לכן הי' נותן לו בבקר מיד כדי שהעני יהי' יכול להתפלל ולהודות להקב\\\"ה שהזמין לו פרנסתו דאל\\\"כ בשעת התפלה הי' יכול העני ח\\\"ו להיות קורא תגר על הקב\\\"ה. וז\\\"פ ר\\\"א יהיב פרוטה לעני והדר מצלי. היינו העני הי' מתפלל אח\\\"כ: (מכי\\\"ק)",
            "english_translation": "Rabbi Eleazar would give a coin to a poor person and then pray. This is to arouse mercy in the world and also according to the words of our sages, increasing charity increases peace. Peace he will make for me, for one who gives charity makes peace between the Holy One Blessed be He and the poor person. For the poor person goes and contemplates Heaven forbid in his heart about the Holy One Blessed be He that He gives livelihood to all etc. And Rabbi Eleazar would give with this intention. Therefore he would give to him in the morning immediately so that the poor person would be able to pray and thank the Holy One Blessed be He who provided his livelihood, for otherwise during prayer the poor person might Heaven forbid complain against the Holy One Blessed be He. And this is the meaning of Rabbi Eleazar gives a coin to the poor person and then prays, meaning the poor person would pray afterwards.",
            "average_score": 9.0,
            "reference": "Tiferet Shlomo, on Festivals, Shaar Tefillah 12"
        },
        {
            "section": "Festivals",
            "topic": "Shaar Tefillah",
            "number": "17",
            "passage": "תניא בר קפרא אומר וכו' אלו הי' נותן בה קורטב של דבש אין אדם יכול לעמוד מפני ריחה ולמה אין מערבין בה דבש מפני שהתורה אמרה כו'. יש להבין מה יוצא לנו מזה מה שאמר שאם הי' נותן בה דבש לא הי' יכול לעמוד כו' אך שהתורה אמרה כו' הלא אם התורה אסרה מה לנו בכל אלה ומה בא להשמיענו בזה. אך הנראה ללמוד מזה דרך לעבדות הש\\\"י שיהי' להאדם פלס ומאזני משפט בידו לחשוב תמיד הפסד מצוה כנגד שכרה ושכר עבירה כנגד הפסדה. כאשר לפעמים יראה וידמה בנפשו לעשות איזה מצוה או להתפלל בקדושה ובנקיות יותר וישכח כי עי\\\"ז הוא עובר על ד\\\"ת מצד אחר. אף אם כאן כוונתו לטובה ואין אדם יכול לעמוד מפני ריחה. אבל מצד אחר אמרה תורה לא תקטירו ממנה כו':",
            "english_translation": "It was taught that Bar Kapara says etc if one would put a drop of honey in it no person could stand its fragrance and why do we not mix honey in it because the Torah said etc We must understand what we learn from this that he said if one put honey in it one could not stand etc but the Torah said etc if the Torah forbade it what do we need all this for and what does it come to teach us But it appears to learn from this a way to serve God that a person should have scales and balanced judgment in his hands to always consider the loss of a mitzvah against its reward and the reward of a transgression against its loss As sometimes one will see and imagine in his soul to do some mitzvah or pray with greater holiness and purity and forget that through this he transgresses the words of Torah from another side Even if here his intention is for good and no person can stand its fragrance but from another side the Torah said do not burn from it etc",
            "average_score": 9.0,
            "reference": "Tiferet Shlomo, on Festivals, Shaar Tefillah 17"
        },
        {
            "section": "Festivals",
            "topic": "Shemini Atzeret",
            "number": "27",
            "passage": "ה' עוז לעמו יתן ד' יברך את עמו בשלום. ויהיו נא אמרינו לרצון לפני אדון כל. הסמיכות של ב' הפסוקים הללו. נקדים לפרש הפסוק בתהלים. יפיפית מבני אדם הוצק חן בשפתותיך. חגור חרבך על ירך גבור הודך והדרך. עוד נקדים לפרש הפסוק. כל ארחות ד' חסד ואמת לנוצרי בריתו ועדותיו. דהנה ידוע שברית הלשון וברית המעור מכוונים זה כנגד זה כמבואר בספרים הקדושים דאם האדם איננו שומר את הדיבור אז ממילא בא לידי פגם הברית ח\\\"ו כמ\\\"ש בס' ראשית חכמה ובס' תומר דבורה על פסוק אל תתן את פיך לחטיא את בשרך. בשרך היינו הברית קודש כמ\\\"ש ועל בריתך שחתמת בבשרנו ע\\\"ש. ומכ\\\"ש אם ח\\\"ו האדם חוטא בברית פשיטא שאין תפלתו נשמעת ואין תורתו עולה למעלה. ובזה פרשתי המשנה אל תרבה שיחה עם האשה כו' מכאן אמרו המרבה שיחה כו' ובוטל מדברי תורה היינו שמבטלים דברי תורה שלו שלמד ושילמוד הכל הולך לסט\\\"א וכעין שאמרו מדאורייתא בביטול בעלמא סגי ולהוי כעפרא כו' אמרו פ\\\"ה גימט' מיל\\\"ה ובזוהר הקדוש \\\"מי \\\"יעלה \\\"לנו \\\"השמימה ר\\\"ת מילה. דהיינו אם האדם שומר את הברית אז תפלתו עולה השמימה. ובזה פרשתי והי' עקב תשמעון. עקב הוא שמירת הברית כידוע. ושמר ד' אלהיך לך את הברית לא יהי' בך עקר ועקרה ודרשו רז\\\"ל לא תהי' תפלתך עקורה היינו ע\\\"י שמירת הברית לא תהי' תפלתך עקורה ותהי' נשמעת למעלה. ובז\\\"פ נצור לשונך מרע ושפתיך מדבר מרמה. כפל הלשון לשונך ושפתיך. רמוז על שמירת הלשון וברי\\\"ק. וכ\\\"ז שהאדם אינו נשמר משמירת הברית ושמירת הפה אין המצות ומעש\\\"ט שלו הולכים למעלה רק לסט\\\"א ח\\\"ו. ולזה אמר מי האיש החפץ חיים כו' נצור לשונך מרע. ולזה אמר כל ארחות ד' חסד ואמת לנוצרי בריתו ועדותיו. דהיינו שהחסדים הולכים רק לבני ישראל שהם נוצרי בריתו ועדותיו. ונבוא לביאור הפסוקים הללו. יפיפית מבני אדם הוצק חן בשפתותיך. הנה ידוע שלא נכתב לשון חן רק לשומרי בריתו כגון אצל נח כתיב ונח מצא חן בעיני ד'. שכל דורו לא היו שומרים את הברית ונח שמר בריתו. ואצל יוסף כתיב ג\\\"כ לשון חן וימצא חן בעיניו. ויתן חנו בעיני שר בית הסוהר. וזהו חן וכבוד יתן ד' לא ימנע טוב להולכים בתמים. תמים הוא מי ששומר הברית כידוע בזוה\\\"ק. ויעקב איש תם נח צדיק תמים. ולזה יתן להם חן ולא ימנע טוב שיסוד העליון נקרא טוב כידוע. ולזה אמר הוצק חן בשפתותיך. היינו שהתפלות יתקבלו למעלה. וגם מצא חן בעיני ד' וע\\\"ז אמר מהיכן האדם זוכה לזה. חגור חרבך על ירך גבור הודך והדרך היינו שמירת היסוד כמבואר בזוהר הקדוש (פ' וארא דף כ\\\"ו). שפסוק הזה מרמז על שמירת הברית. ולזה אמר ד' עוז לעמו יתן הוא ספירת היסוד כמבואר בכוונת האר\\\"י ז\\\"ל ד' יברך את עמו בשלום. שלום הוא ג\\\"כ יסוד כמ\\\"ש במקום אחר מזה. ולזה אמר ויהיו נא אמרינו לרצון לפני אדון כל. אדון הוא ספירת המלכות כידוע כל הוא ספירת היסו\\\"ד כמבואר בכתבי האר\\\"י ז\\\"ל על ואתה מושל בכל ע\\\"ש. אדו\\\"ן כ\\\"ל הוא יחוד הוי' אדנ\\\"י וק\\\"ל. ולזה אנו אומרים בברכת המזון. במרום ילמדו עליו ועלינו זכות שתהא למשמרת שלום. היינו שמירת הברית הוא יסו\\\"ד ונמצא חן ושכל טוב וכו' שלאחר שמירת היסוד נמצא חן בעיני אלהים ואדם כמו שמצינו ביוסף הצדיק וק\\\"ל: (מכי\\\"ק)",
            "english_translation": "The Lord will give strength to His people, the Lord will bless His people with peace. May our words be pleasing before the Master of all. The connection of these two verses. Let us first explain the verse in Psalms. You are fairer than the sons of men, grace is poured upon your lips. Gird your sword upon your thigh, O mighty one, your glory and your majesty. Let us further explain the verse. All the paths of the Lord are kindness and truth to those who keep His covenant and His testimonies. For it is known that the covenant of the tongue and the covenant of circumcision are aligned with each other as explained in the holy books that if a person does not guard his speech then he will come to damage the covenant heaven forbid as written in Reishit Chochma and Tomer Devorah on the verse do not let your mouth cause your flesh to sin.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Festivals, Shemini Atzeret 27"
        },
        {
            "section": "Torah",
            "topic": "Vaetchanan",
            "number": "20",
            "passage": "רק השמר לך ושמור את נפשך מאד כו' ופן יסור מלבבך כל ימי חייך והודעתם לבניך ולבני בניך כו' יום אשר עמדת כו' אשר ילמדון ליראה אותי כל הימים אשר הם חיים עלהאדמה ואת בניהם ילמדון. הנה לכאורה אין קשור לפסוקים הללו. גם מה שאמר פן יסורו מלבבך והודעתם לבניך. כיון שיסורו מלבבו איך יודיעום לבניהם. ונראה לפרש בדרך צחות על אותן בני אדם שהם עסוקים בהבלי עולם ומטפשין ומסירים מעל לוח לבם מצות השי\\\"ת. גם בעמדם בתפלה שפתותיהם נעות ולבם בל עמהם. ורק את בניהם אשר יוולד להם הם מייסרין אותם ללכת אל בית הספר שלא לבטל רגע אחת רק יעסקו בתורה ותפלה. והוא אינו משים אל לבו מה שהוא ממעט בעבודתו ית\\\"ש ואיך ימלא לבבו להוכיח אחרים בשבט מוסר ובניו מומם ואינו מרגיש מומו הפוסל אותו. וזה שמרמז הכתוב השמר לך כו' ופן יסורו מלבבך. ר\\\"ל אתה בעצמך תסור מלילך בדרכי השם. והודעת' לבניך. היינו שתוכיח רק את בניך שהם ילמדו ועל עצמך לא תשגיח כלל. לא זו הדרך ישכון אור רק אשר ילמדון ליראה כו' שהם עצמם ילמדו מקודם ליראה כו' ואח\\\"כ את בניהם ילמדון:",
            "english_translation": "Only take heed to yourself and guard your soul diligently lest you forget and lest it depart from your heart all the days of your life and make them known to your children and your children's children the day you stood when they will learn to fear me all the days that they live on the earth and teach their children. Behold apparently there is no connection to these verses. Also what he said lest they depart from your heart and make them known to your children. Since they depart from his heart how will they make them known to their children. And it seems to explain humorously about those people who are busy with worldly vanities and become foolish and remove from their heart's tablet the commandments of God. Even when standing in prayer their lips move but their hearts are not with them. And only their children who are born to them they discipline them to go to school not to waste a single moment only to engage in Torah and prayer. And he does not take to heart what he diminishes in his service to God and how can he fill his heart to rebuke others with the rod of discipline while his children have blemishes and he does not feel his own blemish that disqualifies him. And this is what the verse hints take heed to yourself lest they depart from your heart meaning you yourself will turn from walking in God's ways. And make them known to your children meaning you will rebuke only your children that they should learn while on yourself you do not watch at all. This is not the way light dwells but rather they should learn to fear that they themselves should first learn to fear and afterward teach their children.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Torah, Vaetchanan 20"
        },
        {
            "section": "Torah",
            "topic": "Miketz",
            "number": "4",
            "passage": "ויהי מקץ וכו'. פרש\\\"י כל לשון קץ סוף הוא. הנראה לרמז בדבריו הקדושים עפ\\\"י מ\\\"ש בפי' הפיוט קדם רבון עלמין במילין סתימין וכו'. להורות לכל איש בגשתו אל הרנה ואל התפלה על כל מחסורו בעניני עוה\\\"ז אשר יחסר לו לא ישים מגמתו על מצוקותיו רק יהיה עיניו ולבו על גודל צער גלות השכינה כמ\\\"ש בספרים על המשנה באבות דע מה למעלה ממך. פי' מהחסרון שחסר לך למטה תוכל להבין החסרון שנוגע למעלה צער גלות השכינה. וז\\\"ש ושמחתים בבית תפלתי תפלתם לא נאמר אלא תפלתי. פי' שיהיה עיקר תפלתם למען כבודו ית\\\"ש. וזה הרמז בגמ' שנים שנכנסו להתפלל. פי' בשעת התפלה צריך להיות בשני בחי'. מה שנוגע למעלה וגם בצרכי נפשו למטה. לכן במשה רבינו כשהיה מתפלל עבור אחותו כתיב אל נא רפא נא לה. הרמז בזה רפא נא לה' האחרונה בשם הוי' לעשות היחוד למעלה ואז ממילא תתרפא. וז\\\"פ לא על צדקותינו אנחנו מפילים תחנונינו לפניך כי על רחמיך הרבים. וז\\\"ש ואתה ברחמיך הרבים עמדת להם בעת צרתם. פי' שהעמידו נגד עיניהם צער גלות השכינה שהקב\\\"ה כביכול סובל גודל צער בנ\\\"י וכאשר באו למדריגה זו לעורר רחמי שמים אז נצמח להם הישועה רבת את ריבם. העולה מזה כי גם בכל נוסח התפלה שאנו מתפללים בשמ\\\"ע רפאנו ברך עלינו וכדומה הנראי' לעיני בשר כי הם דברים פשוטים הנצרכים בעוה\\\"ז. אמנם הם עומדים ברומו של עולם. וז\\\"פ קדם רבון עלמין במילין סתימין. כי במחשבה היא דברים סתומים לכן עולה לרצון למעלה. וז\\\"ש שועתנו קבל ושמע צעקתנו יודע תעלומות. פי' מה שאנו צועקים על מחסורינו אתה היודע תעלומות לבבנו כי כל כוונתינו על צער גלות השכינה כנ\\\"ל. ונחזור לענין הנ\\\"ל שזה רמז בדברי רש\\\"י במתוק שפתיו. רהי מקץ כל לשון קץ. פי' הצדיק כזה אשר כל לשונו בתפלתו הוא רק על הקץ ומצפה לישועת ה'. סוף הוא. פי' הוא אשר יזכה להיות בסוף ולראות במהרה בישועה ונחמה בבוא הגאולה ב\\\"ב. אמן:",
            "english_translation": "And it came to pass at the end etc. Rashi explains that every expression of 'end' means conclusion. It appears to hint in his holy words according to what is written in the explanation of the poem 'Before the Master of Worlds' with hidden words etc. To instruct every person when approaching prayer and supplication for all his needs in matters of this world that he lacks, he should not focus on his distress but rather have his eyes and heart on the great pain of the Divine Presence in exile as written in the books on the Mishnah in Avot know what is above from you, meaning from the lack that you lack below you can understand the deficiency that affects above the pain of the Divine Presence in exile. And this is what is said 'And I will gladden them in My house of prayer' - it does not say their prayer but rather My prayer, meaning that the main prayer should be for His blessed glory. And this is the hint in the Gemara two who entered to pray, meaning during prayer one needs to be in two aspects - what affects above and also one's personal needs below. Therefore with Moses when he prayed for his sister it is written please heal her please, hinting heal please to the final letter in God's name to create unity above and then automatically she will be healed. And this explains not for our righteousness do we cast our supplications before You but for Your great mercy. And this is what is said and You in Your great mercy stood for them in their time of trouble, meaning they set before their eyes the pain of the Divine Presence in exile that God as it were suffers the great pain of Israel and when they reached this level to arouse heavenly mercy then salvation sprouted for them fighting their fight. Rising from this that also in all the prayer text that we pray in the Amidah heal us bless us and similar which appear to physical eyes as simple things needed in this world, however they stand at the height of the world. And this explains Before the Master of Worlds with hidden words, for in thought they are hidden things therefore they rise favorably above. And this is what is said accept our plea and hear our cry Knower of Hidden Things, meaning what we cry about our needs You who knows hidden things of our hearts for all our intention is about the pain of the Divine Presence in exile as mentioned above. And returning to the above matter this is hinted in Rashi's words with his sweet lips and it came to pass at the end every expression of end, meaning such a righteous person whose every word in prayer is only about the end and anticipates God's salvation. It is the end, meaning he who will merit to be at the end and see quickly salvation and comfort when redemption comes speedily in our days Amen.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Torah, Miketz 4"
        },
        {
            "section": "Torah",
            "topic": "Toldot",
            "number": "24",
            "passage": "ותקח רבקה את בגדי עשו בנה הגדול החמודות כו' ותלבש את יעקב בנה הקטן. הנה בזה מורה לנו הכתוב דרך העבודה להש\\\"י כאשר הקדמנו לעיל בעניני התפלה בגשתו אל הרנה ואל התפלה ולבו יודע מרת נפשו כי המרה את רוחו והלך בדרכי תעתועים בתאוות רעות וירא לנפשו לפתוח פיו. כמ\\\"ש אולי ימושני אבי והייתי בעיניו כמתעתע וכו' אולם העצה הנכונה לזה עפ\\\"י מ\\\"ש בשם הבעש\\\"ט ע\\\"פ מאת כל איש אשר ידבנו לבו תקחו את תרומתי. היינו שכל אדם צריך לשית עצות בנפשו להפוך לעשות מדות טובות מכל אשר ידבנו לבו מהתאוות החיצוניו' ומדות הרעות אשר הרגיל בהם מהם יקח דרך לעבודת הבורא ב\\\"ה באותו חשק ובאותה התאווה ביתר שאת. ובזה פרשתי בפ' ציצית ולא תתורו אחרי לבבכם וכו' אשר אתם זונים אחריהם למען תזכרו ועשיתם כו'. פי' שלא יפול לב האדם בראותו הסתת היצר ח\\\"ו לתאוות רעות ולא יקשה בעיניו למה עשה כן הבורא ב\\\"ה להכניס האדם בעוה\\\"ז בעבודה קשה כזה. כי. באמת הוא לטובת האדם כי ממנו נקח לעבוד הבורא ב\\\"ה באותו חשק ובאותו תאווה. וזה ולא תתורו כו' אשר אתם זונים אחריהם. כי למען תזכרו ועשיתם את כל מצותי. כי ממנו נלמוד לעשות המצות בחשק נמרץ כנ\\\"ל. וזה ג\\\"כ הרמוז כאן ותקח רבקה את בגדי עשו כו' החמודות.הם התאוות והחמדות רעות של עשו כנ\\\"ל. ותלבש את יעקב בנה הקטן. הם הצדיקים שהם קטנים בעיניהם ומורא על ראשם לגשת אל הקודש. והם מלבישים אותו החשק והרצון של תאוות עוה\\\"ז לקחת אותו חשק לעבודת הבורא ב\\\"ה. וז\\\"פ ג\\\"כ ויגנוב יעקב את לב לבן הארמי. כי לבן הי' סבור שיעקב ילמוד ממנו דרכו ומדותיו. אך הוא הי' מהפך אותם לטובה. כנ\\\"ל:",
            "english_translation": "And Rebecca took the garments of Esau her elder son, the precious ones, and clothed Jacob her younger son. Behold, in this the scripture teaches us the way of service to God, as we previously introduced above regarding matters of prayer when approaching supplication and prayer, and his heart knows the bitterness of his soul for he has embittered his spirit and walked in ways of delusion with evil desires and fears for his soul to open his mouth. As it is written \"Perhaps my father will feel me and I will be as a deceiver in his eyes.\" However, the correct advice for this according to what is written in the name of the Baal Shem Tov regarding \"from every man whose heart motivates him you shall take My offering\" - meaning that every person needs to devise strategies in his soul to transform and make good traits from all that his heart motivates him from external desires and evil traits that he has become accustomed to, from these he should take a path to serve the Creator blessed be He with that same desire and that same longing even more strongly. And with this I explained in the portion of tzitzit \"and you shall not follow after your hearts etc. after which you stray, in order that you remember and do etc.\" The explanation is that a person's heart should not fall when seeing the enticement of the evil inclination God forbid to evil desires, and it should not be difficult in his eyes why the Creator blessed be He made it so to place man in this world with such difficult service. For in truth it is for man's benefit because from it we take to serve the Creator blessed be He with that same desire and that same longing. And this is \"and you shall not follow etc. after which you stray, for in order that you remember and do all My commandments.\" For from it we learn to do the commandments with intense desire as mentioned above. And this is also alluded to here \"And Rebecca took the garments of Esau etc. the precious ones\" - these are the evil desires and lusts of Esau as mentioned above. \"And clothed Jacob her younger son\" - these are the righteous who are small in their own eyes and fear is upon their heads to approach the holy. And they clothe that desire and will of worldly desires to take that desire for the service of the Creator blessed be He. And this also explains \"And Jacob stole the heart of Laban the Aramean.\" For Laban thought that Jacob would learn from him his way and his traits, but he was transforming them for good, as mentioned above.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Torah, Toldot 24"
        },
        {
            "section": "Torah",
            "topic": "Pekudei",
            "number": "6",
            "passage": "א\\\"י יה\\\"ר שתשרה שכינה במעש\\\"י. כי הנה מבואר בזוה\\\"ק כי כמה וכמה מקטריגים העומדים לבלבל את האדם ובשעת העבודה ותורה ומצות מביאי' אותו לידי עצבות ומ\\\"ש ומחפים עצמם בכוונה לש\\\"ש לאמר אתה בן אדם למה תכנים א\\\"ע לעבודה הקדוש' הזאת ואתה מלא עוונות ופשעים חלילה הירצה ה' מידך וכהנה רבות בהזכירו עוונותיו רק בשעת תורה ותפלה למען הביאו לעשות המצוה בעצבות בלי שמחה ואז לא פרחית לעילא. אבל לעומת זה אמר דוד המלך ע\\\"ה כל גוים סבבוני הם הקליפות סבוני כדבורים למיץ ולניק מגבול הקדושה ולבלבל אותי עכ\\\"ז בשם ה' כי אמילם כלומר מתפארים בשם ה' בהזכירו עונותיו. אבל כי אמילם ולא אתן את נפשי להם. דחה דחיתני לנפול חלילה בידם וה' עזרני. לא אמות כי אחיה. פי' לא אעשה המצות בעצבות בבחי' מיתה כ\\\"א בחיות ושמחה ואספר מעשי י\\\"ה כי כן הוא עליית המצוה רק בשמחה כמ\\\"ש בשלש רגלים יראה כל זכורך הם המצות לפני ה' אז בשמחה יראו ויעלו להיות לפני ה' . וז\\\"ש דבקתי בעדותיך ה' אל תבישני. ר\\\"ל דבקתי בעדותיך הם המצות בעלותם לפניך דבקתי את נפשי בם להעלותם עמהם אל תבישני ותכניסני עמהם לפניך. וז\\\"ש גם כן כאן יה\\\"ר שתשרה שכינה במעש\\\"י אבל בעצבות אין השכינה שורה. וזהו ויהי נועם כו' ומע\\\"י כוננה עלינו. פי' אתה כונן את מעש\\\"י לשיקבה\\\"ו ואל תדאגו ומעש\\\"י כוננהו כי השכינה תעשה הכל עבורך לה' ותכוננהו:",
            "english_translation": "May it be Your will that Your Divine Presence rest upon my deeds. For behold it is explained in the holy Zohar that there are many accusers who stand to confuse a person, and during the time of service and Torah and commandments they bring him to sadness and depression and cover themselves with intention for the sake of Heaven saying you are a human why enter into this holy service when you are full of sins and transgressions heaven forbid will God desire from your hand and many such things reminding him of his sins only during Torah and prayer in order to cause him to do the commandment in sadness without joy and then it does not ascend above. But against this King David peace be upon him said all nations surrounded me they are the forces of impurity they surrounded me like bees to squeeze and suck from the boundary of holiness and to confuse me nevertheless in God's name I will cut them down meaning they glorify themselves in God's name by mentioning his sins but I will cut them down and not give my soul to them. You pushed me hard to fall heaven forbid into their hands but God helped me. I shall not die but live meaning I will not do the commandments in sadness in the aspect of death but rather with vitality and joy and I will tell the deeds of God for so is the elevation of the commandment only in joy as it is written on the three festivals all your males shall appear these are the commandments before God then in joy they will see and ascend to be before God. And this is what is said I clung to Your testimonies God do not shame me meaning I clung to Your testimonies which are the commandments in their ascent before You I clung my soul to them to elevate them with them do not shame me and bring me with them before You. And this is also what is said here may it be Your will that Your Divine Presence rest upon my deeds but in sadness the Divine Presence does not rest. And this is may the pleasantness and establish our handiwork meaning You establish my deeds to be accepted and do not worry and establish our handiwork for the Divine Presence will do everything for you to God and establish it.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Torah, Pekudei 6"
        },
        {
            "section": "Torah",
            "topic": "Bereshit",
            "number": "40",
            "passage": "וישמעו את קול ה' אלהים מתהלך כו' ויתחבא האדם ואשתו בתוך עץ הגן ויקרא לו ויאמר איכה וכו' ואירא כי עירום אנכי ואחבא. ויאמר מי הגיד לך כי עירום אתה המן העץ אשר צויתיך לבלתי אכל ממנו אכלת. ההרגש בפסוקים הללו מבואר בראשונים. והנראה בפירוש הענין ע\\\"ד מאמרם ז\\\"ל שקראו לאדה\\\"ר גנב שגנב מעץ הדעת לכך ויתחבא כי כאשר הבין האדם בעצמו שחטא מאד כי ראה הנחש כרוך אחריו ורע עליו המעשה כמ\\\"ש וידעו כי עירומים הם ערומים מכל מצוה ומכל טובה לכך ויתחבא בתוך עץ הגן הוא התורה ע\\\"ש ג\\\"ן פרשיות לתורה כמבואר בזוה\\\"ק והתחבא בתורה להמלט מזוהמת הנחש. ויקרא לו ה' איכה. ר\\\"ל איכה תמצא ידך ורגליך אחרי עשות המעשה כזה והשיב את קולך שמעתי ואירא כי עירום אנכי מכל טובה. ואמר לו הקב\\\"ה מי הגיד לך כי עירום אתה כי זה דרך הסט\\\"א וכל הדבקים בה להתנשאות ולגבהות לאמר כי חף אנכי מפשע כמו שאנו רואים כל הרשעים אומרים לנפשם צדיקים אנחנו ולא חטאנו וכמו זה אמה\\\"כ הנני נשפט אותך על אמרך לא חטאתי. כי כן דרך היצה\\\"ר מסמא את עיני אדם לאמור כי בכל אשר הוא עושה עדיין לא חטא כלל ועודנו לא נתרחק כלל מהש\\\"י ואדרבא הוא מתאמר בנפשו עוד לאמור כי מצוה הוא עושה כל הימים כמו שהשיא לחוה לאמר והייתם כאלהים לכן ההתחלת העבדות שיהיה האדם מכיר בעצמו כי חטא לה'. וצריך להיות תמיד פלס ומאזני משפט לפלס דרכיו אם יכונו באמת לה' ולא יעשה בנפשו שקר כמ\\\"ש דוד המלך ע\\\"ה ה' לי בעוזרי ואני אראה בשונאי. ר\\\"ל ה' לי בעוזרי עי\\\"כ אוכל לראות ולהכיר בשונאי לידע מי הוא האוהב אותי ומי הוא השונא המפתה אותי לדרך רעה כי היצה\\\"ט ויצה\\\"ר שניהם מפת' לדרך מצוה אך זה חלקו בחיים וזה אחריתו דרכי מות. לכן הודיעני דרך זו אלך. הורני ה' דרכיך. תעיתי כשה אובד בקש עבדך. ואל יהיה דבר זה קטן בעיני האדם לשום עינא פקיחא על נפשו בכל עניניו כי מצינו כן בצדיקים הגדולים שלא הכירו במעשיהם וחשבו למצוה והיה בהיפך כמו ענין מכירת יוסף כי עברו כ\\\"ב שנים ולא ידעו כי עשו עולה עד שראו תפיסת אחיהם ואת בנימין. אז אמרו אבל אשמים אנחנו וכתיב מיד אחריו כי המליץ בינותם ע\\\"י שהכירו שחטאו נעשה מליץ טוב עליהם. וכן היה רדיפת שאול לדוד כי סבור היה כי הוא מצוה להורגו. מעתה ק\\\"ו ב\\\"ב של ק\\\"ו לאנשים פחותי ערך כמונו עורי לב שכלו ימיהם בהבל צריך להבין ולהשכיל בפתוי היצה\\\"ר להנצל ממצודתו ודבריו הטובי' ולדעת כי איש חוטא הוא. וכזה המליצו חכז\\\"ל יש צדיק וטוב לו צדיק ורע לו רשע וטוב לו. ר\\\"ל שאומרים לנפשם כי טוב הוא ואינם יודעים בעצמם שום חטא כי הוא דומה בעיניו לצדיק וטוב לנפשו מאד. וז\\\"ש ג\\\"כ כאן מי הגיד לך כי עירום אתה המן העץ אכלת ועודך מכיר שחטאת מאין בא לך זאת והשיב כי האשה אשר נתת עמדי היא נתנה לי ומבואר במד\\\"ר כי הוא שוגג ולכך בשוגג כתיב או הודע אליו חטאתו כי עודנו זוכה להתוודע אליו חטאתו אבל במזיד אינו יודע כלל שחטא כי הכל טוב בעיניו וכשר לפניו. וד\\\"ל:",
            "english_translation": "And they heard the voice of the Lord God walking and the man and his wife hid themselves among the trees of the garden and He called to him and said where are you and I was afraid because I was naked and I hid myself and He said who told you that you were naked have you eaten from the tree which I commanded you not to eat from it you have eaten and the feeling in these verses is explained by the early ones and it appears in the explanation of the matter according to their saying that they called Adam a thief who stole from the tree of knowledge therefore he hid himself for when man understood in himself that he had greatly sinned because he saw the serpent wrapped around him and the deed was evil upon him as it is written and they knew they were naked stripped of all commandments and all goodness therefore he hid himself among the trees of the garden which is the Torah named for the 53 portions of Torah as explained in the holy Zohar and he hid in Torah to escape from the contamination of the serpent and God called to him where are you meaning how will you find your hands and feet after doing such a deed and he replied I heard your voice and I was afraid because I am naked of all goodness and the Holy One Blessed be He said to him who told you that you were naked for this is the way of the Other Side and all who cling to it to become proud and haughty saying I am free from transgression as we see all the wicked say to themselves we are righteous and have not sinned.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Torah, Bereshit 40"
        },
        {
            "section": "Torah",
            "topic": "Beha'alotcha",
            "number": "1",
            "passage": "ונסעו הקהתים נושאי המקדש. ופרש\\\"י נושאי דברים המקודשים. לכאורה דברי רש\\\"י הם אך למותר. כי כבר בסוף פ' במדבר במשא בני קהת באוהל מועד קודש הקדשים פרש\\\"י שם ג\\\"כ המקודש שבכלים הארון והשלחן ומזבחות והפרכת וכלי השרת. אמנם י\\\"ל כי הנה ידוע כי הצדיקים שבדור הם בתפלתן מעלים התפלות של כל ישראל אפי' מפחותי הערך הגם שלא התפללו בדו\\\"ר כמאמר הספרים על פסוק ועתה הנה צעקת בנ\\\"י באה אלי מהו לשון ועתה ופרשו ועתה תיכף בעת הזאת אחרי שהי' מעט דבר ה' אל משה הנה צעקת בנ\\\"י באה אלי בדבר ה' אליו מיד העלה תפלתן וזעקתם. וז\\\"ש בעבור ישמע העם בדברי עמך אל תיקרי ישמע אלא ישמע ופירושו ישמע תפלת העם בדברי עמך ע\\\"י דברי עמך. וזה ג\\\"כ היתה עבודת הלוים להעלות תפלת ישראל ופרש\\\"י נושאי דברים המקודשים לשון דיבורים המקודשים אפי' התפלות שלא נאמרו בדו\\\"ר כתקנת חכז\\\"ל אנשי כנה\\\"ג מכל מקום הם דיבורים המקודשים והלוים נושאים בתפלתם אלו הדיבורים המקודשים אל מקור העליון אשר זולתם לא עלו למקור העליון:",
            "english_translation": "And the Kohathites journeyed, bearers of the sanctuary. And Rashi explains: bearers of the sacred things. At first glance, Rashi's words seem superfluous, for already at the end of Parshat Bamidbar regarding the burden of the sons of Kohath in the Tent of Meeting of the Holy of Holies, Rashi explained there also the most sacred of vessels - the ark, table, altars, curtain, and service vessels. However, one can say that it is known that the righteous of each generation through their prayers elevate the prayers of all Israel, even those of lesser worth who did not pray with proper intention, as the books say on the verse \"And now behold the cry of the children of Israel has come to me\" - what is the meaning of \"and now\"? They explained \"and now\" means immediately at that moment after God spoke briefly to Moses, behold the cry of the children of Israel came to Him through God's speaking to him, immediately elevating their prayers and cries. And this is what is meant by \"so that the people may hear when I speak with you\" - don't read it as \"hear\" but as \"will be heard\" meaning the people's prayer will be heard through your words, through the words of your people. And this too was the service of the Levites to elevate Israel's prayers, and Rashi explains \"bearers of sacred things\" meaning sacred utterances, even prayers not said with proper intention as established by the Sages of the Great Assembly, nevertheless they are sacred utterances and the Levites carry in their prayer these sacred utterances to the supreme source, without which they would not ascend to the supreme source.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Torah, Beha'alotcha 1"
        },
        {
            "section": "Torah",
            "topic": "Vayishlach",
            "number": "9",
            "passage": "ויאמר יעקב אל ביתו ואל כל אשר עמו הסירו את אלהי הנכר אשר בתוככם והטהרו ונקומה ונעלה בית אל. ואעשה שם מזבח וכו'. פירש\\\"י והטהרו מעבודת גלולים עכ\\\"ל. התורה מלמדת אותנו דרך לעבודת הבורא ב\\\"ה מדברי יעקב אבינו ע\\\"ה ונקדים דברי הש\\\"ס בקדושין כל שאינו יודע בטיב גיטין וקדושין לא יהי' לו עסק עמהם והרגישו המפורשים למה הקדימה גיטין לקדושין הלא בכ\\\"מ קדושין קודמין לגיטין דבתחלה האדם מקדש ואח\\\"כ אם מצא בה וכו' הוא מגרשה. אך נקדים דברי הש\\\"ס על פסוק מה ה' דורש ממך כי אם הצנע לכת עם ה' אלקיך. ודרשו חכז\\\"ל זה הוצאת המת והכנסת כלה. ונדחק רש\\\"י בפי' הש\\\"ס הזה. ועוד מה הוא הענין שדרשו דוקא הפי' הצנע לכת לשני דברים הללו דלמא הפי' הצנע לכת ליתן צדקה בסתר כמ\\\"ש מתן בסתר וכו' או להתפלל בהצנע כיון שכל הדברים טוב בהם הצניעות. ועוד מאי כי אם הצנע לכת וכי אם יקיים אדם הני תרי דברים הוצאות המת והכנסת כלה יותר אין הקב\\\"ה חפץ מן האדם. ולמה תרי\\\"ג מצות. אך נקדים לזה דברי הספרים הקדושים ובפרט האריז\\\"ל שכל המצות ותפלות ותורה ומעש\\\"ט שהאדם עושה אם חטא מקודם ולא עשה תשובה כל התפלות והמצות נוטלים הסט\\\"א וחיילותיו ואדרבא מוסיף כח לקליפה בתורה ומצות. ובזה פרשו הפסוק ולרשע אמר אלקים מה לך לספר חוקי וכו'. ובזה פרשו הפסוק סור מרע ועשה טוב היינו קודם עשיית הטוב מקודם צריך להיות סור מרע דהיינו לעשות תשובה. ובזה פרשו תשובה ומעשים טובים בעוה\\\"ז שלכל מעשים טובים שאנו עושים בעוה\\\"ז צריך תשובה מקודם ואח\\\"כ מעשים טובים. ובזה פרשנו ואמרנו שהדברים האלו מפורשים בתורה בפ' התשוב' בפ' וילך ושבת עד ה' אלקיך וכו' ושמעת בקולו ככל אשר אנכי מצוך וכו'. עוד שם פסוק אחר ואתה תשוב ושמעת בקול ה' כו' לשמור מצותיו וחוקותיו הכתובה בספר הזה כי תשוב אל ה' אלקיך כו' מבוארים הדברים שהתורה אומרת שהתשובה קודמת לכל המצות ומבלעדה לא ירים איש את ידו לעשות שום מצוה שהרי אמר הכתוב לשמור מצותיו וכו' כי תשוב וכו' שכל זמן שלא עשה תשובה הכל הולך לסט\\\"א. ובזה נחזור לש\\\"ס הנ\\\"ל הצנע לכת עם ה' אלהיך ע\\\"ד שאיתא בזוהר על פסוק הנסתרות לה' אלהינו שהיא יראה ואהבה שהם דברים שבלב. וזהו הצנע לכת עם ה' אלקיך שיראה ואהבה הם בהצנע לכת כי היא בתוך בנ\\\"א דהיינו השם י\\\"ה שהוא יראה ואהבה כמבואר בזוהר ותלך עם ה' אלקיך שהשם הוי' יהי' שורה עמך בכל דרכיך. וזהו הוצאות המת והכנסת כלה. וגם מבואר שס\\\"מ וסט\\\"א נקראים מתים. וזהו אמרו כאלו אכלו מזבחי מתים. וגם אמרו בש\\\"ס רשעים בחייהם קרוים מתים משום שהס\\\"ם וסט\\\"א שולטין על האדם הרשע כמאמר חכז\\\"ל רשעים יצה\\\"ר שופטן והן נקראים מתים לכן הרשעים שהם תחתיהן נקראים ג\\\"כ מתים כמוהם. וזה כוונת הש\\\"ס מעבירין את המת מלפני הכלה אם אדם רוצה להכניס הקדושה היינו השכינה הנקראת כלה לתוכו יצטרך מקודם לפנות המת ולהעבירו מלפני הכלה שאין אדם דר עם נחש וכו' ומכ\\\"ש הקב\\\"ה. וזה רמז הכתוב בפ' חיי שרה בדברי לבן ויאמר בא ברוך ה' למה תעמוד בחוץ ואנכי פניתי הבית ופרש\\\"י פניתי הבית מע\\\"ג רמז לנו הכתוב שקודם פניות הבית מע\\\"ג היינו פנימיות ועקמימות שבלב ע\\\"ד לא יהי' בך אל זר היינו היצה\\\"ר שבלבבו של אדם שאי אפשר לבוא בתוכו ברוך ה' ומכש\\\"כ השכינה וכמבואר בזוהר שצריך כל אדם להעביר הסט\\\"א מכל אבר ואבר אז שורה השכינה עליו. וזה רמזו רז\\\"ל זהו הוצאות המת והכנסת כלה היינו השכינה הנקראת כלה וזהו כל שאינו יודע בטיב גיטין וקדושין קודם כל מצוה. שידוע עיקר כוונת כל מצוה היתה להתקדש אותנו בהם כמ\\\"ש אומרים אשר קדשנו במצותיו שבכל מצוה ומצוה אנו מוסיפין עלינו קדושה ואם האדם נתעב בחטאיו ועוונו אין הקדושה יכולה לשרות על האדם כי אין אדם דר עם נחש וכו'. וזה נקרא גיטין היינו גרושין. וזה כל שאינו יודע בטוב גיטין וקדושין היינו מקודם גיטין ואח\\\"כ קדושין. ומזה פרשתי הכתוב משכו וקחו לכם צאן ופרשו רז\\\"ל משכו ידיכם מע\\\"ג שזה היתה מצוה ראשונה כמאמר חכז\\\"ל לא הי' צריך התורה להתחיל אלא מהחודש הזה לכם למדה התורה אותנו שקודם עשיית הקרבן שהיא מצות קרבן פסח למשוך ידיהם מע\\\"ג. ולזה היתה הרמזים וכוונת התורה במצוה הראשונה בפסח שיצאו מתתת הסט\\\"א היינו מיד מצרים דכל זמן שהיו תחת יד מצרים היו תחת יד הסט\\\"א כמבואר בספרים. אך אחר שיצאו ממצרים מתחת שיעבודם הי' כוונת הקב\\\"ה שיצאו מתחת יד שיעבוד היצה\\\"ר. ולזה מצוה ראשונה הוא פסח ואכילת מצה היינו להתקדש גופו של בנ\\\"י בהשראת הקדושה צוה הש\\\"י לגרש הסט\\\"א והיצה\\\"ר דהיינו ביעור חמץ הוא היצה\\\"ר כמבואר בזוה\\\"ק ובספרים. ולזה אמה\\\"כ אחר מצות קרבן פסח ואמר עוד ז' ימים מצות תאכלו אך ביום הראשון תשביתו שאור מבתיכם היינו מערב יו\\\"ט ולא ביו\\\"ט עצמו ע\\\"ד שאמרו מעבירין את המת מלפני הכלה. וזה כוונת רבא בש\\\"ס בפסחים דף ה' אך ביום הראשון הוא מעיו\\\"ט ולא ביו\\\"ט עצמו הרי נאמר לא תשחט על חמץ דם זבחי א\\\"כ ראינו שכוונת הכתוב שקודם עשיית המצוה יהי' ביעור חמץ. ולזה אמר אח\\\"כ ושמרתם את המצות ודדשו חכז\\\"ל אל תיקרי מצות אלא מצוות הרמז שבכל המצות צריך מקודם ביעור חמץ. ולזה יש לומר מה שמקשים שבדברי משה לא נזכר רק עשיית הפסח ולא נזכר כלל ביעור חמץ. אך במה שאמר משכו ידיכם מע\\\"ג כדרשת חכז\\\"ל ממילא מרמז בזה מצות ביעור חמץ כנ\\\"ל. ולזה בא הרמז בסמיכות בפ' כי תשא אלהי מסכה לא תעשו לכם את חג המצות תשמור. עוד רמז בכ' ובא השמש וטהר ואחר יאכל מן הקדשים. וזה ג\\\"כ בפ' משפטים לא תשתחוה לאלהיהם ולא תעבדם וכו' ושבר תשבר מצבותיהם ועבדתם את ה' אלהיכם כו'. וזה ג\\\"כ הרמז בפ' אדם כי יקריב מכם קרבן לה' מן הבהמה כו' תקריבו את קרבנכם. היינו מקודם צריך להקריב הבהמיות שבאדם לעשות לה' בכל דרכיך דעהו ואח\\\"כ אדם כי יקריב מכם כו' יכול האדם להתקרב להקב\\\"ה. וכן נאמר בפ' קדושים לרצונכם תזבחוהו היינו הרצון הרע שבכם תזבחוהו קודם עשיית הקרבן. וזה היתה כוונת יעקב אבינו ע\\\"ה בפסוק הזה הסירו את אלהי הנכר אשר בקרבכם ע\\\"ד שאמרו חכז\\\"ל לא יהי' בך אל זר זה היצה\\\"ר שהוא בתוך לבו של אדם והטהרו מע\\\"ג כפרש\\\"י ונקומה ונעלה בית אל ונעשה שם מזבח כו' היינו כנ\\\"ל שקודם עשיית המצוה ובפרט הקרבנות. הסירו את אלהי הנכר כו'. כן יהי רצון בכל מעשינו אמן:",
            "english_translation": "And Jacob said to his household and to all who were with him, \"Remove the foreign gods that are among you and purify yourselves and let us arise and go up to Bethel. And I will make there an altar.\" Rashi explains \"purify yourselves\" means from idol worship. The Torah teaches us the way to serve the Creator, blessed be He, from the words of our father Jacob, peace be upon him, and we preface the words of the Talmud in Kiddushin that whoever does not know the proper way of divorce and marriage should not deal with them, and the commentators noticed why divorce precedes marriage when everywhere marriage comes before divorce since first a person marries and then if he finds in her etc. he divorces her. But we preface the words of the Talmud on the verse \"What does the Lord require of you but to walk humbly with your God.\" And our Sages interpreted this as referring to attending to the dead and bringing in the bride. And Rashi struggled to explain this Talmudic passage. And furthermore what is the matter that they interpreted specifically the meaning of walking humbly for these two things, perhaps the meaning of walking humbly refers to giving charity in secret as it is written \"a gift in secret\" etc. or to pray privately since all things are good with modesty. And furthermore what is meant by \"but to walk humbly\" - if a person fulfills these two things, attending to the dead and bringing in the bride, does God want nothing more from the person? And why are there 613 commandments?",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Torah, Vayishlach 9"
        },
        {
            "section": "Torah",
            "topic": "Vaera",
            "number": "1",
            "passage": "וידבר אלהים אל משה ויאמר אליו אני ה' . להבין ענין האמירה הזאת שאמר אליו אני ה' מה אמר לו. אך הנה באה ללמד לאדם דעת להבין בעצמו כי בכ\\\"ע עמדו לפני ה' בתורה ותפלה כי הוא איננו כדאי וראוי לזכות ולעמוד לפתוח פיו לפני הש\\\"י ממה\\\"מ הקב\\\"ה ואינו בכחו לדבר מאומה זולת מחסד הבורא עליו אשר ישים דבר בפיו לאמר כה תדבר כמש\\\"א דוד המלך ע\\\"ה כי אין מלה בלשוני הן ה' ידעת כלה. לכן צריך האדם להכנע ולשבר לבבו קודם הלימוד והתפלה להתפלל לה' ולשאול ממנו מענה לשון כמ\\\"ש בברכת התורה אשר קדשנו במצותיו וצונו לעסוק בדברי תורה. ואעפ\\\"כ מתפללים והערב נא כו' את דברי תורתך בפינו שיהיה בו עריבות ומתיקות לפניך להיות נחת רוח לפני כסא כבודך אע\\\"פ שהאדם מחויב ללמוד במצות הבורא בחיוב דאורייתא מ\\\"מ אינו כשאר מלאכות שמחויב לראות להשלים פעולתו אשר נשלח אליה כי אורייתא צריך הקדמת דחילו ורחימו וכן בתפלה ושאר כל המצות כי הוא רק חסד עליון אשר יזכה האדם השפל לעמוד לפניו ולהתפלל כמ\\\"ש הללו את ה' מן השמים. ר\\\"ל להודות ולהלל לפניו ית\\\"ש הוא ג\\\"כ סיוע מן השמים טוב ה' לכל ורחמיו על כל מעשיו יודוך ה' כו' כל זה מצד הרחמנות אשר יודוך כל מעשיך. לכן אל יפול לב האדם עליו בראותו כי הקדים ליגע קודם התפלה הרבה בלימוד שיעורין כסדרן ואעפ\\\"כ מתהפך הוא בתחבולותיו בשעת התפלה ואיננה שגורה בפיו ואיננו יכול להתפלל כי הכל הוא מן השמים והוא יעשה את שלו. ועל כזה רמזו רז\\\"ל אל תעש תפלתך קבע. ענין הקביעות הוא הבא בכל עת בטבע. כן אל תעש תפלתך מצד שלמדת הרבה קודם התפלה בקביעות ועי\\\"כ נכון לך להתפלל. לא כן אלא רחמים ותחנונים לפני המקום מצד הרחמנות תבא לפני המקום. וכן נאמר ואתחנן כו' פרש\\\"י מתנת חנם אע\\\"פ שיש להם לצדיקים לתלות במעשיהם הטובים אעפ\\\"כ אינם מבקשים רק מתנת חנם. ר\\\"ל שיש להם לתלות שיהיה תפלתם נכונה ע\\\"י מעשיהם הטובים שלמדו הרבה ועשו מעש\\\"ט קודם התפלה אעפ\\\"כ אינם מבקשים ר\\\"ל הבקש' שלהם אינה רק מתנת חנם כנ\\\"ל. וז\\\"ש שצריך לומר קודם שמ\\\"ע אדני שפתי תפתח כי לולא זאת איך יכול לעמוד בתפל' כי איך יזכה ילוד אשה לעמוד לפני הקב\\\"ה. הנה כזה היה הענין אצל משרע\\\"ה ציר נאמן כי שלחו ה' לפדו' את בנ\\\"י ולהוציאם ממצרים ומשרע\\\"ה באהבתו לישראל הלך בהתלהבות לקיים דבר השליחות וכאשר ראה כי לא שמעו לו הרע בעיניו והתחיל לזעוק למה הרעות. אמר לו הקב\\\"ה דע לפני מי אתה עומד כי אני ה' כמו שמבואר בזוה\\\"ק מקמאי מלילת מילין אילין. ודו\\\"ק:",
            "english_translation": "And God spoke to Moses and said to him I am the Lord. To understand the matter of this saying that He said to him I am the Lord what did He say to him. Indeed it came to teach man knowledge to understand within himself that in all circumstances he stands before the Lord in Torah and prayer for he is not worthy and deserving to merit and stand to open his mouth before the Holy One blessed be He and it is not in his power to speak anything except from the Creator's kindness upon him who puts words in his mouth to say thus shall you speak as King David peace be upon him said for there is no word on my tongue behold Lord You know it all. Therefore a person needs to humble himself and break his heart before learning and prayer to pray to the Lord and ask from Him for an answer of tongue as it is said in the blessing of the Torah who sanctified us with His commandments and commanded us to engage in words of Torah. And nevertheless we pray and make sweet etc. Your Torah words in our mouths that there should be pleasantness and sweetness before You to be satisfaction before Your throne of glory even though a person is obligated to learn by the Creator's command as a Torah obligation nevertheless it is not like other tasks that one must see to complete his action that he was sent to do for Torah requires the precedence of fear and love and so too in prayer and all other commandments for it is only supreme kindness that the lowly person merits to stand before Him and pray as it is said praise the Lord from the heavens meaning to thank and praise before Him blessed be He is also assistance from heaven the Lord is good to all and His mercies are upon all His works they will thank You Lord etc. all this is from the aspect of mercy that all Your works will thank You therefore let not a person's heart fall upon seeing that he preceded to toil before prayer much in learning regular lessons and nevertheless he turns in his strategies during prayer and it is not fluent in his mouth and he cannot pray for everything is from heaven and He will do His part and about this the Sages hinted do not make your prayer fixed the matter of fixedness is that which comes naturally at all times so do not make your prayer from the side that you learned much before prayer regularly and through this it is proper for you to pray not so but rather mercy and supplications before the Omnipresent from the aspect of mercy come before the Omnipresent and so it is said and I beseeched etc Rashi explained a free gift even though the righteous have to rely on their good deeds nevertheless they only ask for a free gift meaning that they have to rely that their prayer will be proper through their good deeds that they learned much and did good deeds before prayer nevertheless they only ask meaning their request is only a free gift as mentioned above and this is what is said that one needs to say before the Amidah Lord open my lips for without this how can one stand in prayer for how can one born of woman merit to stand before the Holy One blessed be He behold this was the matter with Moses our teacher peace be upon him the faithful messenger for the Lord sent him to redeem the children of Israel and take them out of Egypt and Moses our teacher peace be upon him in his love for Israel went with enthusiasm to fulfill the matter of the mission and when he saw that they did not listen to him it was bad in his eyes and he began to cry out why have You done evil the Holy One blessed be He said to him know before whom you stand for I am the Lord as is explained in the holy Zohar from before you spoke these words and examine carefully.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Torah, Vaera 1"
        },
        {
            "section": "Festivals",
            "topic": "Sukkot",
            "number": "47",
            "passage": "(בחי' יעקב) אשרי איש ירא את ד' במצותיו חפץ מאד. להבין כוונת הכתוב כי לכאורה הוא ב' ענינים כי מי שהוא ירא מאד הנה יירא ויבוש מלעשות מצותיו כי אומר מה אני ומה חיי ומי אנכי כי אזכה להתקרב אל ד' לעשות מצותיו. אולם הנה זה מלמדנו הכתוב שיהי' כל מעשי האדם בהשכל וחכמה ובזמנים חלוקים לא להשתמש בשניהם כאחד אם אמנם כי צריך האדם להתגבר על עצמו ביראת ד' ולהתוודות על פשעיו ולבכות במר נפשו. אך זה לא בכל עת ולא זו העת בשעת תורה ותפלה כי בשעת תורה ותפלה צריך להיות בשמחה ואהבה. וע\\\"ז נאמר סור מרע ועשה טוב בשעת עשיית המצוה אין לזכור העבירה. עשה דוחה ל\\\"ת. פי' המצוה דוחה העבירה. כי אם בשעת המצוה יזכור חטאיו אז יתרשל ויבוש מעשות את המצוה וזהו מעשה היצר לבלבל את האדם בעת התפלה בעצבות עוונותיו אך לזה לפקוד ולשוב על עוונותיו צריך זמן בפ\\\"ע בקומו בחצות לילה או קודם אור הבקר אך אז ישוב אל לבבו כל הימים אשר עברו בהשער בנפשו גודל פחדו והדר גאונו ואז יתוודה במר נפשו מקירות לבו. ואח\\\"כ יתעורר מעפרו ויקום אל התורה והתפלה להתעודד בשמחה וקול זמרה וע\\\"ז נאמר עבדו את ד' בשמחה. וכזה הי' ענין יעקב אבינו ע\\\"ה כאשר צותה עליו רבקה ואעשה אותם מטעמים לאביך כאשר אהב. רבקה רומז לשכינה הקדושה כמבואר בזוה\\\"ק. והשכינה צוותה לעשות מצות ומעש\\\"ט הם המטעמים ויעקב הוא רמז לכנ\\\"י והי' ירא אולי ימשני אבי במעשי הרעים פן אהי' כמתעתע והבאתי עלי קללה. אך השכינה צוותה עליו לך ועשה ואל תירא כי עתה אין הזמן לפשפש במעשים בעת עשיית המצוה ועלי קללתך בני. אך עשה מטעמים לאביך. נחת רוח לפני ד' באהבה וזה כאשר אהב. וז\\\"ש הכתוב אשרי האיש ירא את ד' ביראה ואעפ\\\"כ במצותיו חפץ מאד בשעת עשיית המצות חפץ מאד לעשותם באהבה עזה:",
            "english_translation": "Happy is the man who fears God and greatly desires His commandments. To understand the meaning of the verse, for it appears to be two matters, since one who is very fearful will be afraid and ashamed to perform His commandments, saying \"What am I and what is my life and who am I that I should merit to draw near to God to perform His commandments.\" However, this is what the verse teaches us, that all of man's deeds should be with wisdom and understanding and at different times, not to use both at once, even though a person needs to overcome himself with fear of God and confess his transgressions and weep bitterly. But this is not for all times and not during times of Torah study and prayer, for during Torah study and prayer one needs to be in joy and love. And regarding this it is said \"Turn from evil and do good\" - during the performance of a commandment one should not remember sin. A positive commandment pushes aside a negative one, meaning the commandment pushes aside the transgression. For if during the commandment one remembers his sins, then he will become lazy and ashamed to do the commandment, and this is the work of the evil inclination to confuse a person during prayer with sadness over his sins, but for this, to remember and repent his sins needs its own time when rising at midnight or before dawn, but then he should return to his heart all the days that have passed, considering in his soul the greatness of his fear and the splendor of His majesty, and then confess bitterly from the depths of his heart. And afterwards he should arise from his dust and rise to Torah and prayer to be encouraged with joy and song, and regarding this it says \"Serve God with joy.\" And such was the matter with our father Jacob, peace be upon him, when Rebecca commanded him \"and I will make delicacies for your father as he loves.\" Rebecca alludes to the holy Divine Presence as explained in the holy Zohar. And the Divine Presence commanded to perform commandments and good deeds which are the delicacies, and Jacob represents the congregation of Israel, and he was afraid \"perhaps my father will feel my evil deeds and I will be as a deceiver and bring upon myself a curse.\" But the Divine Presence commanded him \"go and do and do not fear\" for now is not the time to examine deeds during the performance of a commandment, \"and upon me is your curse, my son.\" Rather make delicacies for your father - satisfaction before God with love, and this is \"as he loves.\" And this is what the verse says \"Happy is the man who fears God\" with fear, and nevertheless \"greatly desires His commandments\" - at the time of performing commandments desires greatly to do them with intense love.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Festivals, Sukkot 47"
        },
        {
            "section": "Festivals",
            "topic": "Shaar Tefillah",
            "number": "24",
            "passage": "מזמור שיר חנוכת הבית לדוד. סדרו אנשי כנה\\\"ג לומר מזמור זה קודם התפלה. דהנה ידוע שהתפלה היא העיקר ההכנעה קודם התפלה לחשוב ברוממות האל ובשפלות עצמו ובעונותיו המרובים. והנה יכול ליפול לב האדם לגמרי ויאמר מה תועלת בתפלתי בוודאי לא יעלה לרצון למעלה כלל וזה הוא שני ההפכים בנושא אחד. ולזה צריך אמונה להאדם ויגבה לבו בדרכי השם שאדרבא תפלתו עולה למעלה ובוקע חלוני רקיע. ובזה י\\\"ל דברי המדרש. אם מזרע היהודים מרדכי כו' כשהם יורדים יורדים עד לעפר וכשהם עולים עולים עד לרקיע. ובזה יש לפרש דברי התפלה ונפשי כעפר לכל תהי' פתח לבי בתורתך וכו'. ולזה אמר אברהם הנה נא הואלתי לדבר ואנכי עפר ואפר. זה בשעה שהתחיל להתפלל. ואח\\\"כ צריך האדם להתחזק יותר ויותר כמו שאמר אברהם אולי יש חמשים צדיקים בתוך העיר וכו' אולי יש עשרה. היוצא מזה דבשעה שמתחיל האדם להתפלל צריך להיות כמו עפר בעצמו ואח\\\"כ עולה למעלה וזהו ממש כמו בבנין הבית שמתחלה חופר אדם בקרקע להניח יסוד ולבנותו ואח\\\"כ עולה ובונה עד לשמים. וז\\\"פ מזמור שיר חנוכת הבית לדוד. אליך ד' אקרא כו'. מה בצע בדמי ברדתי אל שחת היודך עפר. דהוא תמוה מאד דמאי הו\\\"א לאדם שיהי' לו ריווח שיבא אל השחת וכמובן. אך להנ\\\"ל ניחא דהפי' במחשבה. שאל יהי' האדם שפל בשעת התפלה ויורד במחשבתו אל שחת. ע\\\"ז אמר היודך עפר אם אהי' שפל ונבזה יותר מדאי א\\\"כ לא יהי' באפשר כלל להתפלל וכו'. פתחת שקי ותאזרני שמחה למען יזמרך כבוד ולא ידום היינו כנ\\\"ל שהקב\\\"ה יחזק לאדם ויסיר ממנו העצבות מעבירות שבידו למען יזמרך כבוד (ע\\\"ד שכ' האור המאיר) וז\\\"פ הפ' סור מרע ועשה טוב. שיפנה מחשבתו מהעבירות ויעשה טוב. וכן נ\\\"ל הפי' בפסוק בטח בד' ועשה טוב. דהנה כתיב אל תבטחו באלוף כדרשת חכז\\\"ל. אך כדי לעשות הטוב אסור להיות עניו. ולזה פירשו המפרשים העשיר לא ירבה והדל לא ימעיט אפי' כל העולם אומרים עליך כו' תהי' בעיניך כרשע. ואל תהי רשע בפני עצמך היינו כנ\\\"ל. ואין סתירה לב' הדברים אלו. (וזה הפי' אם מזרע היהודים כו' כשהם עולים כו'. דהנה אסתר אמרה כי אין לבא אל המלך בלבוש שק היינו בעצבות ולכך ותלבש אסתר מלכות ותעמוד בחצר בית המלך הפנימית. והנה החכמים היו רואים שמרדכי לובש שק וחשבו שלא יהי' נשמע בקול תפלתו אבל עכשיו שהסירה השק מעליו והלבישתו בגדי מלכות א\\\"כ יעלה תפלתו וכשהם עולי' עולי' עד לשמים. אין עמידה אלא תפלה. (עיי' בדרוש פורים בפ' והרכיבהו). וזהו ממעמקי' קראתיך ד' ד' שמעה כו' אם עונות תשמר יה אדני מי יעמוד. היינו תפלה. ואני בחסדך בטחתי יגל לבי בישועתך. אני בטוח שתושיעני. כי בהישועה אין אני שמח על עצמי רק על ישועת ישראל וזהו ישועת הקב\\\"ה כמ\\\"ש במד\\\"ר על פסוק לד' הישועה על. עמך ברכתך סלה. (וכן הפי' פתחת שקי ותאזרני שמחה. שהשמחה היא למען יזמרך כבוד). וזה הפי' אחור וקדם צרתני דהקב\\\"ה חפץ בזה שיהי' האדם שפל בדעתו ובשעת התפלה יהי' בהתרוממות שבונה עולמות בתפלתו. פליאה דעת ממני נשגבה לא אוכל לה. שיהי' ב' הפכיים בנושא אחד. אך התירוץ אנה אלך מרוחך ואנה מפניך אברח וכו' ע\\\"ד שכ' בס' מבשר צדק בפ' ויגש ע\\\"ש. העבר עיני מראות שוא בדרכיך חייני. העבר חרפתי אשר. יגורתי כו' זדים הליצוני עד מאד מתורתך לא נטיתי. רחוק מרשעים ישועה כי חוקיך לא דרשו. אליו פי קראתי ורומם תחת לשוני. און אם ראיתי בלבי כו'. וזה הכוונה הלוחות ושברי לוחות מונחים בארון. דארון הוא כינוי ללב כמבואר בזוהר הקדוש ושברי לוחות הוא לזכרון העונות שאז לדור המדבר היו לזכרון מעשה העגל זכור אשר הקצפת. ועכשיו יש לכל אדם יותר ויותר עונות מדור המדבר כידוע. ולכן מונחים בארון: (מכי\\\"ק)",
            "english_translation": "A psalm, a song for the dedication of the house, for David. The men of the Great Assembly arranged to say this psalm before prayer. For it is known that prayer is the main humility before prayer, to think of God's greatness and one's own lowliness and many sins. And behold, a person's heart can completely fall and say what benefit is in my prayer, surely it will not rise favorably above at all, and these are two opposites in one subject. And for this faith is needed for a person and his heart should be elevated in God's ways that on the contrary his prayer rises above and pierces the windows of heaven. And in this can be explained the words of the Midrash. If from the seed of the Jews is Mordecai etc., when they descend they descend to dust and when they rise they rise to heaven. And in this can be interpreted the words of prayer \"and may my soul be like dust to all\" open my heart to your Torah etc.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Festivals, Shaar Tefillah 24"
        },
        {
            "section": "Festivals",
            "topic": "Shabbat",
            "number": "15",
            "passage": "נקדישך ונעריצך כנועם שיח סוד שרפי קודש כו'. יש להבין למה צורך אנו אומרים שנקדישך כמו שרפי קודש מה יוצא לנו מדמיון הזה אל המלאכים. אך הנה כבר מבואר בזוהר הקדוש ובספרים שעיקר העבדות בתורה ומצות הוא ע\\\"י מסירות נפש להקב\\\"ה ואז עולה הכל. שזהו שורש העלאת מ\\\"נ המבואר בהאר\\\"י ז\\\"ל שהוא מס\\\"נ. וכן זהו עיקר התפלה כמשאה\\\"כ הנה נא הואלתי לדבר אל ד' ואנכי עפר ואפר שהוא מסירות נפש לעפר ואפר בזה הואלתי לדבר אל ד'. זהו הקדמה וההתחלה לתפלה כנ\\\"ל. והנה זה הפי' בק\\\"ש שמע ישראל כו' ואהבת את ד' אלהיך בכל לבבך ובכל נפשך וכו' והיו הדברים האלה אשר אנכי מצוך היום על לבבך. דהנה מצינו כי הקב\\\"ה הוא נקרא לבב של בנ\\\"י כמובא במד\\\"ר ומוכח בפסוק כי נגע עד לבבך ע\\\"ש. הנה זהו שלמדה תורה אותנו שבאם תהי' כל היום בכוונת המסירות נפש שמע ישראל למסור נפשך באחד כר\\\"ע שאמר מתי תבא לידי ואקיימנה. וז\\\"פ ואהבת כו' בכל לבבך ובכל נפשך אפי' הוא נוטל את נפשך אז והיו הדברים האלה על לבבך שהוא הקב\\\"ה כמו שאמרו רז\\\"ל עתיד הקב\\\"ה להיות עטרה בראש כל צדיק. כמ\\\"ש ביום ההוא יהי' ד' צבאות לעטרת צבי ולצפירת תפארה לאותן המצפים לתפארתו יכול לכל ת\\\"ל לשאר עמו למי שמשים עצמו כשירים ע\\\"ש. הפי' הוא כנ\\\"ל. כי ע\\\"י התורה ומצות בכוונה הגדולה הנ\\\"ל כביכול הקב\\\"ה מתגדל ומתקדש והוא עתיד להתעטר ולהתפאר בישראל עמו בכל אלה במסירות נפש בין האומות עבור כבודו ית\\\"ש ועד\\\"ז והיו הדברים האלה על לבבך ושננתם לבניך. פרש\\\"י אלו התלמידים כמו שמצינו בר' עקיבא שהי' לו כ\\\"ד אלף תלמידים שנעשה כמעיין המתגבר ונובע בתורה. הנה זה בענין התורה ומצות כמו שבארנו. אכן עוד יש לרמז בכוונת ר' אליעזר הנ\\\"ל שאמר לאותן המצפים תפארתו למי שמשים עצמו כשירים שהוא על אותן המצפים ישועות הש\\\"י ודורשים יחודו שלא יהי' כוונתם עבור עצמם כלל לזכות עי\\\"ז לעולם הזה ולעוה\\\"ב ולא לשום תשלום גמול בהישועה העתידה. רק שיהי' כוונתם לשם יחוד קוב\\\"ה ושכינתי' לבדו אפי' שלא יהי' לו עה\\\"ב כלל. הכוונה בזה שאמר אחד מן האמוראים ייתי ולא אחמיני'. פי' אפי' עוה\\\"ב כלל ולא אזכה לחזות בנועם ד' אעפ\\\"כ אני מתפלל ומחכה ומצפה שיבוא המשיח לישראל שימלא כל הארץ כבודו בב\\\"א. והנה זהו שאמר הכתוב ואמר ביום ההוא הנה אלהינו זה קווינו לו ויושיענו זה ד' קווינו לו נגילה ונשמחה בישועתו. דהנה כפל הדברים בלשון הכתוב אינו מובן. אכן זה מורה על כוונת בני אדם שמתפללים על ביאת משיח יש שמתפללים על ביאת משיח וכוונתן על עצמן ג\\\"כ שיהי' להם עוה\\\"ב ושיחיו לעולם וכדומה ע\\\"ז אמר הכתוב הנה אלהינו זה קווינו לו ויושיענו שיהי' לנו הישועה ג\\\"כ באלהינו זה שיהי' לנו כל טוב בעוה\\\"ב. אבל לא זאת המנוחה ולא זאת הכוונה והשמחה האמיתית בכבוד הש\\\"י כי הוא עודנו שותף עמה. אבל הצדיקים האמיתים הם המצפים רק על יחוד שמו לבדו ית\\\"ש. הנה עליהם אמר הכ' זה ד' קווינו לו נגילה ונשמחה בישועתו של הש\\\"י ב\\\"ה לבדו ולאלו הצדיקים השמחה היא בשלימות ועליהם אמר הכ' שישו אתה משוש. הנה זהו הפי' שאמר ר' אליעזר שיהי' הקב\\\"ה לעטרת צבי לאותן המצפים חסדו ותפארתו ית\\\"ש ולא תפארת עצמו כלל וזה יכול לכל ת\\\"ל לשאר עמו למי שמשים עצמו כשירים ואינו מכוון לעצמו כלל. והנה זהו הפי' בכל נפשך אפי' הוא נוטל את נפשך שהי' קשה להם כפל הלשון בכל נפשך ובכל מאדך וכמו שהערו המפורשים ז\\\"ל. לכן אמרו בכל נפשך אפי' הוא נוטל את נפשך. היינו בכל לבבך הוא שמוסר כל לבבו וכל חפצו של עולם הזה עבור כבודו ית\\\"ש ובכל נפשך היינו שמוסר גם נפשו השארת הנפש בעוה\\\"ב זה ג\\\"כ הוא מוסר עבור כבודו בעת שישובו כל הנשמות למקורם ממקום שנטלו משם ולא יהי' לו עוה\\\"ב לעצמו אעפ\\\"כ ואהבת כו'. וזהו הפי' אין ערוך לך כו' בעולם הזה ואין זולתך מלכנו לחיי עוה\\\"ב אפס בלתך גואלנו לימות המשיח. היינו שאין נחשב וערך לנו שום ענין בעולם הזה זולת כבודך ית\\\"ש וכן אין לנו שום דבר בעוה\\\"ב להיות בזה הכוונה והרצון להשיג תענוג לחיי עוה\\\"ב אפס בלתך. אע\\\"פ שיגיע העת שלא יהי' שום דבר בעולם בלתך כי הכל יהי' אפס ויחזרו כל הנשמות למקורם ולא יהי' רק ונשגב ד' לבדו ביום ההוא. אעפ\\\"כ אנו אומרים ומתפללים גואלנו לימות המשיח כי זהו הכלל אנו מוסרים כל עניני עולם הזה וכל גמול עוה\\\"ב בכל לבבנו ובכל נפשנו עבור כבודו ית\\\"ש שיתגלה כבוד מלכותו במהרה. והנה זהו כלל ופרט וחזר וכלל. שהנשמות היו בכלל א\\\"ס ב\\\"ה קודם בריאת העולם ונעשו פרט שנשתלשלו ונחלקו לדגליהן ואח\\\"כ יחזרו לכלל כיל\\\"ח. וזה שאמר הכתוב חלקי ד' אמרה נפשי על כן אוחיל לו וע\\\"ז אמר הכתוב מה שחלקי הוא ד' אמרה נפשי שהנפש הוא חלק אלוה ממעל ורצוני בחלק שלי להדבק בכלל על כן ועל הדבר הזה אך אוחיל לו. וע\\\"ז אמר הכתוב טוב ד' לקוויו לנפש תדרשנו. שהנפש תדרשנו לחזור לכללו ולהדבק בשרשו באור החיים כנ\\\"ל. וזהו טוב ויחיל ודומם לישועת ד' שעד\\\"ז הוא תשועת ד' לבדו כביכול ואינו מכוון בה לעצמו כלל כמו שבארנו. והנה זהו השבח של הקדושה שאנו אומרי' נקדישך ונעריצך כנועם שיח סוד שרפי קודש. דהנה יש כתות מלאכים שנבראים בכל יום לשעה זו לומר קדוש קדוש כו'. ומיד נשרפים ועולים כמבו' בזוהר הקדוש ובספרים. והנה המלאכים האלה אע\\\"פ שיודעים הם שאח\\\"כ ישרפו אעפ\\\"כ אומרים הקדושה באהבה ובמסירות נפש לעשות נ\\\"ר להש\\\"י ב\\\"ה כדי להכלל אח\\\"כ באור העליון ב\\\"ה. הנה כן אנחנו נקדישך ונעריצך ורוצים אנו שיתגדל ויתקדש שמו בעולם במהרה בימינו במסירת נפשנו כמו המלאכי' האלו רק שנזכה פעם אחת לומר קדוש קדוש כו' ד' צבאות כו':",
            "english_translation": "We will sanctify and revere you like the pleasant secret conversation of the holy seraphim. We must understand why we need to say we will sanctify like the holy seraphim, what emerges for us from this comparison to the angels. But behold it is already explained in the holy Zohar and in the books that the main service in Torah and commandments is through self-sacrifice to the Holy One Blessed be He and then everything ascends. For this is the root of raising feminine waters explained in the Ari of blessed memory which is self-sacrifice. And this is the main prayer as it is written \"Behold now I have taken upon myself to speak to the Lord though I am but dust and ashes\" which is self-sacrifice to dust and ashes through which I have taken to speak to the Lord. This is the introduction and beginning of prayer as mentioned above. And this is the explanation in the Shema \"Hear O Israel etc\" and you shall love the Lord your God with all your heart and with all your soul etc and these words which I command you today shall be upon your heart. For we find that the Holy One Blessed be He is called the heart of the children of Israel as brought in the Midrash and proven in the verse \"for it has touched your heart.\" This is what the Torah taught us that if you will be all day with the intention of self-sacrifice Shema Yisrael to give your soul in oneness like Rabbi Akiva who said \"when will it come to my hand that I may fulfill it.\" And this explains \"and you shall love etc with all your heart and with all your soul\" even if He takes your soul then \"these words shall be upon your heart\" which is the Holy One Blessed be He as our sages said the Holy One Blessed be He will be a crown on the head of every righteous person.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Festivals, Shabbat 15"
        }
    ],
    "timestamp": "2024-12-24T09:04:33.655251",
    "metadata": {
        "total_passages_processed": 94,
        "selection_criteria": "Passages with average score above 7.0",
        "scoring_version": "3.0"
    }
}