{
    "question": "עניין חלומות יוסף",
    "analyzed_passages": [
        {
            "source": "Tiferet Shlomo, Torah, Miketz 6",
            "relevant_sentences": "אין משפטים ישירים",
            "passage": "ויריצהו מן הבור. בזוה\\\"ק פ' מקץ דף קצד ע\\\"ב כגוונא דא יוסף הוה עציב כו'. יבואר עפ\\\"י מ\\\"ש רצון יראיו יעשה. כי הנה רצון הצי\\\"ע תמיד הוא להשפיע כל טוב לכנ\\\"י כי כן הוא מדת היסוד כמ\\\"ש ועל פיך ישק כל עמי. ע\\\"ד שאמרו חכז\\\"ל כל המחובר לטהור טהור. משיקין בכלי אבן לטהרו. כי כל עניני השפעות יורדים ע\\\"י הצדיק. וז\\\"ש התרגם על פיך ישק יתזן. לכן יוסף הצי\\\"ע בכל עת ההוא שהיה בבית הסהר לא היה יכול להוריד השפעות לכן היה עצוב כמו שעינינו הרואות מדרך הנדיבים אשר הם רודפי צדקות בימי עשרם. וכאשר נהפך להם מצוקות העתים בגלגל החוסר ואין ביכולתם להשפיע כמקדם הם בעצבות. ולזה עתה כאשר נצמח לו הישועה ויריצוהו מן הבור. לשון רצון והוא אותיות צנו\\\"ר להוריד השפעות כמקדם. וז\\\"ש פותח את ידך ומשביע לכל חי רצון. ידיך יודי\\\"ך רומז לחכמה פי' פתחה בחכמ\\\"ה כמבואר במ\\\"א. וז\\\"ש יעקב ואל שדי יתן לכם רחמים. כי בשם שד\\\"י העיקר הוא היו\\\"ד כי בלא יו\\\"ד כו'. וזה ג\\\"כ מ\\\"ש \\\"נוצר \\\"חסד \\\"לאלפים ר\\\"ת נח\\\"ל הוא חסד העליון נחל קדומים להשפיע לאלפים הם הלומדי תורה. וגם \\\"להדליק \\\"נר \\\"חנוכה ר\\\"ת נח\\\"ל כמבואר בהאר\\\"י ז\\\"ל שהוא שם קדוש ונורא ולזאת כאשר באו אחי יוסף שבטי י\\\"ה והיה היחוד בשלימות אמר להם שלום לכם אל תיראו כידוע כי מדות היסוד נקרא שלום ורמז להם כי מדתו היא מדת יסוד צדיק ואל תיראו אלהיכם וכו' נתן לכם מטמון באמתחותיכם הם השפעות טובות. אמן:",
            "explanation": "ביאור העניין הוא שיוסף הצדיק, בהיותו בבית הסהר, לא היה יכול להוריד השפעות טובות לישראל ולכן היה בעצבות, אך כאשר נצמח לו הישועה ויריצוהו מן הבור, נפתח לו הצינור להוריד השפעות טובות כמקדם, וזהו עניין חלומות יוסף שהיו מבשרים על השפעות טובות שעתידות לבוא על ידו."
        },
        {
            "source": "Tiferet Shlomo, Torah, Miketz 14",
            "relevant_sentences": "אין משפטים ישירים",
            "passage": "מכי\\\"קאם כנים אתם אחיכם אחד יאסר כו' ואתם לכו הביאו שבר רעבון בתיכם ואת אחיכם הקטן תביאו אלי ויאמנו דבריכם וכו'. הנה יש לשום לב על התימה הגדולה שכבר הקשו בה הראשונים ז\\\"ל למה לא הודיע יוסף לאביו כי עודנו חי והוא מושל בארץ מצרים. האמנם כי טרם באו אחיו אליו לא יכול להודיעו מפני החרם וקיום החלומות שהיו צריכין אחיו לבא אליו. אבל כאשר כבר באו אחיו הלום היה לו להתוודעות להם מיד למען החיות רוח אביו הזקן איזו ימים קודם ולא לצערו עוד יותר בבנימין כי לפי האמת מה צורך היה לו בבנימין לבא אליו תחלה למצרי'. אמנם הנה כבר נודע ומובא בזוה\\\"ק ובספרים כי כל ענין הזה של מכירת יוסף הוא רמוז על סודות נשגבים ונוראים. הנה כן יש לרמז בזה כי ענין גלות יוסף למצרים ואשר התוודע אל אחיו וכל הענין הכל הוא ברמז על גלות האחרון ועל הגאולה שאנו מחכים אליה במהרה. והנה ביאת בנימין למצרים ואח\\\"כ התוודע יוסף אל אחיו זה רומז על אליהו הנביא כמו שכתוב בספר הגלגולים שנשמת אליהו הנביא שיורדת לעוה\\\"ז הוא נשמת בחי' בנימין כמו שאמר אליהו לחכמים מבני בניה של רחל אני. והוא שכתוב הנה אנכי שולח לכם את אליה הנביא לפני בא יום ה' כמו שבגלות מצרים הוצרך בנימין לבא לפני התוודעו' יוסף. והנה יוסף הוא רמוז על משיח בן יוסף וז\\\"ש האיש אשר נמצא הגביע בידו הגבי\\\"ע גימ' צ' כמבו' בזוה\\\"ק כי בנימין הוא צדיק במקום יוסף דהיינו יסוד של יעקב כמ\\\"ש אלה תולדות יעקב יוסף כנודע. וז\\\"ש הגבי\\\"ע ביד\\\"ו ביו\\\"ד הוא יסוד. וז\\\"ש הוא יהיה לי עבד הוא רמז על העתיד כמ\\\"ש ביום ההוא יהיה ה' אחד. כי לעתיד יהיה השם בשני יודי\\\"ן וזה הו\\\"א יהי\\\"ה. והנה זה שכתוב והוא נחש ינחש בו כי נחש ינחש איש אשר כמוני נחש גימט' משי\\\"ח כי כשנשכח הנו\\\"ן של נח\\\"ש נעשה משי\\\"ח וזהו נחש בן יוסף הוא משיח בן יוסף כנ\\\"ל איש אשר כמוני כמו יוסף שהיה בגלות ואח\\\"כ למחיה שלחני אלהים לפניכם ויכלכל יוסף את אחיו. הים ראה וינס ארונו של יוסף ראה. כן המשיח של העתיד. ובהגלות הוא חליינו הוא נשא והיינו חבלו של משיח כמבואר בזוהר ובספרים. ולזה הטמין הגביע באמתחת בנימין שהוא נשמת אליהו הנביא. וזה שמסיים אח\\\"כ ואתם עלו לשלום אל אביכם. היינו שע\\\"י בנימין ויוסף שהוא אליהו ומשיח בן יוסף עלו לשלום אל אביכם יהיה הגאולה ב\\\"ב. ואח\\\"כ ויגש אליו יהודה היינו משיח בן דוד שבא מיהודה. כי משיח בן יוסף הוא תיקון היסוד של כל העולמות ומשיח בן דוד הוא יתקן ספירת המלכות שהוא שם אדנ\\\"י כנודע והאר פניך על מקדשך השמם למען אדני היינו שם אדנ\\\"י שהוא בית המקדש. ולזה היה שבט יהודה ובנימין שותפים בחלק הבהמ\\\"ק כמבואר בתנ\\\"ך ובגמרא שחלקו של יהודה היה אוכל אמה במזרח ודרום של המזבח שזה מרמז לעתיד שע\\\"י שניהם אליהו ומשיח יהי' הגאולה ב\\\"ב. גם מבואר בספר הגלגולים שגם נשמת יוסף היה באליהו ונשמת בנימין היא היורדת לצדיקים ולומד עמהם ועושה נסים לצדיקים ולזה הוצרך לבנימין למצרים קודם התוודעות יוסף לאחיו שהוא הגאולה באותו הזמן. ולזה אמר לו אלהים יחנך בני. וזהו ותרב משאת בנימין היינו שיוסף נתן לו חלק מנשמתו כנ\\\"ל. ולזה במרדכי ואסתר שהיה איש ימיני נאמר וגם חרבונה זכור לטוב ואמרו חכז\\\"ל שזה היה אליהו כי הוא איש ימיני כנ\\\"ל. וזהו הרמז במס' בבא בתרא דף י\\\"א בבנימין הצדיק שהחיה אשה ושבעה בניה. היינו בנימין שהיה צדיק במקום יוסף כנ\\\"ל החיה השכינה ושבעה ימי הבנין שלה מחסד עד המלכות. והבן:",
            "explanation": "ביאור העניין הוא שהסיבה שיוסף לא הודיע לאביו על קיומו היא מפני שהאירועים סביב מכירתו וגלותו למצרים רומזים על סודות נשגבים הקשורים לגאולה העתידית, וביאת בנימין למצרים והתוודעות יוסף לאחיו רומזים על תפקידו של אליהו הנביא ומשיח בן יוסף בתהליך הגאולה, ולכן היה צורך בהשלמת כל התהליך הזה כדי לקיים את הרמזים והסודות הללו."
        },
        {
            "source": "Tiferet Shlomo, Torah, Miketz 7",
            "relevant_sentences": "אין משפטים ישירים",
            "passage": "ויאמר פרעה אל יוסף אני פרעה ובלעדיך לא ירים איש את ידו ואת רגלו בכל ארץ מצרים. הנ\\\"ל לרמז בזה דהנה סוד ענין יוסף שגלה למצרים ערוות הארץ כי בחי' יסוד דקדושה יתגבר ויתעלה על יסוד דטומאה. והנה זהו היה עבודתו במצרים לבטל כחות יסוד דטומאה שזהו נקראת בחי' ערוות הארץ שהיה בחי' יסוד דקליפה. ולכך המצרי' היו שטופי זמה. והנה זהו שהיה בבית פוטיפרע דוקא שהוא שר הטבחים כי בחי' שר הטבחים מבו' בזוה\\\"ק ובהאר\\\"י ז\\\"ל שהוא בחי' הוורידין נגד קו האמצעי בסוד הדעת לכן רק שם היתה עבודתו שלימה לבטל כח הדעת ויסוד דקליפה ולא יצא משם עד שבטלו. וזהו סוד ענין שנסתרס הרמז שיוסף עקרו מכל וכל כמבואר כן בספרים הקדושים ובספרא דצניעותא דצניעותא. וזהו ענין הצרעה שאמרו חכז\\\"ל שהיתה זורקת בהם מרה ומסרסתן כי כן הכנענים הם ממדה זו לכן בפ' העריות התחיל הכ' כמעשה ארץ מצרים וכמעשה ארץ כנען אשר אני מביא אתכם שמה כו' כי תועבת ה' גם שניהם והם קרובים זה לזה כנ\\\"ל. וזהו בסוד קדושת ישראל והיו עוקרים ומבטלים כח יסודם בטומאה והיו נסתרסים ע\\\"י הצרעה כנ\\\"ל. וזהו היתה עבודת יוסף הצדיק כל הימים. וזהו וירא יעקב כי יש שבר במצרים כי כן כתיב ומצבותם תשברו. וזהו שראה כי יש שבירה בקליפת מצרים.וזהו בפוטיפרע הרמז כי נצח בחי' הדכר דקליפה ונסתרס אבל בחי' הנקיבה קשה ממנו כמ\\\"ש כן באוה\\\"ח במעשה החלום הנראה אליו ע\\\"ש בפ' ויחי ע\\\"פ אסרי לגפן וכו'. ולכך כשרצה ג\\\"כ לבטלה ויבא הביתה לעשות מלאכתו כנ\\\"ל. אבל וינס ויצא החוצה וזש\\\"א הכתוב לאסור שריו בנפשו כי אסר השרים וכחות הטומאה תחתיו. וזהו וילקט יוסף את כל הכסף הנמצא בארץ מצרים ובארץ כנען. כסף לשון נכסוף ותאווה היינו תאוות הניאוף שלהם בטל מהם וזהו שהביא ביתה פרעה הוא רומז לעולם הבינה כמבו' בסה\\\"ק שהחזיר ותיקן הכל לשרשו כו'. וזהו שצוה לבסוף להמצרים שימולו כי תיקן יסוד דקליפה והחזיר הכל לקדושה ומזה היה ערב רב שנתערבו בישראל. וז\\\"ש אני פרעה היינו רמז לעולם הבינה ובלעדיך לא ירים איש את ידו הוא יו\\\"ד בחי' יסוד ואת רגלו ג\\\"כ בחי' יסוד היינו שלא ירים עוד היסוד דקליפה. וזהו וישימני לאב לפרעה ולאדון לכל ביתו. הנה בחי' אב הוא רצון ובחי' אב בחכמה כמ\\\"ש ויקרא לפניו אברך. לפרעה בחי' בינה. ולאדון ולכל ביתו. בחי' ביתו ידוע. ומושל בכל ארץ מצרים כמ\\\"ש והיתה לה' המלוכה ומושל בגוים. והבן:",
            "explanation": "ביאור העניין הוא שיוסף הצדיק במצרים פעל לבטל כוחות הטומאה ולהעלות את הקדושה, ובכך גילה את ערוות הארץ והפך את יסוד הטומאה ליסוד דקדושה, וזהו סוד חלומותיו שהראו את עליונותו הרוחנית ואת תפקידו בהנהגת מצרים."
        },
        {
            "source": "Tiferet Shlomo, Torah, Vayeshev 3",
            "relevant_sentences": "אין משפטים ישירים",
            "passage": "אלה תולדות יעקב יוסף. נקדים מ\\\"ש לפרש המאמר בווין תתקטר. עפ\\\"י הידוע כי גדול כח הצדיק השומר ברית קודש שהוא הצנור מכל השפעות טובות שיורדים לעולם. ובשעת בריאת העולם הי' רצונו ית\\\"ש שיהי' בכל דור ודור צי\\\"ע בחי' יסוד. וז\\\"פ בווין תתקטר רמז לצי\\\"ע יעקב ויוסף הם ב' ווי\\\"ן. וז\\\"ש בנוסח תפלת שמ\\\"ע אלהי אברהם אלהי יצחק ואלהי יעקב וי\\\"ו יתירה רומז להנ\\\"ל. וזהו בווין תתקטר. כביכול השכינה הקדושה רודפת אחר הצדיק הזה להאחז בו כדי שירדו ההשפעות על ידו לכנ\\\"י. כמ\\\"ש ותתן טרף לביתה. טר\\\"ף רמז לרפ\\\"ח ניה\\\"ק שנפלו לסט\\\"א ועי\\\"ז הם חוטפים ההשפעות. והשכינה היא מצלת מידם ונותנת הטרף לכנ\\\"י ע\\\"י הצדיק יסוד עולם. וזה הענין מצינו ביוסף הצדיק כמ\\\"ש רב עוד יוסף בני חי. פי' כי יוסף העלה רב ניצוצות ממנין רפ\\\"ח ולא נשאר רק פ\\\"ו כמנין אלהי\\\"ם וע\\\"ז הוא כל העבדות בנ\\\"י לגמור תיקונם להעלותם עד ביאת הגואל ב\\\"ב. וז\\\"ש כי יש שבר במצרים כי מגודל כח קדושתו של יוסף שעמד בניסיון בהיותו במצרים ערוות הארץ. וזה ג\\\"כ לשבור בר רמז על ר\\\"ב ני\\\"ק כנ\\\"ל. וע\\\"י הצי\\\"ע יש שמחה למעלה בעולמות העליונים לאין שיעור כי נתגדל ונתקדש שמו הגדול כמ\\\"ש ונגדלך ונשבחך ונפארך. וז\\\"ש ואתם הדביקים בה' אלהיכם חיים כולכם היום. פי' שהם המיחדים ועושים הדביקות בשם הוי' ב\\\"ה. וזהו הרמז באות וא\\\"ו בתוך הב' ווין אות א' עולה י\\\"ג כנגד י\\\"ג מכילין דרחמי. וז\\\"ש ר' ישמעאל אומר בשלשה עשרה מדות שהתורה נדרשת בהן. פי' אם הוא בבחי' זו להיות בבחי' צי\\\"ע לעשות היחוד בי\\\"ג מדות אזי התורה נדרשת בהן. פי' שהקב\\\"ה כביכול דורש התורה משמו כמ\\\"ש ואתה דורש מעשה כולם. כמ\\\"ש בגמ' מאיר בני אומר. אליעזר בני אומר. וז\\\"ש אשר יעשה אותם האדם וחי בהם אני ה'. כביכול החיות שלו מגודל קדושת בנ\\\"י הצדיקים. יסודי עולם אתם אותיות אמת. וזה הענין מ\\\"ש כי בן זקונים הוא לו. זקן אהרן שיורד על פי מדותיו. זקן הוא עולם הזקנה כמ\\\"ש עד אברהם לא הי' זקנה. ר\\\"ל שלא הי' מי לעורר אותו העולם. והצדיק אשר הוא במדריגה זו הוא המנהיג ומשפיע לכל הדור ההוא אף בזמן הגלות. וז\\\"ש נוהג בארץ ובחוץ לארץ וכן מצינו ביוסף הצדיק שהי' במצרים לעבד נמכר יוסף כשעמד בניסיון הזה הי' מביא נ\\\"ר בכל העולמות בשעת הניסיון. ופוק חזי מה עלתה בו שמו אדון לביתו ומושל בכל ארץ מצרים. אך אין להסתכל על תכלית המעלה והגדלות שלו רק על הניסיון אשר עמד בו וקיים כל העולם בזה אף אחרי מותו כמ\\\"ש הים ראה וינס ארונו של יוסף ראה. וזה ג\\\"כ פי' הכ' וכל אשר הוא עושה ה' מצליח בידו. פי' שם הוי' הי' מצליח בידו. כמ\\\"ש אנא ה' הושיעה נא. אנא ה' הצליחה נא. וזה ג\\\"כ מצליח בידו הוא יו\\\"ד אשר גם תוכו הוא אות וי\\\"ו ויו\\\"ד רמז לחכמה. כי כתר הוא קמץ כידוע לי\\\"ח והחכמה הוא פתח. פי' הפ' פיה פתחה בחכמה רמז להנ\\\"ל. פותח את ידיך יודי\\\"ך. וכח הצדיק לעורר עולם החכמה ולהביא כל השפעות טובות הן במילי דשמיא ובמילי דעלמא כל השפעות טובות לכלל ישראל אמן:",
            "explanation": "ביאור העניין הוא שיוסף הצדיק, בכוח קדושתו ושמירתו על ברית הקודש, היה הצינור להורדת השפעות טובות לעולם, ובכך העלה ניצוצות קדושה והביא שמחה בעולמות העליונים, וזהו עניין חלומותיו שהיו רמז למעלתו ולתפקידו בהשפעת השפע האלוקי על כלל ישראל."
        },
        {
            "source": "Tiferet Shlomo, Torah, Vayeshev 6",
            "relevant_sentences": "\"וכן נאמר אצל יוסף כשהתחיל להתנשא ויאמרו לו אחיו המלוך תמלוך עלינו. כי אי אפשר לך זה רק אחר השבירה והירידה מתחלה לכך ויוסף הורד מצרימה ומשם הוא נתעלה אח\\\"כ ונתקן למלוך\"",
            "passage": "במס' ברכות דף כ\\\"ז. כשמינוהו את ר' אלעזר לנשיא א\\\"ל איזיל ואימלך באינשי ביתי' אזיל ואמליך בדביתהו. אמרה לי' דלמא מעברין לך. א\\\"ל יומא חדא לישתמש אינש בכסא דמוקרא ולמחר ליתבר א\\\"ל לית לך חיוורתא ע\\\"ש בגמ'. הנראה לרמז בזה בדבריהם ז\\\"ל כי הנה בכל דבר מעלה ומדריגה טרם תתנשא על מכונה צריך להיות לה בחי' שבירה בתחלה כמו שהי' זה בשעת בריאת העולם בראשית ברא כו'. והארץ היתה תהו ובוהו כי בתחלת הבריאה לא יכלו לסבול את האור הגדול ונשברו ונעשו בחי' תהו ואח\\\"כ נתקנו ויאמר אלהים יהי אור כי עיקר התיקון על מכונו או\\\"א להיות רק אחר השבירה והירידה מתחלתו והירידה היא צורך העלי'. וכן נאמר אצל יוסף כשהתחיל להתנשא ויאמרו לו אחיו המלוך תמלוך עלינו. כי אי אפשר לך זה רק אחר השבירה והירידה מתחלה לכך ויוסף הורד מצרימה ומשם הוא נתעלה אח\\\"כ ונתקן למלוך אמנם בחי' התיקון אחרי השבירה זה בא ע\\\"י בחי' זקן שהוא מבחי' אריך ועתיק והוא בא ע\\\"י י\\\"ג מדות שהאור עובר בהם בבחי' מדה וצמצום. וזהו הענין שהי' אצל הלוחות שהלוחות הראשונים ניתנו בפומבי ובשפע האור הרב ולכך נשברו. אבל בהלוחות השניות נאמר אצלם הי\\\"ג מדות ושכותי כפי עליך שהי' האור בחי' צמצום ומסך מעט ושם נאמר פסל לך שני לוחות אבנים כראשונים. וזה הענין בגדלות ראשון וגדלות שני האמור בכתבי האריז\\\"ל כי ההארה צריך לעבור דרך דרגין כיל\\\"ח. וזה הענין שאמרו בגמ' כי האדם במעי אמו מתחלה הוא יודע כל התורה ואח\\\"כ בצאתו בא מלאך וסטרו על פיו ומשכח הכל כי כן צריך להיות בחי' ההארה והידיעה באדם מתרבה והולכת עמו מעט מעט כפי שניו דרך דרגין דאם לא כן לא הי' יכול לסבול את האור הגדול הקודם. ולכך בא מלאך וסטרו על פיו הוא בחי' השבירה כמו שנתבאר. הנה זה הענין אצל ר\\\"א בן עזרי' כשבא להיות נשיא פתאום א\\\"ל דלמא מעברין לך כי ההתנשאות צריך להיות בחי' שבירה בתחלה כנ\\\"ל. וזה שא\\\"ל יומא חדא לישתמש אינש בכסא דמוקרא ולמחר ליתבר. כי אחרי הבריאה מתחלה בחי' יום אחד ולמחר ליתבר נעשה השבירה. וזה שא\\\"ל והא לית לך חיוורתא כי צריך להמשיך מבחי' י\\\"ג מדות חוורתי כמו שהי' אצל יוסף בצאתו לאסור שריו בנפשו וזקניו יחכם מהזקן עד החכמה זקן זה שקנה חכמה. וזה שאמרו שם ההוא יומא בר י\\\"ח שנין הוה אתעביד לי' ניסא ואהדרי לי' תמני סרי דרי חיורתא. הוא כמו שנתבאר בע\\\"ח בחי' ברכאין. וזהו רמז על י\\\"ג תקוני דיקנא דא\\\"א וה' ראשונים שלו כיל\\\"ח ע\\\"ש.וזהו תמני סרי דרי חיוורתא מבחי' הזקן שלמעלה כמו שנתבאר:",
            "explanation": "ביאור העניין הוא שחלומות יוסף והירידה למצרים מסמלים את השבירה והירידה ההכרחית לפני ההתנשאות והמלוכה, כפי שנאמר \"כי אי אפשר לך זה רק אחר השבירה והירידה מתחלה לכך ויוסף הורד מצרימה ומשם הוא נתעלה אח\"כ ונתקן למלוך\", ללמדנו שהירידה היא צורך העלייה והתקון."
        },
        {
            "source": "Tiferet Shlomo, Torah, Vayeshev 5",
            "relevant_sentences": "אין משפטים ישירים",
            "passage": "א\\\"י וישראל אהב את יוסף מכל בניו. הנראה בענין יוסף ואחיו וקנאתם ושנאתם בו. כי יוסף הי' בחי' היסוד והי\\\"ב שבטי י\\\"ה כולם היו בחי' י\\\"ב צרופי הוי' כידוע. אשר לכל צירוף הוא עבדות אחרת כמ\\\"ש צרופה אמרתך מאד. אך בחי' יוסף הוא היסוד והצנור המקבל מכל צרופי הוי' כי לית לי' מגרמי' כלום רק מה שמשפיע לו ממדות העליונות וע\\\"י שהמדות משפיעים ליסוד הוא נעשה משפיע למטה ומכוחם נעשה. לכן בסדר תולדות השבטים נולד יוסף באחרונה הוא רמוז ליסו\\\"א כנודע. ויוסף הוא בחי' שבת שהוא שביעי לימי המעשה והוא האחרון ולא ראשון של ז' ימים מפני כי הוא בחי' היסוד ומוכרח להיות באחרונה כי הוא ניתקן ע\\\"י ז' ימי המעשה הקודמים לו. לכן השבת אין לו בן זוג רק ע\\\"י כח המעשה הטוב של ימי המעשה. וז\\\"ש וברכתו מכל הימים. הברכה באה ע\\\"י שפעת הימים ביסוד וינוחו בו כל ההשפעות. ובכן זהו הי' ענין יוסף ואחיו זהו שאמר להם והנה תסובינה אלומותיכם ותשתחוין לאלומתי. רמז להם כי אך כל עניניו באו מכחם והוא צריך להם להשפיעו על ידם. וז\\\"ש ותשתחווין לאלומתי רמז להיחוד והורדת השפע כידוע מכוונת השתחוואות של שמ\\\"ע. אבל לא נתכוון יוסף להשתרר עליהם או למלוך על אחיו ונהפוך הוא כי הוא חלק הכבוד להם להיותם משפיעים בו ולית לי' מגרמי' כלום. אבל הם חשבו בו כוונה אחרת לכך שנאוהו. אבל ישראל אהב את יוסף מכל בניו ר\\\"ל אהב ותיקן היחוד את יוסף במה שמקבל השפע מכל בניו אשר הם משפיעים לבחי' היסוד כנ\\\"ל:",
            "explanation": "ביאור העניין הוא שיוסף, בהיותו בחינת היסוד המקבל השפעה מכל השבטים, רמז בחלומותיו על תפקידו כמקבל השפע מהם ולא כמתכוון להשתרר עליהם, ולכן ישראל אהב אותו על היותו מקבל השפע מכל בניו, בעוד שאחיו חשבו בו כוונה אחרת ושנאוהו."
        },
        {
            "source": "Tiferet Shlomo, Torah, Miketz 12",
            "relevant_sentences": "\"א\\\"י בדרך הנ\\\"ל. ויזכר יוסף את החלמות אשר חלם להם.\"  \n\"וז\\\"ש וישראל אהב את יוסף מכל בניו. כי מדתו של יוסף היה ג\\\"כ מדת היסוד והוא שאב השפע מכל השבטים ומשפיע להם.\"  \n\"וז\\\"ש כאן ויזכר יוסף את החלמות אשר חלם להם. בחי' צדיק יסוד עולם רמז על חל\\\"ם כנ\\\"ל.\"",
            "passage": "א\\\"י בדרך הנ\\\"ל. ויזכר יוסף את החלמות אשר חלם להם. ע\\\"ד המובא בספרים כי נקודת חולם הוא הגבוה מכל הנקודות רמז לבחי' יסוד כמו הלולב שהוא גבוה במינו כאשר בחי' היסוד שהוא למעלה משבע ספירות והוא המשפיע לכולם. וכן הענין הוא בשבת הוא האחרון משבעת ימי בראשית והוא המשפיע לכל ששת הימים כנ\\\"ל. וזה הרמז בגמ' תדיר ומקודש תדיר קודם רמז לששת ימי המעשה שהם הקודמים ליום השבת שהוא המקודש והוא המשפיע לכל ששת הימים כנ\\\"ל. וז\\\"ש וישראל אהב את יוסף מכל בניו. כי מדתו של יוסף היה ג\\\"כ מדת היסוד והוא שאב השפע מכל השבטים ומשפיע להם. וז\\\"ש להם והנה תסובינה אלמותיכם כו'. אך הם הבינו כפשוטו לכן אמרו המשול תמשול בנו וכו'. אך אביו שמר את הדבר כי כן צריך להיות בכל דור צי\\\"ע צנור השפעות כמ\\\"ש חנון ורחום וצדיק. וז\\\"ש כאן ויזכר יוסף את החלמות אשר חלם להם. בחי' צדיק יסוד עולם רמז על חל\\\"ם כנ\\\"ל. ויזכר לשון השפעה בחי' דכר. ויאמר שימו לח\\\"ם אותיות חל\\\"ם בבחי' מזל\\\"א עולה לחם בגימ' ג' הויות כנ\\\"ל:",
            "explanation": "ביאור העניין הוא שיוסף, בהיותו בעל מדת היסוד, זכר את החלומות כרמז להשפעתו על אחיו, שכן מדתו היא לשאוב השפע ולהשפיעו לכל השבטים, וכך חלומותיו היו ביטוי למעלתו כצדיק יסוד עולם, המשפיע לכל דור ודור."
        },
        {
            "source": "Tiferet Shlomo, Torah, Miketz 11",
            "relevant_sentences": "\"ויזכר יוסף את החלמות אשר חלם להם כו'.\"\n\n\"וזה היה ענין החלם שהיה בכחו של יוסף להפוך על אותיות לחם להשפיע להם כל טוב אם היו אז השבטים מסכימים עמו בתחלה.\"\n\n\"את החלמות אשר חלם להם. להפוך לטוב להביא להם השפעות הרומז ללח\\\"ם כנ\\\"ל לזה אמר שימו לחם.\"",
            "passage": "ויזכר יוסף את החלמות אשר חלם להם כו'. הנ\\\"ל לרמז בזה עפ\\\"י מ\\\"ש חכז\\\"ל בני חיי ומזוני לאו בזכותא תליא מלתא אלא במזלא. מזל\\\"א עולה ע\\\"ח בגימט' לחם כמנין ג' הויות. וזה היה ענין החלם שהיה בכחו של יוסף להפוך על אותיות לחם להשפיע להם כל טוב אם היו אז השבטים מסכימים עמו בתחלה. אך עתה כאשר באו אחי יוסף היה היחוד בשלימות כתיב ויזכר יוסף כו' לשון זכרות והשפעה. את החלמות אשר חלם להם. להפוך לטוב להביא להם השפעות הרומז ללח\\\"ם כנ\\\"ל לזה אמר שימו לחם. רמז שם יו\\\"ד שיהיה השפע מן הקדושה. כמ\\\"ש פותח את ידיך יודי\\\"ך. ואז תרד ההשפעה רק לזרע קודש בנ\\\"י. כמ\\\"ש וישימו לו לבדו ולהם לבדם ולמצרים האוכלים אתם לבדם כי לא יוכלון המצרים כו' כי מנע מהם השפע לבל יבוזו זרים כנ\\\"ל. ובזה יש לרמז מ\\\"ש בגמ' שבת דף ך\\\"א ע\\\"ב. בשעת הסכנה מניחו על שולחנו ודיו. לרמז על ההשפעות ופרנסות בנ\\\"י שיהיה בניקל כמ\\\"ש כי לא במסכנות תאכל בה לחם. וזה מניחו על שלחנו הוא שפע הפרנסה. ודי\\\"ו אותיות יו\\\"ד פותח את ידך וכו' כנ\\\"ל:",
            "explanation": "ביאור העניין הוא שיוסף זכר את חלומותיו והבין שבכוחו להפוך את אותיות \"חלם\" ל\"לחם\", כלומר להשפיע טוב וברכה על אחיו, ואם היו השבטים מסכימים עמו מתחילה, היה יכול להפוך את החלומות לטוב ולהביא להם שפע, ולכן אמר \"שימו לחם\" כרמז להשפעה מן הקדושה."
        },
        {
            "source": "Tiferet Shlomo, Torah, Vayeshev 4",
            "relevant_sentences": "\"ונחזור לענינינו. הנה כי זה הי' סוד כתונת יוסף שעשה לו אביו כתונת פסים.\" \n\n\"וזה שהשיב להם יוסף והנה תסובינה אלומותיכם ותשתחוין לאלומתי.\" \n\n\"וזה הי' עיקר הפגם של השבטים במכירת יוסף.\" \n\n\"וז\"ש יעקב כתונת בני חי' רעה אכלתהו טרוף טורף יוסף.\"",
            "passage": "וישראל אהב את יוסף מכל אחיו ועשה לו כתונת פסים. ויקנאו בו אחיו וכו'. בגמ' שבת דף י' בשביל משקל ב' סלעים מילת שנתן יעקב ליוסף יותר משאר בניו נתקנאו בו אחיו ונתגלגל הדבר וירדו אבותינו למצרים. הנה הדברים האלו לפי פשוטן אין להם שחר. האם יתכן בקדושי עליון שבטי י\\\"ה כי יתקנאו עבור ב' סלעים מילת וכתונת. אמנם שורש הענין הוא ע\\\"ד שכתוב והבדילה הפרכת לכם בין הקודש ובין קודש קדשים למה הוצרך עוד הפרכת להבדלה הלא כבר מקודש החצר והמשכן עד מאד ומה תוסף עוד הפרכת להבדלה יכול להיות קדשי קדשים בלא הבדלה מהפרכת. אולם להבין זה הנה ידוע לי\\\"ח מענין הצמצום הרבים אשר בשעת בריאת עולם כדי שיוכלו העולמות למטה. להכיל אור א\\\"ם ב\\\"ה כי יש כמה וכמה אלפים ורבבות עולמות למעלה מעולם האצילות בבחי' לבושים זה בתוך זה וכן בד' עולמות אבי\\\"ע יש בהם שבא האור ההוא למטה דרך חלון ומסך ולבוש והיכלות כי זה בלא זה לא היו יכולין לקבל האור המתנוצץ עד עולם העשי' וממנו לעולם השפל הזה ג\\\"כ כזה כי שמש ומגן ה' כו' ד\\\"מ כמו אור השמש אשר לא יוכלו הבריאים להנות ממנו ולקבל אורו הגדול רק ע\\\"י מעבר החלון ומסך והיכלות. והנה בזמן שהי' בהמ\\\"ק קיים ואור ה' הופיע על הבהמ\\\"ק בקדשי קדשים בשפע רב לא הי' העולם יכול לסבול ולקבל האור היוצא בביהמ\\\"ק לכן הוצרך הפרכת להבדלה ד\\\"מ למען יוכלו הבריות לקבל אור השפע העליון אחרי מסך הפרכת והאולם וההיכל. וכן הי' הענין בבגדי כהונה (של)הכה\\\"ג חושן אפוד וכתונת וכו' להיות דוגמת האדם העליון והאורות החסדים בוקעים ומאירים בו הוצרך לבגדים יתירים האלו כמבואר בכתבי האריז\\\"ל סוד הלבושים. אך כאשר נכנם לפני ולפנים הי' לבוש רק ד' בגדים דוגמת ד' עולמות אבי\\\"ע. ולכך כה\\\"ג המחוסר בגדים פסול לעבודה. וזה הי' ג\\\"כ ענין הכתוב ופרשו עליו בגד תכלת וכסו בה את ארון העדות. בהיות הארון מקום השראת הקדושה האור העליון הוצרך הכיסוי תכלת שהוא בחי' צמצום כי תכלת דומה לכסא כבוד בחי' היראה כמבואר בזוה\\\"ק דתכלת היא תכלא דשצי כולא והוא בחי' גבורה והוא בחי' לבוש לצמצם האור כנ\\\"ל. וזה ג\\\"כ ענין המשמורות כהונה ולווי' שהיו בבהמ\\\"ק כי גם הלוים הי' בבחי' גבורה וצמצום על אור החסד שהיו הכהנים משפיעים לבל יצאו החוצה ואל יבוזו זרים והוא הענין התכלת האמור בציצית ונתנו על ציצית הכנף פתיל תכלת. שאור הציצית יהי' בחי' צמצום נגד החיצונים. כי ע\\\"ז מורה ענין התכלת בחי' גבורה וצמצום. וז\\\"ש בלשם יחוד בעטיפת הטלית. ובזכות מצות ציצית תנצל נפשי וכו' והטלית יפרוש כנפיו עליהם. כי הטלית הוא בחי' אור המקיף להנצל מן החיצונים. ולכך מתעטפין בטלית בשעת התפלה על התפילין לצמצם האורות של התפילין. וזש\\\"א מה יקר חסדך וכו' ואח\\\"כ משוך חסדך ליודעיך פי' אחר שנתעטף בטלית לצמצם החסדים מן החיצונים אז משוך חסדך ליודעיך כנ\\\"ל. ונחזור לענינינו. הנה כי זה הי' סוד כתונת יוסף שעשה לו אביו כתונת פסים. ומבואר במדרש שעשה לו ד' בגדים הרמז סוד לבושים הנ\\\"ל שהי' כה\\\"ג לובש בהם כי אמנם ידוע היות יוסף בחי' היסוד מכל העולמות צי\\\"ע והוא צנור ההשפעות. וכח הצדיק לצמצם ההשפעות לבל יתפשטו בין החיצונים כמ\\\"ש כי בן זקונים הוא לו. וזה שעשה לו אביו כתונת פסים ד' לבושים הנ\\\"ל בסוד ד' עולמות אבי\\\"ע כי יעקב ויוסף הם הצי\\\"ע כמ\\\"ש בווין תתקטר תרין ווי\\\"ן לכך הי' צריך הלבוש להיות נעשה ע\\\"י יעקב בעצמו לקשר ולדבק בו בחי' צי\\\"ע ולהיות מסך להשפעה העוברת על ידו להשמר מן החיצונים כמ\\\"ש שומר ה' את כל אוהביו. דלכאורה תיבת כל הוא מיותר. אך ידוע כי כל רומז לצי\\\"ע וכאשר הש\\\"י שומר ההשפעות ע\\\"י בחי' כל הוא הצדיק. אזי ממילא כל הרשעים ישמיד וכידוע ענין סוד כתונת אור של אדה\\\"ר להיות בסוד הלבישה כנ\\\"ל. וזה שאמרו חכז\\\"ל גנזו לצדיקים לע\\\"ל שהאור הראשון נגנז לצדיקי הדור שירדו ההשפעות על ידם וממילא הם נשמרים מן החיצונים והיא הגנוזה בהם. והוא שמצינו אצל רבקה ותקח את בגדי עשו בנה החמודות שחמד אותם מנמרוד שהי' לו מאדה\\\"ר וע\\\"י הקלקול באו לידי עשו. ורבקה נתכוונה להוציאם מידו להלביש את יעקב בנה הצדיק כי לו יאתה לקחת אותם. והנה בהיות הכרח סוד הלבושים האלו ליוסף להיות מסך נגד האור והחסד העובר על ידו לכן קנאו בו אחיו. באמרם כי גם המה בחי' צי\\\"ע. וזה שהשיב להם יוסף והנה תסובינה אלומותיכם ותשתחוין לאלומתי. כי הכל תלוי בו. כי הצדיק הוא העמוד שהעולם קיים על ידו והם לא האמינו לדבריו והפשיטו את כתנתו את כתונת הפסים והוא הי' עיקר הפגם של השבטים במכירת יוסף. וזו שהשמיענו הכתוב בזה שהפשיטו את כתנתו לומר שרצו לקחת ממנו בחי' הלבושים הנ\\\"ל לכך באו לכל הצרה הזאת ולולי כי הפשיטו את כתנתו לא הי' להם כח להזיקו במכירתם. אך מחמת כי הפשיטו את כתנתו הורידו את השפע לחיצונים. כמ\\\"ש להלן וישבו לאכול לחם וכו' וגמליהם נושאים כו' הולכים להוריד מצרימה פי' ההשפעות הלכו למצרים וז\\\"ש והשליכו אותו הבורה והבור ריק אין בו מים. ודרשו רז\\\"ל אבל נחשים ועקרבים יש בו. תיבת אותו רומז לבחי' אות ברית צי\\\"ע כי המדה זאת ירד להחיצונים. ולזה ויברך ה' את בית המצרי בגלל יוסף. וז\\\"ש יעקב כתונת בני חי' רעה אכלתהו טרוף טורף יוסף. לפי פשוטו אין הבנה לזה איך יצא מפיו של אותו צדיק דבר אשר לא כן הי' כי באמת הי' יוסף חי במצרים. אך לפי הנ\\\"ל הפי' בזה כי מפני שהפשיטו את הכתנת בחי' הלבוש כמ\\\"ש כתונת בני שעשה לו יעקב בעצמו בחי' לבוש כנ\\\"ל טרוף טורף יוסף רמז לרפ\\\"ח ני\\\"ק ובגלות הוא נטרף לחיצונים. וזה שהתמרמר יעקב אבינו כי ארד אל בני אבל שאולה. ר\\\"ל כי אצטרך לירד להוציא מהם ההשפעות והני\\\"ק שנפלו. וז\\\"ש ויבך אותו אביו בחי' או\\\"ת כנ\\\"ל ולכך כאשר נדחה השפע לחיצוני' לכן נשארו השבטים חסר לחם. ויוסף בהיותו בגלות הי' רוצה לעשות לו בעצמו לבושים ולא הועיל כדכתיב ותתפשהו בבגדו כו' פי' בגד שלו. אבל בבגד של אביו לא הי' לה שליטה. וזה ויעזוב בגדו בידה וינס ויצא החוצה. כידוע ענין עשרה הרוגי מלכות שנתגלגל עי\\\"ז כיל\\\"ח אך כאשר יצא יוסף מבית האסורין כתיב ויגלח ויחלף שמלותיו כי אז חזר בחי' הלבושי' ע\\\"י אורו עוטה כשלמה כמו שהי' בתחילה. וז\\\"ש יוסף לפרעה בלעדי אלהים יענה את שלום פרעה. כי כאשר היניקה יורד להחיצונים הוא בחי' אלקים. וז\\\"ש יוסף בלעדי אין לך משלי כלום כי אני מבחי' הוי'. רק אלהים יענה את שלום פרעה היניקה שלך הוא מבחי' אלקים. אשר נמשך החיות לבהמות וחיות אפי' הטמאות כמ\\\"ש ר' אליעזר אפי' בהמה טמאה נפשה לשמים. החיות שלה מבחי' אלקים ע\\\"י צמצום והשתלשלות עד אשר נעשה חלילה אלקים אחרים וחיצונים ר\\\"ל. אולם אח\\\"כ כשבאו אחי יוסף ונעשה היחוד וצירוף בשם הוי' וחזר בחי' היסוד אז אמר יוסף שימו לחם סוד ג' הויו\\\"ת. וז\\\"ש ויתן להם לבדם ולמצרים לבדם כי לא יוכלון המצרים לאכול את העברים לחם כי תועבה הוא למצרים. ר\\\"ל כי המצרים ניזונים מבחי' אלקים אחרים ובישראל כתיב לא תאכל כל תועבה. וזה שאמר יוסף חי פרעה אם תצאו מזה. ר\\\"ל אם תצאו מזה הנה תשוב החיות לפרעה. וזש\\\"א בשבת יום קדוש הוא מבואו ועד צאתו. כי השפע היורד בשבת הוא מצד הקדושה בחי' יסוד צדיק כמ\\\"ש וזכרת כי עבד היית במצרים לעבד נמכר יוסף כמבואר במ\\\"א. לכן השפע היורד בשבת מעולם העליון הוא בשמירה מהחיצוני' כי הוא מצד הקדושה מבואו ועד צאתו לעוה\\\"ז. לכן כל זרע יעקב יכבדוהו כו' ואל יבוזו זרים. ודברינו הנ\\\"ל נרמזו בדברי הזוה\\\"ק פ' בלק דף רד ע\\\"ש והבן:",
            "explanation": "ביאור העניין הוא שכתונת הפסים של יוסף, אשר עשה לו אביו, הייתה סמל לצמצום ההשפעות והאורות העליונים, ולכן קנאת האחים לא הייתה על הכתונת עצמה אלא על המשמעות הרוחנית שלה, שהיא בחינת יסוד הצדיק המגן על השפעות הקדושה, וכאשר הפשיטו את הכתונת, נגרם הפגם והירידה למצרים, כפי שנרמז בדברי יעקב על טריפת יוסף."
        },
        {
            "source": "Tiferet Shlomo, Torah, Vayeshev 7",
            "relevant_sentences": "\"וילכו אחיו לרעות את צאן אביהם בשכם.\"  \n\"שהי' מרמז להם אף כי המה כולם קדושים אעפ\\\"כ הם צריכים לו להיות להם לראש ולמנהיג כי הוא צנור כל ההשפעות בחי' צי\\\"ע.\"  \n\"וזה שהי' כוונת יוסף לטובתם ולא מפני התנשאות עליהם חלילה רק למען החיש טובתם.\"  \n\"ולו שמעו ויחלו לקבל עול מלכותו אז יכול להיות גאולה שלימה.\"  \n\"וזה הי' ענין יוסף שהוא הי' צדיק הדור כמ\\\"ש לאסור שריו בנפשו וזקניו יחכם.\"",
            "passage": "וילכו אחיו לרעות את צאן אביהם בשכם. פרש\\\"י שלא הלכו אלא לרעות את עצמן. הענין בזה יבואר עפ\\\"י הידוע גודל מעלת י\\\"ב שבטי י\\\"ה שהם נגד י\\\"ב צרופי הוי' ב\\\"ה ולכל אחד מהם הי' לו עבדות לכבוד שמים לפי דרכו והלוכו בקודש כמ\\\"ש הלא אחיך רועים בשכ\\\"ם ר\\\"ת \\\"ברוך \\\"שם \\\"כבוד \\\"מלכותו. ובזה יש להבין טעות השבטים שהי' עולה בדעתם לרעות את עצמן פי' שהם רועים בעצמן ואינם צריכין לרב ומנהיג כי כולם קדושים ועובדים הבורא ב\\\"ה בכל לבבם. וזה הרמז בחלומו של יוסף והנה אנחנו מאלמים אלומים בתוך השדה והנה קמה אלומתי וכו' ותשתחוין לאלומתי. שהי' מרמז להם אף כי המה כולם קדושים אעפ\\\"כ הם צריכים לו להיות להם לראש ולמנהיג כי הוא צנור כל ההשפעות בחי' צי\\\"ע. כי כן הי' כוונת הבריאה שיהי' בכל דור צי\\\"ע אור זרוע לצדיק ולישרי לב שמחה כי ע\\\"י הצדיק הולכים כל ההשפעות. ודבר זה גלה לנו הבעש\\\"ט זי\\\"ע שהפיץ אורו על פני תבל כי בלתי דיבוק חכמים שבדור איננו באפשרי להיות קיום לעולם. וזה שהי' כוונת יוסף לטובתם ולא מפני התנשאות עליהם חלילה רק למען החיש טובתם. ולו שמעו ויחלו לקבל עול מלכותו אז יכול להיות גאולה שלימה. כמ\\\"ש ויוסף בן שבע עשרה שנה. עולה בגימ' טו\\\"ב אמרו לצדיק כי טוב. אך מפני כי הלכו לרעות את עצמן כאשר זה הי' ג\\\"כ טעות קרח שאמר כל העדה כולם קדושים ומדוע תתנשאו כו'. ובאמת לא כן הי' רצונו ית\\\"ש אף אמנם כולם קדושים אדרבא לזה הם צריכים למשה רבינו שיהי' המנהיג כדי שילכו ההשפעות על ידו כמ\\\"ש אצל רשב\\\"י באדרא רבא שהי' יושב עמהם ומצוה לתלמידיו שיאמרו כ\\\"א ד\\\"ת לפניו כמ\\\"ש פתח ר' אבא וכדומה לכן תלמידיו של ר\\\"ע אמרו כל הפורש ממך כפורש מן החיים כי כל החיים שלהם הי' על ידו הן השפעות החכמה ועניני עוה\\\"ז ג\\\"כ. וזה הי' ענין יוסף שהוא הי' צדיק הדור כמ\\\"ש לאסור שריו בנפשו וזקניו יחכם. כמ\\\"ש כי בן זקונים הוא לו ותרגומו כי בר חכים הוא לי'. פי' שהי' מעורר עולם החכמה עולם הזקנה. ולזה אחר מכירתו של יוסף כתיב וירד יהודה מאת אחיו. פי' שהי' ירידה במלכות בית דוד. וסוף דבר פוק חזי מה עלתה בם כי גם לחם לא הי' להם עד שירדו למצרים. וזה הענין הי' גם במשרע\\\"ה שאמר יוסף ה' עליכם כו'. פי' בחי' יוסף הוא צדיק הדור יהי' עמכם. ועי\\\"ז יברך אתכם כאשר דבר לכם בשעת מ\\\"ת:",
            "explanation": "ביאור העניין הוא שיוסף בחלומותיו רמז לאחיו שהם אמנם קדושים אך זקוקים למנהיגותו כצינור השפעות, וכי כוונתו הייתה לטובתם ולא להתנשאות, ואם היו מקבלים עול מלכותו הייתה יכולה להיות גאולה שלימה, שכן יוסף היה צדיק הדור המוביל את ההשפעות."
        }
    ]
}