{
    "question": "what practical lessons can we learn from parshas vayigash?",
    "analyzed_passages": [
        {
            "source": "Divrey Yoel, Torah, Vayigash (Torah #12, Passage #3)",
            "relevant_sentences": "אין משפטים ישירים",
            "passage": "ומבואר בספה\"ק די\"ב שבטי י\"ה הם כנגד י\"ב צירופי הוי', וכל צירוף מורה על מדה ובחי' אחרת, נמצא לפי\"ז שעבדו השי\"ת כאו\"א במדה ובדרך אחרת, וז\"ש המדרש ארי ושור מתווכחין זה בזה, שאין מודתם ודרך עבודתם שוה אבל עושה שלום במרומיו שלענין כבוד שמים יש שלום ביניהם בלי שום פירוד כלל וכ\"א מייחד לבבו להקב\"ה. וידוע שיעקב אבינו ע\"ה הוה כלול מכל המידות כולן ובזה יבואר אמרם ז\"ל במדרש שאמחו בניו ליעקב כשם שאין בלבך אלא אחד כך אין בלבנו' אלא אחד, פי' אף שבפעולתינו בעבודת השי\"ת יש השתנות בא' מחבירו אבל בתוכיות ופנימיות הלב אין לנו אלא לב אחד, ובחי' זו נרמז בדברי המדרש כאן שיהודה לא זז משם עד שעמד על לבו, פי' שהבין פנימיות לבו של יוסף והבחין שיש שלום ביניהם וכולם לכוונה א' עובדים לייחד לבבם להקב\"ה, וההשתנות שביניהם הוא חק בפעולת המעשה, וע\"כ ואחר שעמד על לבו השיג שאין פירוד ביניהם כלל, השי\"ת יעזור לייחד לבבנו לשמו יתברך באמת. זא",
            "explanation": "ביאור העניין הוא שהלימוד המעשי מפרשת ויגש הוא שכל אחד מישראל יכול לעבוד את ה' בדרכו הייחודית, אך בלב כולם יש אחדות פנימית לשם שמים, וכך נלמד מהשלום שבין השבטים למרות השוני בעבודתם."
        },
        {
            "source": "Divrey Yoel, Torah, Vayigash (Torah #31, Passage #4)",
            "relevant_sentences": "אין משפטים ישירים",
            "passage": "והנה יוסף הצדיק הי' שליחו של הקב\"ה לשום שארית בארץ ולהחיות בית ישראל לפליטה גדולה, אמנם אנן מה נענה שאין לנו יוסף הצדיק והקב\"ה שלח אותנו בארצות הגלות להעמיד בתי חינוך על טהרת הקודש בלי שום תערובת זר, וכולנו שלוחים לדבר מצוה זאת, והחוב על כל אחד מאתנו להתאמץ ולסייע לקיום החינוך הזה, ואני תקוה שתשרה ברכה במעשה ידינו ויגדלו פירות נאים ומשובחים. ובעזרתו יתברך גידולי ישיבתינו יתקיימו כולם נאמנים לה' ולתורתו הקדושה בדרך התורה והיראה, ולעת עתה הוא רק בבחי' שארית בארץ. אבל נקוה שיתברכו הדורות להחיות לפליטה גדולה ואמר הכתוב זרעו לכם לצדקה, והכוונה שהקב\"ה זורע את הצדקה שאדם עושה ולפי חשבון הגידולים משלם לו פירותיהן ופירות פירותיהן, והקב\"ה ישלם לכל אחד פירותיהן בעולם הזה והקרן קיימת לו לעולם הבא, ויזכנו ויחיינו לחזק ולקיים את דרך התורה בדרכי אבותינו ורבותינו הקדושים, ובמהרה נזכה לקבל פני משיח צדקנו ולהתגלות כבוד שמים עלינו במהרה בימינו אמן.",
            "explanation": "ביאור העניין הוא שהקטע מלמדנו שעל כל אחד מאתנו מוטל החוב להקים ולחזק מוסדות חינוך על טהרת הקודש, ובכך אנו ממשיכים את שליחותו של יוסף הצדיק להחיות את עם ישראל, ובזכות זה נזכה לברכה במעשינו ולגאולה שלמה."
        },
        {
            "source": "Divrey Yoel, Torah, Vayigash (Torah #17, Passage #9)",
            "relevant_sentences": "\"אין משפטים ישירים\"",
            "passage": "ובזה אפ\"ל דברי המדרש (הובא לעיל בדרוש הקודם) ואתם עלו לשלום אל אביכם, אמרין לי' השלו' דכולי' נשפה (פי' היפ\"ת ענין חשך כמו נשף שבמקרא כלומר זהו שלום של חשך ואפילה), ורוה\"ק צווחת שלום רב לאוהבי תורתך וצ\"ב ויתבאר לדרכינו דהנה יהודה ויוסף היו מדיינים זע\"ז, והיתה ההתנגדות שביניהם גדולה מאוד עד שרצה יהודה להחריב את כל מצרים כמבואר בדרז\"ל, ולכן אמרין לי' השלום דכולי' נשפה, איך יקרא לזה שלום והוא שלום של חשך ואפילה, אמנם כל התווכחותם הי' ע\"ד האמת ואלו ואלו דברי אלקים חיים, ומחלקותם הי' בדבר הלכה ועפ\"י דיני התורה כמ\"ש הפר\"ד והמפרשים ז\"ל, ומחלוקה כזו סופה לבוא לידי שלום וכמו שאירע להם באמת, וז\"ש רוה\"ק שלום רב לאוהבי תורתיך וגו', כי זהו השלום האמיתי אם כל א' מהחולקים רצונו ומבוקשו רק להשיג דעת התוה\"ק ע\"ד האמת, וז\"ש במדרש תנחומא הנ\"ל ואת יהודה שלח לפניו וכו' אתמול מתנגחין זה עם זה ועכשיו הוא משלחו אצלו הוי עושה שלום במרומיו, שהיתה בחי' השלום הזה השפעה מן השמים וע\"ד האמת, כבחי' השלום של מעלה והבן. דה",
            "explanation": "ביאור העניין הוא שהמחלוקת בין יהודה ליוסף, שהייתה על פי דיני התורה ובדבר הלכה, מלמדת אותנו שהשלום האמיתי מושג כאשר כל צד מבקש את דעת התורה באמת, וכך נלמד מפרשת ויגש שהמחלוקות לשם שמים סופן להתהפך לשלום אמיתי."
        },
        {
            "source": "Divrey Yoel, Torah, Vayigash (Torah #23, Passage #7)",
            "relevant_sentences": "אין משפטים ישירים",
            "passage": "ומכאן תשובה ניצחת למנהיגי דורנו אשר שמו יד לפה מלהוכיח בעושי רשעה, בטענת הצטדקות כי אינם בקיאים בתחבולות בעלי רשע, ועוצמים עיניהם מראות ברע, כי לא יאתה לתכונת נפשם לראות ולהרהר במעשה רשע, דאדרבה זקני בי\"ד חייבין להשכיל ולהבין כל בחינת הרע, ולידע כל פירצה חדשה, כדי שיוכלו לגדור גדר ולעמוד בפרץ ולכך התוודו זקני בית דון ובקשו סליחה על שלא השגיחו בעין פקיחא על בני דורם, וזה שרמז עו יוסף ליעקב אבינו שלמד עמו פ' עגלה ערופה, שאל יפלא בעיני אביו מנין הוא מכיר כל מין ע\"ז להשמר ממנה, כו מפרשת עגלה ערופה שהתוודו זקני בי\"ד על שלא ראו תקלת הדור, משם למד שצריך להבין ולהכיר כל עון ומכשול, ושפיר מיושב הדרש עם הפשט כו הא בהא תליא, דאליבא דאמת שלח לו עגלות ממש. אבל רמז לו שמפרשת עגלה ערופה שלמד עמו ידע להתבונן בכל זה.",
            "explanation": "ביאור העניין הוא שמפרשת ויגש נלמד שהמנהיגים חייבים להיות מודעים לכל תחבולות הרשע ולפעול למניעתן, כפי שיוסף רמז ליעקב על ידי לימוד פרשת עגלה ערופה, ללמדנו שעל המנהיגים להשכיל ולהבין את כל בחינות הרע כדי לעמוד בפרץ ולגדור גדר."
        },
        {
            "source": "Divrey Yoel, Torah, Vayigash (Torah #3, Passage #11)",
            "relevant_sentences": "אין משפטים ישירים",
            "passage": "והנה דבריהם הקדושים נשארו נצחיות לדורי דורות, שכבשו דרך ופתחו מעיין ישועה לבניהם אחריהם, וכמ\"ש ק\"ז הייטב לב זלל\"ה (בפרשת תולדות) על מה דאיתא בזוה\"ק: כ' שנין אשתהי יצחק עם אתתי' ולא אולידת עד דצלי צלותיה, בגין דקוב\"ה אתרעי בצלותהון דצדיקייא, מ\"ט בגין דיתרבי ויתוסף רבות קודשא לכל מאן דאיצטרך בצלותהון דצדיקייא עכ\"ד הזוה\"ק. וכתב ק\"ז זלל\"ה למה זה דומה לצינור שנסתם ואם יבוא אחד ויפתחנו וינקנו שוב הוא פתוח לכל, וכמו\"כ ע\"י תפלתן של צדיקים נפתחו צנורות הישועה והחסדים וכל מי שצריך למימי הישועה ישאב בששון מאותו הצינור וכענין דכתיב ושאבתם וגו' ממעיני הישועה, וביארו המפרשים כי ישועת צדיקים הוא כמו מעיין הנובע ישועה לכל מיד ולדורות, ולכן הקב\"ה מתאווה לתפלתן שע\"י תפלתן יפתח הצינור והמעיין לכל מי שצריך לאותו דבר ע\"כ בייטב לב. ויובן בזה דברי המדרש מים עמוקים עצה בלב איש וגו' משל לבאר עמוקה מלאה צונן והיו מימי' צוננין ויפין, ולא היתה ברי' יכולה לשתות הימנה, בא אחד וקשר חבל בחבל וכו' ודלה הימנה ושתה התחילו הכל דולין הימנה ושותין, כך לא זז יהודה משיב ליוסף וכו', דהנה השבטים הק' לא היו צריכים לפעולות אלו בשביל עצמם. כי היה בכח קדושתם לפעול ישועה לעצמם בלאו הכי, אבל עשו כל זה שיהיה מעיין ישועה נמשך לדורות, ויש מקום בדבריהם הקדושים לדורות, כל דור לפי המצב ולפי המאורעות ולכך היו דבריהם מראין פנים לכל צד, שיהיה נמשך לדורות מעיין הנובע ישועה לכל מי שצריך, וכך היה יהודה משיב ליוסף דבר על דבר עד שעמד על לבו והכל דולין ושותין מהם לדורי דורות.",
            "explanation": "ביאור העניין הוא שהמעשה של יהודה מול יוסף, כפי שמתבאר בדברי המדרש, מלמדנו על כוח התפילה והפעולה של הצדיקים לפתוח צינורות ישועה לדורות, כך שכל אחד יכול לשאוב מהם ישועה בעת הצורך, וזהו הלקח המוסרי והמעשי שניתן ללמוד מפרשת ויגש."
        },
        {
            "source": "Divrey Yoel, Torah, Vayigash (Torah #7, Passage #2)",
            "relevant_sentences": "\"מזה אפשר לראות עד היכן צריכין להיות נשמר מדרך ע\"ז שלזה צריך חכמה יתירה להבין ולהבדיל ולהפריש מהם\"",
            "passage": "והנה יעקב אבינו ע\"ה שלח את יהודה לפניו להורות לפניו גושנה, ולהכין לו בית תלמוד כאמרם ז\"ל, ולכאורה היה יכול יוסף בעצמו להכין את זאת, גם היה אפשר לעשות שליחות זו ע\"י אחד מהשבטים ומדוע שלח את יהודה שהיה מלך, אך נראה עפומ\"ד במדרש וירא את העגלות אשר שלח יוסף ואותן העגלות ששלח פרעה היכן היו, א\"ל אותן עגלות ששלח פרעה לשאת אותו היתה ע\"ז חקוקה עליהם עמד יהודה ושרפן, למוד הוא השבט הזה להיות שורף ע\"ז, ודייקו ביפ\"ת ובנזה\"ק מדוע לא שרפם יוסף בעצמו, ותירצו דמפני שיהודה מסוגל לזה ע\"כ הניחו אליו, ובנזה\"ק האריך לבאר עפי\"ד המדרש אין אנו בקיאים בדקדוקי ע\"ז כיעקב אבינו, וכמו כן יהודה היה בקו בדקדוקי ע\"ז עכ\"ד, וע\"כ שלח יעקב אבינו את יהודה שהוא יכיר ויבחין גם בחי' ע\"ז הטמון בסתר, גם מחשבת ע\"ז, דהרי למוד אותו שבט להיות שורף ע\"ז, ולפי שרצה יע\"א להכין לו בית שמשם תצא הוראה, ע\"כ היה צורך לזה הבחנה והבדלה שלא יהיה מעורב בו אף שמץ ע\"ז ולזה מסוגל רק יהודה כנ\"ל, וע\"כ שלח את יהודה דייקא שהוא יכין לו בית תלמוד, שלא יהיה בה שום שמץ ע\"ז ומשם תצא הוראה, ומזה אפשר לראות עד היכן צריכין להיות נשמר מדרך ע\"ז שלזה צריך חכמה יתירה להבין ולהבדיל ולהפריש מהם, ולזה הסמיכו לכאן ההלכה ילמדנו רבינו אימתי מברכין על הנר במוצ\"ש כך שנו רבותינו אין מברכין על הנר עד שיאותו לאורו, והיינו מטעמא שצריך הכרה יתירה להבדיל ומנין למדו מן הקב\"ה שנאמר וירא אלקים את האור כי טוב ואח\"כ ויבדל אלקים בין האור ובין החושך ומה\"ט את יהודה שלח לפניו מפני שהוצרך להכרה יתירה להכין ביהמ\"ד שיהיה מסוגל וראוי לכך שמשם תצא הוראה.",
            "explanation": "ביאור העניין הוא שמלמדנו הפרשה עד כמה יש להיזהר ולהישמר מכל שמץ עבודה זרה, ולכך נדרש חכמה יתירה להבחין ולהבדיל בין קודש לחול, וכפי שנשלח יהודה להכין בית תלמוד נקי מכל שמץ ע\"ז, כך עלינו ללמוד להבחין ולהפריש מכל דבר שאינו טהור."
        },
        {
            "source": "Divrey Yoel, Torah, Vayigash (Torah #20, Passage #15)",
            "relevant_sentences": "\"אולם הרי קיי\"ל דאין סומכין על הנס\"  \n\"ורק בכח הזה שבנ\"י נותנים במסירות ובמחשבה רצויה אנו מתקיימים למעלה מדרך הטבע\"",
            "passage": "ואפ\"ל בזה מאמר הכתוב כו עיניכם הרואות וגו' כי פו המדבר אליכם, ודרשו חז\"ל כפו כן לבי, כי הנה בפסוק שלפניו כתוב וכלכלתו אתך שם כו עוד חמש שנים רעב פן תורש אתה וביתך וכל אשר לך, ולכאורה הרי לא נתקיים הבטחתו מה שנדר לזונם ולכלכלם עוד חמש שנים, שהרי אמרז\"ל משבא יעקב אבינו למצרים נפסק הרעב מיד בזכותו ויתכן שהשיג יוסף ברוה\"ק שעתיד הרעב להתבטל עצו יע\"א, כי אמרו רז\"ל בפדר\"א שרוח הקודש הנהיגתו מנעוריו ועד יום מותו, א\"כ מדוע אמר וכלכלתי אתך וגו' כו עוד חמש שנים הרעב ולא נתקיים נדרו, אולם הרי קיי\"ל דאין סומכין על הנס, ע\"כ יוסף הצדיק השתתף בצערם וקיבל על עצמו בכל לבו ונפשו לזונם ולכלכלם עוד חמש שנים, ובזה כבר קיבל השכר על כל החמש שנים אף שנפסק הרעב אח\"כ, כמבואר בדברי הספרי הנ\"ל שמגיע שכר על האמירה אף שלא הספיק ליתן, וכדי שלא יקשה לאחיו עליו. האיך הותר לו לנדור בכהאי גוונא והלא אסור לנדור אלא באומר הרי זו, אמנם ביררנו לעיל דבמחשבתו רצויה מותר, ע\"כ הסמיך לומר כי עיניכם הרואות כו פו המדבר אליכם, ודרשו רז\"ל כפי כן לבי. היינו שמחשבתי וכוונתי רצויה, ובכהאי גוונא מצוה לנדור ומקבל שכר על האמירה כמעשה, והנה ישנם כאלו שחושבים כי בלאו הכי הוא מעשה נסים, לקיים ולהחזיק מוסד גדול בלי עין הרע בהוצאות גדולות ע\"י מתו מעט ומספר מצומצם של יר\"א, וע\"כ סומך הוא על הנס וחושב שאינו צריך ליקח חבל ויבוא הנס מ\"מ, אבל אינו כן כי אין סומכין על הנס. ורק בכח הזה שבנ\"י נותנים במסירות ובמחשבה רצויה אנו מתקיימים למעלה מדרך הטבע.",
            "explanation": "ביאור העניין הוא שהלימוד המעשי מפרשת ויגש הוא שאין לסמוך על הנס אלא לפעול במסירות ובמחשבה רצויה, ובכך זוכים לסייעתא דשמיא ולהתקיים למעלה מדרך הטבע, כפי שיוסף הצדיק התחייב לזון את אחיו מתוך כוונה טהורה אף שידע ברוח הקודש שהרעב יפסק."
        },
        {
            "source": "Divrey Yoel, Torah, Vayigash (Torah #29, Passage #4)",
            "relevant_sentences": "\"וכמו כן המחזיקין במוסדות התורה ומסייעין לגדל דורות ישראל לתורה, יש לפעולה זו קיום נצחי לעד\"  \n\"והנה יעקב אבינו והשבטים הקדושים רצו להיות נפרדים מהמצרים לגמרי, ולטעם זה נתיישבו בארץ גושן\"  \n\"להעמיד שם ישיבה ומקום להרבצת התורה שהוא דבר נצחי, וא\"א רק בגושן ששם יהיו מובדלין ומופרשים מהמצרים\"",
            "passage": "ונצ\"מ בהקדם אמרם ז\"ל (יומא דף כ\"ח ע\"ב) מימיהן של אבותינו לא פרשה ישיבה מהם, היו במצרים ישיבה עמהם וכו', היו במדבר ישיבה עמהם וכו', ראוי להבין הטעם שכינו חז\"ל למקום תורה בשם ישיבה סתם, הרי כמו שישנם יושבי בית המדרש ישנם גם כן יושבי קרנות, ומשמעות לשון ישיבה סובל שניהם א\"כ מאן מפיס, והו\"ל לפרש יושבי ביהמ\"ד, אמנם ברור כי היושבי קרנות אינם ראויים להתכנות בשם ישיבה כלל, דלשון ישיבה מורה על דבר שהוא נצחי וקיים לעד, ורק התוה\"ק הוא נצחי ואין דבר זולתו, וע\"ד שבקש דוד המלך ע\"ה (תהלים ס\"א) אגורה באהלך עולמים, ודרשו רז\"ל (יבמות צ\"ו ע\"ב) וכי אפשר לו לאדם לגור בשני עולמים. אלא אמר דוד לפני הקב\"ה רבש\"ע יהי רצון שיאמרו דבר שמועה מפי בעוה\"ז. דאמר ר\"י וכו' כל ת\"ח שאומרים דבר שמועה מפיו בעולם הזה שפתותיו דובבות בקבר עכ\"ד הגמרא, וכמו כן המחזיקין במוסדות התורה ומסייעין לגדל דורות ישראל לתורה, יש לפעולה זו קיום נצחי לעד, ורק ישיבה של תורה מקרי ישיבה בשם העצם וכמו שארז\"ל במשנה (דאבות (פ\"ב מ\"ז) מרבה ישיבה מרבה חכמה, מבואר דלא מקרי ישיבה כו אם במקום שיש הרבצת התורה, והנה יעקב אבינו והשבטים הקדושים רצו להיות נפרדים מהמצרים לגמרי, ולטעם זה נתיישבו בארץ גושן. וז\"ש אל פרעה לגור בארץ באנו, היינו בארץ מצרים אנחנו בבחינת גרים, ועתה אישבו\" נא עבדיך בארץ גושן. להעמיד שם ישיבה ומקום להרבצת התורה שהוא דבר נצחי, וא\"א רק בגושן ששם יהיו מובדלין ומופרשים מהמצרים, וז\"ש הכתוב שוישב\" ישראל וגו' בארץ גושן להורות שקבעו שם ישיבה ובית תלמוד כפירש\"י ז\"ל.",
            "explanation": "ביאור העניין הוא שהלימוד המעשי מפרשת ויגש הוא החשיבות בהקמת מוסדות תורה והפרדתם מהשפעות חיצוניות, כפי שעשו יעקב והשבטים בארץ גושן, כדי להבטיח קיום נצחי לתורה ולחינוך הדורות הבאים, וכך המחזיקים במוסדות התורה זוכים לפעולה נצחית."
        },
        {
            "source": "Divrey Yoel, Torah, Vayigash (Torah #20, Passage #6)",
            "relevant_sentences": "\"דיוסף הצדיק הקדים לבא מצרימה, כדי להכין מקום לבני ישראל שיוכלו להתקיים בקדושתן בגלות מצרים שהוא ערות הארץ ומזוהם ביותר, ובכח קדושתו והנסיונות שעמד בהם והתגבר עליהם, וע\"י שנעשה מושל על שר של מצרים החליש כח הטומאה והקליפות בשורשן, ועי\"ז זכו ישחאל להיות נשמרים מעריות במצרים ובנ\"י עאלו ובנ\"י נפקו, ולא הי' בהם א' שנולד בפסול כאמרז\"ל, אמנם נוסף לזה הכין יוסף הצדיק כח הצלה לדורות העתידים עד גלות האחרון, שיוכלו ישראל להתגבר ולעמוד בנסיונות הגלות ויתקיימו בקדושתן אף בשפלות הנוראה בעיקבתא דמשיחא, שגלות מצרים שורש כל הגלות.\"",
            "passage": "ונא\"פ במאה\"כ לשום לכם שארית בארץ וגו' ע\"ד דאמרינן בגמרא לענין רבית (ב\"מ ע\"ה ע\"ב) אלו עוברין בל\"ת המלוה והלוה והערב והעדים, אמר אביי מלוה עובר בכולן וכו' ערב והעדים אין עוברין אלא משום לא תשימון עליו נשך, עכ\"ד הגמרא. ובגמרא (שם ס\"ב ע\"א) בשלמא כולהו עביד מעשה, אלא עדים מאו עביד, אלא לאו דשומא מילתא היא, הרי דאף שהערב והעדים לא עשו מעשה בגוף הענין אבל לפי שעל ידם נשלם והובא לידי גמר מחייבי בלאו דלא תשימון ושורש הפעולה נכלל במלת שימה, ועד\"ז יתבאר לענינינו דיוסף הצדיק הקדים לבא מצרימה, כדי להכין מקום לבני ישראל שיוכלו להתקיים בקדושתן בגלות מצרים שהוא ערות הארץ ומזוהם ביותר, ובכח קדושתו והנסיונות שעמד בהם והתגבר עליהם, וע\"י שנעשה מושל על שר של מצרים החליש כח הטומאה והקליפות בשורשן, ועי\"ז זכו ישחאל להיות נשמרים מעריות במצרים ובנ\"י עאלו ובנ\"י נפקו, ולא הי' בהם א' שנולד בפסול כאמרז\"ל, אמנם נוסף לזה הכין יוסף הצדיק כח הצלה לדורות העתידים עד גלות האחרון, שיוכלו ישראל להתגבר ולעמוד בנסיונות הגלות ויתקיימו בקדושתן אף בשפלות הנוראה בעיקבתא דמשיחא, שגלות מצרים שורש כל הגלות. והאבות והשבטים הק' היו שורש נשמות ישראל של כל הדורות, וכל מה שיש בענף יש בשורש, ע\"כ הם במעשיהם הק' פתחו צינור והכינו כח לכל דורות ישראל, וז\"ש לשום לכם שארית באחק ולהחיות לכם לפליטה גדולה, שהכין יוסף הצדיק יסוד ושורש התגברות לכל דורות ישראל, והוא ניצוץ הק' אשר נסתר בבחינת הנפש של כל איש ישחאל ומורשה לנו מאבוה\"ק, ובהתחלתו הוא רק בבחינת שארית, ואח\"כ יתרחב גבול הקדושה להחיות לכם לפליטה גדולה.",
            "explanation": "ביאור העניין הוא שיוסף הצדיק בהקדימו לבוא מצרימה ובכוח קדושתו והתגברותו על הנסיונות, הכין מקום לבני ישראל לשמור על קדושתם בגלות מצרים, ובכך הניח יסוד ושורש לכח התגברות לדורות העתידים, ללמדנו שעל ידי הכנה רוחנית ועמידה בנסיונות ניתן לשמור על הקדושה אף בגלות ובשפלות."
        }
    ]
}