{
    "question": "in which scenario can it appear as if a person is lying in his prayers?",
    "analyzed_passages": [
        {
            "source": "Tiferet Shlomo, Torah, Pinchas 15",
            "relevant_sentences": "אין משפטים ישירים",
            "passage": "ויקרב משה את משפטן לפני ה'. ויאמר ה' אל משה כן בנות צלפחד דוברות. יל\\\"ד מהו לשון כן הול\\\"ל אמת בנות צלפחד דוברות. אכן הנה כבר ידוע כי כל שאלת האדם בצרכיו מאת השי\\\"ת ותפלותיו הרבים לא נכון להם להתפלל עלצרכי עצמו בעניני עוה\\\"ז רק לכוון בהם להיות בזה כבוד שמים בכל דרכיך דעהו שיהיו כל עניני האדם רק לכבוד הש\\\"י ב\\\"ה על אחת כמה וכמה בשעת התפלה צריך לכוון לבו רק לשמים וממנו בא הישועה גם לעוה\\\"ז כמ\\\"ש ויזעקו אל ה' בצר להם וממצוקותיה' יושיעם. פי' שיהי' כל כוונתם אל ה' שהוא כביכול בצר להם עמהם ממילא ממצוקותיהם יושיעם. והנה עד\\\"ז הוא פי' כל הברכות שבש\\\"ע אע\\\"פ שהם שאלת צרכיו רפואה וברכת השנים הכל הוא למעלה כיל\\\"ח וצריך לכוון להש\\\"י כשמתפלל בהם ליחוד שלמעלה וע\\\"י כן שלום על ישראל. והנה לפעמים מי שאין בו דעת לכל אלה להתפלל על ה' כנ\\\"ל. הנה זהו העצה נכונה כשבא אל הצדיק הדור הנה הוא מליץ טוב בעדו כי גם הוא כוונתו רק לשמים ומקרב את עניניו וצרכיו שהוא ג\\\"כ לצורך גבוה ית\\\"ש. וז\\\"ש בגמרא מי שיש לו חולה בתוך ביתו ילך אצל חכם ויבקש עליו רחמים כי הצדיק הוא היודע להמליץ עליו רחמים בתפלתו וע\\\"ז הבטיח הש\\\"י למשרע\\\"ה וחנותי את אשר אחון ואמרו חכז\\\"ל אעפ\\\"י שאינו הגון ואינו כדאי הפי' שאין כוונתו רצויה להתקבל למעלה אני אעביר כל טובי על פניך שיהיה בך כח כזה להטיב לברואיו להמליץ טוב בעדם וללמד זכות עליהם עי\\\"כ וחנותי את אשר אחון. וז\\\"פ הנה אנכי בא אליך בעב הענן בעבור ישמעו העם בדברי עמך כו' וישב משה את דברי העם אל ה'. ר\\\"ל גם דברי פשוטי העם שאינם יודעים להתפלל באמת ברצוןובכוונה למעלה עכ\\\"ז יעלו לרצון על ידי הצדיק. וזה הענין כשבאו בנות צלפחד לתבוע נחלה בא\\\"י תחלה הנה יש לפרש בזה כוונה פשטיות שרצו בתחלה כדרך הארץ. ויש לפרש בהם עוד שהיה כוונתם על קדושת הארץ שהיו מחבבות הארץ ולכן כשבאו לפני משה ויקרב את משפטן לפני ה'. שהי' מקרב וממתיק אותם שתביעתן הוא ג\\\"כ למקום ב\\\"ה כדרך הנכון להצדיק לקרב את בנ\\\"י לפני הש\\\"י ולזה השיב לו הקב\\\"ה כן בנות צלפחד דוברות אינך צריך עוד להמתיק ולתקן דבריהם בכוונתם. כן בנות צלפחד דוברות מתחלה רק לרצון הש\\\"י:",
            "explanation": "ביאור העניין הוא שבשעת התפילה, כאשר האדם אינו מכוון את כוונתו לשמים אלא לצרכיו האישיים בלבד, נראה כאילו הוא משקר בתפילתו, אך כאשר הצדיק מקרב את תפילתו וממתיק את כוונתו לשם שמים, אזי תפילתו מתקבלת באמת וברצון לפני הקב\"ה."
        },
        {
            "source": "Tiferet Shlomo, Torah, Miketz 4",
            "relevant_sentences": "אין משפטים ישירים",
            "passage": "ויהי מקץ וכו'. פרש\\\"י כל לשון קץ סוף הוא. הנראה לרמז בדבריו הקדושים עפ\\\"י מ\\\"ש בפי' הפיוט קדם רבון עלמין במילין סתימין וכו'. להורות לכל איש בגשתו אל הרנה ואל התפלה על כל מחסורו בעניני עוה\\\"ז אשר יחסר לו לא ישים מגמתו על מצוקותיו רק יהיה עיניו ולבו על גודל צער גלות השכינה כמ\\\"ש בספרים על המשנה באבות דע מה למעלה ממך. פי' מהחסרון שחסר לך למטה תוכל להבין החסרון שנוגע למעלה צער גלות השכינה. וז\\\"ש ושמחתים בבית תפלתי תפלתם לא נאמר אלא תפלתי. פי' שיהיה עיקר תפלתם למען כבודו ית\\\"ש. וזה הרמז בגמ' שנים שנכנסו להתפלל. פי' בשעת התפלה צריך להיות בשני בחי'. מה שנוגע למעלה וגם בצרכי נפשו למטה. לכן במשה רבינו כשהיה מתפלל עבור אחותו כתיב אל נא רפא נא לה. הרמז בזה רפא נא לה' האחרונה בשם הוי' לעשות היחוד למעלה ואז ממילא תתרפא. וז\\\"פ לא על צדקותינו אנחנו מפילים תחנונינו לפניך כי על רחמיך הרבים. וז\\\"ש ואתה ברחמיך הרבים עמדת להם בעת צרתם. פי' שהעמידו נגד עיניהם צער גלות השכינה שהקב\\\"ה כביכול סובל גודל צער בנ\\\"י וכאשר באו למדריגה זו לעורר רחמי שמים אז נצמח להם הישועה רבת את ריבם. העולה מזה כי גם בכל נוסח התפלה שאנו מתפללים בשמ\\\"ע רפאנו ברך עלינו וכדומה הנראי' לעיני בשר כי הם דברים פשוטים הנצרכים בעוה\\\"ז. אמנם הם עומדים ברומו של עולם. וז\\\"פ קדם רבון עלמין במילין סתימין. כי במחשבה היא דברים סתומים לכן עולה לרצון למעלה. וז\\\"ש שועתנו קבל ושמע צעקתנו יודע תעלומות. פי' מה שאנו צועקים על מחסורינו אתה היודע תעלומות לבבנו כי כל כוונתינו על צער גלות השכינה כנ\\\"ל. ונחזור לענין הנ\\\"ל שזה רמז בדברי רש\\\"י במתוק שפתיו. רהי מקץ כל לשון קץ. פי' הצדיק כזה אשר כל לשונו בתפלתו הוא רק על הקץ ומצפה לישועת ה'. סוף הוא. פי' הוא אשר יזכה להיות בסוף ולראות במהרה בישועה ונחמה בבוא הגאולה ב\\\"ב. אמן:",
            "explanation": "ביאור העניין הוא שבשעת התפילה, כאשר האדם מתמקד בצרכיו האישיים בלבד ואינו מכוון את לבו לצער גלות השכינה ולכבוד ה', נראה כאילו תפילתו היא שקרית, שכן עיקר הכוונה בתפילה צריכה להיות למען כבודו יתברך ולא רק לצרכים גשמיים."
        },
        {
            "source": "Tiferet Shlomo, Torah, Toldot 9",
            "relevant_sentences": "אין משפטים ישירים",
            "passage": "ויתרוצצו הבנים בקרבה ותאמר אם כן למה זה אנכי כו'. ופרש\\\"י עוברת על פתחי תורה יעקב מפרכס לצאת. עוברת על פתחי ע\\\"ג עשו מפרכס לצאת. הנה בפ' זו מורה לנו התורה הקדושה דרך הישרה לעבודת הבורא ב\\\"ה שיהיה באמת ובתמים ולא יהיה דרכו דרך הפכפך וזר עד ארגיעה לשון שקר. כאשר נמצא רבים מעמי הארץ כי בשעה שעוסק בתורה ותפלה לבבו כלפיד יבער. וכאשר התעיף בו ואיננו כי אחר התפלה תיכף הולך בשרירות לבו חומד ומתאוה. וז\\\"פ הענין וירא אלהים את האור כי טוב כו' ודרשו חז\\\"ל שאיננו ראוי שישתמשו האור והחשך בערבוביא כו'. לכאורה אין להבין איך שייך לומר אור והחשך יחד בערבוביא תרתי דסתרי אהדדי. אך הרמז בזה. כי דרכי התורה ועבודה המה רומזים לאור. ותאוות העולם השפל והנבזה הם דומים לחשך. והאדם צריך לשמור מזה לבל יהי' בערבוביא פוסח על שני הסעיפים פעם הולך בדרכי התורה ופעם פונה לדרכי החשך ח\\\"ו. וכזה פרשנו בפ' צרופה אמרתך מאד ועבדך אהבה. כי זהו הצירוף והבחינה אם התו\\\"מ מביאים את האדם לידי האהבה לבל יסיר מני דרך הישרה. לכן עתה כאשר ראתה רבקה אמנו שהתרוצצו הבנים סברה כי הוא אדם אחד אשר פעם חשקו ללכת לבהמ\\\"ד ופעם חשקו ללכת לפתחי ע\\\"ג כדרך אנשי רשע כאשר יבוא בין הצדיקים יתלוה עמהם לעשות כמעשיהם. וכאשר פונה מהם ופגעו בו אנשים פוחזים וריקים הנה הוא כאחד מהם. לכן ותלך לדרוש את ה' מה יהיה בסופו. כי לא זה הדרך ישכון אור רק כיתד שלא תמוט. לזה כתיב ויאמר ה' לה שני גוים בבטנך. כי באמת הם שנים יעקב ועשו זה פונה לרשעו ותאוותו הרעה. וזה פונה לתומו וצדקתו לעד עומדת בל ימוט לנצח. ובזה יש לרמז מ\\\"ש להלן ויהי אך יצוא יצא יעקב מאת פני יצחק אביו והנה עשו אחיו בא מצידו. לרמז על הנ\\\"ל ויהי לשון צער כאשר נמצא איש הפכפך במעשיו אשר בשעת עשיית המצוה הוא בבחי' יעקב. וכאשר יצא מאת פני יצחק אביו בגמר תפלתו ועבודתו והנה חוזר לסורו נהפך לאיש אחר והנה עשו אחיו בא מצידו. מצידו. כי הסט\\\"א גובר עליו בתאוות עוה\\\"ז. אך צריך האדם להיות חזק ואמיץ כיתד שלא תמוט להשגיח על כל דרכיו בתם וביושר:",
            "explanation": "ביאור העניין הוא שבשעת התפילה והעבודה, האדם עשוי להיראות כיעקב הצדיק, אך כאשר הוא יוצא מאותה עבודה ופונה לדרכי העולם הזה ותאוותיו, הוא נהפך לעשו הרשע, ובכך נראה כאילו הוא משקר בתפילתו, שכן אין דרכו קבועה ואמיתית אלא פוסח על שני הסעיפים."
        },
        {
            "source": "Tiferet Shlomo, Festivals, Shemini Atzeret 27",
            "relevant_sentences": "\"מכ\\\"ש אם ח\\\"ו האדם חוטא בברית פשיטא שאין תפלתו נשמעת ואין תורתו עולה למעלה.\"",
            "passage": "ה' עוז לעמו יתן ד' יברך את עמו בשלום. ויהיו נא אמרינו לרצון לפני אדון כל. הסמיכות של ב' הפסוקים הללו. נקדים לפרש הפסוק בתהלים. יפיפית מבני אדם הוצק חן בשפתותיך. חגור חרבך על ירך גבור הודך והדרך. עוד נקדים לפרש הפסוק. כל ארחות ד' חסד ואמת לנוצרי בריתו ועדותיו. דהנה ידוע שברית הלשון וברית המעור מכוונים זה כנגד זה כמבואר בספרים הקדושים דאם האדם איננו שומר את הדיבור אז ממילא בא לידי פגם הברית ח\\\"ו כמ\\\"ש בס' ראשית חכמה ובס' תומר דבורה על פסוק אל תתן את פיך לחטיא את בשרך. בשרך היינו הברית קודש כמ\\\"ש ועל בריתך שחתמת בבשרנו ע\\\"ש. ומכ\\\"ש אם ח\\\"ו האדם חוטא בברית פשיטא שאין תפלתו נשמעת ואין תורתו עולה למעלה. ובזה פרשתי המשנה אל תרבה שיחה עם האשה כו' מכאן אמרו המרבה שיחה כו' ובוטל מדברי תורה היינו שמבטלים דברי תורה שלו שלמד ושילמוד הכל הולך לסט\\\"א וכעין שאמרו מדאורייתא בביטול בעלמא סגי ולהוי כעפרא כו' אמרו פ\\\"ה גימט' מיל\\\"ה ובזוהר הקדוש \\\"מי \\\"יעלה \\\"לנו \\\"השמימה ר\\\"ת מילה. דהיינו אם האדם שומר את הברית אז תפלתו עולה השמימה. ובזה פרשתי והי' עקב תשמעון. עקב הוא שמירת הברית כידוע. ושמר ד' אלהיך לך את הברית לא יהי' בך עקר ועקרה ודרשו רז\\\"ל לא תהי' תפלתך עקורה היינו ע\\\"י שמירת הברית לא תהי' תפלתך עקורה ותהי' נשמעת למעלה. ובז\\\"פ נצור לשונך מרע ושפתיך מדבר מרמה. כפל הלשון לשונך ושפתיך. רמוז על שמירת הלשון וברי\\\"ק. וכ\\\"ז שהאדם אינו נשמר משמירת הברית ושמירת הפה אין המצות ומעש\\\"ט שלו הולכים למעלה רק לסט\\\"א ח\\\"ו. ולזה אמר מי האיש החפץ חיים כו' נצור לשונך מרע. ולזה אמר כל ארחות ד' חסד ואמת לנוצרי בריתו ועדותיו. דהיינו שהחסדים הולכים רק לבני ישראל שהם נוצרי בריתו ועדותיו. ונבוא לביאור הפסוקים הללו. יפיפית מבני אדם הוצק חן בשפתותיך. הנה ידוע שלא נכתב לשון חן רק לשומרי בריתו כגון אצל נח כתיב ונח מצא חן בעיני ד'. שכל דורו לא היו שומרים את הברית ונח שמר בריתו. ואצל יוסף כתיב ג\\\"כ לשון חן וימצא חן בעיניו. ויתן חנו בעיני שר בית הסוהר. וזהו חן וכבוד יתן ד' לא ימנע טוב להולכים בתמים. תמים הוא מי ששומר הברית כידוע בזוה\\\"ק. ויעקב איש תם נח צדיק תמים. ולזה יתן להם חן ולא ימנע טוב שיסוד העליון נקרא טוב כידוע. ולזה אמר הוצק חן בשפתותיך. היינו שהתפלות יתקבלו למעלה. וגם מצא חן בעיני ד' וע\\\"ז אמר מהיכן האדם זוכה לזה. חגור חרבך על ירך גבור הודך והדרך היינו שמירת היסוד כמבואר בזוהר הקדוש (פ' וארא דף כ\\\"ו). שפסוק הזה מרמז על שמירת הברית. ולזה אמר ד' עוז לעמו יתן הוא ספירת היסוד כמבואר בכוונת האר\\\"י ז\\\"ל ד' יברך את עמו בשלום. שלום הוא ג\\\"כ יסוד כמ\\\"ש במקום אחר מזה. ולזה אמר ויהיו נא אמרינו לרצון לפני אדון כל. אדון הוא ספירת המלכות כידוע כל הוא ספירת היסו\\\"ד כמבואר בכתבי האר\\\"י ז\\\"ל על ואתה מושל בכל ע\\\"ש. אדו\\\"ן כ\\\"ל הוא יחוד הוי' אדנ\\\"י וק\\\"ל. ולזה אנו אומרים בברכת המזון. במרום ילמדו עליו ועלינו זכות שתהא למשמרת שלום. היינו שמירת הברית הוא יסו\\\"ד ונמצא חן ושכל טוב וכו' שלאחר שמירת היסוד נמצא חן בעיני אלהים ואדם כמו שמצינו ביוסף הצדיק וק\\\"ל: (מכי\\\"ק)",
            "explanation": "ביאור העניין הוא שכאשר האדם חוטא בברית, תפילתו אינה נשמעת ותורתו אינה עולה למעלה, ולכן נראה כאילו הוא משקר בתפילתו, כי פיו ולבו אינם שווים, ואין דבריו מתקבלים ברצון לפני הקב\"ה."
        },
        {
            "source": "Tiferet Shlomo, Festivals, Shaar Tefillah 23",
            "relevant_sentences": "\"אין משפטים ישירים\"",
            "passage": "הודו לד' כי טוב כי לעולם חסדו. הנה עיקר ההודאה והשבח הוא בשביל כללות ישראל. כי אם האדם נותן הודאה על עצמו. חוץ דהוא גריעות בנפש שאינו שמח בישועת בנ\\י אך הוא ג\\\"כ גרעון בהודאה עצמה. למשל בשנה זו שהקב\\\"ה נתן מטר על הארץ והארץ נתנה יבולה. אם האדם יתן הודאה על עצמו לבד אין ההודאה גדולה כל כך אך אם האדם נותן הודאה על כל העולם שריחם על נפשות האומללים והרעבים אזי נותן האדם הודאה עצומה. ובפרט מי שיש לו קצת עושר אזי בשביל עצמו אינה נחשבת לו כ\\\"כ הטובה הזאת. אבל אם מסתכל על כל העולם כולו אזי רואה גודל החסד שעשה הקב\\\"ה בשנה זאת. וז\\\"פ הכ' הודו לד' כי טוב כי לעולם חסדו. לא תהללו בשביל עצמיכם רק כל אחד יהלל לד' עבור כל העולם שנעשה עמהם חסד. וז\\\"פ הכ' גם את העולם נתן בלבם. כדי להודות ולהלל להקב\\\"ה על כל הטובות ולהתפלל עליהם. וז\\\"פ הכ' ופדויי ד' ישובון ובאו ציון ברנה ושמחת עולם על ראשם שהשמחה לא תהי' על כל אחד לעצמו רק כ\\\"א יהי' שמח בשמחת חבירו ובשמחת כל העולם. ובזה תגדל השמחה על כל העולם ועל הצדיקים עד מאד. ובזה יהי' ששון ושמחה ישיגו. אך לזה צריך להיות לו טהרת הנשמה והנפש לקיים ואהבת לרעך כמוך. וז\\\"פ בידיד נפש כו' בהראות לה נועם זיווך אז תתחזק ותתרפא והיתה לה שמחת עולם. עיקר הרפואה הוא לאדם אם יש לו שמחת עולם מכלל ישראל לראות בישועתם וגדולתם. וכבר אמרתי לפרש בזה דברי הש\\\"ס גדול העונה אמן יותר מן המברך כו' מה טעם לזה. אך הפי' בזה דמצינו תפלות בלשון יחיד דהיינו ברכת השחר שלא עשני עכו\\\"ם וכן כל הברכות כולם הולכים כל אחד ואחד לעצמו. פוקח עורים מלביש ערומים כמבואר במס' ברכות א\\\"כ אם אדם עונה אמן על ברכת חבירו ונותן הודאה לשמים על שחבירו נברא יהודי ורואה בעינים ויש לו מלבושים ושאר ענינים אזי גדול העונה אמן יותר מן המברך. כי זה מברך על עצמו וזה מברך על חבירו. וזה הי' מעלת יתרו ששמח על הטובה אשר עשה ד' לישראל. ויאמר ברוך ד' אשר הציל אתכם מיד מצרים שהוא לא הי' במצרים בכלל השיעבוד ונתן הודאה על ישראל. וזה כוונת המד\\\"ר שזהו הי' גנאי לישראל שלא ברכו להקב\\\"ה עד שבא יתרו ונתן הודאה. והרי ישראל אמרו שירה מקודם. אך הם נתנו הודאה על עצמם וזה אין כל כך חשיבות. אבל יתרו נתן הודאה על אחרים והוא דבר גדול ודו\\\"ק. וז\\\"פ רבים אומרים לנפשי מי יראנו טוב נסה עלינו אור פניך כו' היינו שהם מבקשים עבור עצמם. אבל אני איני כן. נתת שמחה בלבי מעת דגנם ותירושם רבו. וז\\\"פ צדקתך לא כסיתי בתוך לבי היינו בעת שהתפללתי והי' עת רצון לא המשכתי את הישועה לעצמי רק נחלק בשוה עם כל העולם. וזהו לא כחדתי חסדך ואמתך לקהל רב ובזה אתה ד' לא תכלא רחמיך ממני. היינו כל המבקש על חבירו והוא צריך לאותו דבר הוא נענה תחלה דהיינו אם אחד יש לו פרנסה ממסחר התבואה ומתפלל על הגשמים ובשעת הזול אין לו פרנסה. וז\\\"פ והוא צריך לאותו הדבר שיהי' ח\\\"ו יוקר. אז הוא נענה תחלה. כי לא על הלחם לבדו יחי' האדם כו'. וז\\\"פ בגמ' תבוא מארה למי שאשתו ובניו מברכים לו. למה דוקא ברכת המזון. אך הפי' שהוא נותן הודאה רק על מה שאשתו ובניו יש להם פרנסתם. רק ההודאה צריך להיות על כלל העולם. וז\\\"פ הגמ' אצל בועז דכתי' וייטב לבו שהי' מברך ברכת המזון. פי' בשעה שהי' בגורן וראה הברכה בתבואות הי' מברך להקב\\\"ה על הכלל ישראל. וז\\\"פ כי פקד ד' את עמו לתת להם לחם. להם דייקא. משום הכי כתי' כי שמעה. הא כולם שמעו. אלא פי' שמעה לשון שמחה מכלל ישראל ולא השגיחה על עצמה כלל. וז\\\"ש בישעי' ס\\\"ג חסדי ד' אזכיר כעל כל אשר גמלנו ד' ורב טוב לבית ישראל אשר גמלם כרחמיו וכרוב חסדיו ודו\\\"ק. וז\\\"פ הפ' כהניה בעיר גוועו כי בקשו אוכל למו וישיבו את נפשם היינו שהפרנסה אשר בקשו לא הי' רק עבור עצמם. וכן תשובה עבור עצמם. לפי שגם התשובה וכפרת עוונות צריך האדם להתפלל עבור כלל ישראל. וז\\\"פ על זאת יתפלל כל חסיד אליך לעת מצוא רק לשטף מים רבים אליו לא יגיעו. מים הם החסדים. והוא מתפלל רק עבור כלל ישראל לטובתם. אפי' אם הוא אינו נהנה כלל מן החסדים. וזה כל העולם ניזון בשביל חנינא בני כו'. וזהו נפתלי אילה שלוחה הנותן אמרי שפר. אילה היא החסידה שבחיות. והתפלה הזאת בוקעת כל הרקיעים. וז\\\"ש אם שגורה תפלתי בפי. היינו שהוא מתפלל עבור הכלל. התפלה זאת מקובלת ברצון. וז\\\"ש בש\\\"ס אין הקב\\\"ה מואס בתפלתם של רבים שנאמר הן אל כביר לא ימאס. ואמאי אין נשמע עדיין. אך הפי' אם כל אחד מתפלל על חבירו וצרכי רבים אזי תפלתו נשמעת. ובזה י\\\"ל העוסק בתורה ובגמ\\\"ח ומתפלל עם הצבור מעלה אני עליו כאלו פדאני לי ולבני מן הגלות. ג\\\"כ הפי' כן בכל מה שעוסק בתורה הוא עושה עם הצבור דהתורה מגינה ומציל כוונתו בלימודו שכל הצבור יהיו ניצולים מעבירות שבידם. ובגמילות חסדים כוונתו עם הצבור שהשכר של גמ\\\"ח יהי' ג\\\"כ עם הצבור. וכן מתפלל עם הצבור לטובת כלל ישראל",
            "explanation": "ביאור העניין הוא שכאשר האדם מתפלל ומבקש רק על עצמו ולא על כלל ישראל, נראה כאילו הוא משקר בתפילתו, כי עיקר התפילה וההודאה צריכים להיות על טובת הכלל ולא על טובת הפרט בלבד, וכך מתברר שהאדם אינו מכוון כראוי בתפילתו."
        },
        {
            "source": "Tiferet Shlomo, Torah, Bereshit 40",
            "relevant_sentences": "\"כי כן דרך היצה\\\"ר מסמא את עיני אדם לאמור כי בכל אשר הוא עושה עדיין לא חטא כלל ועודנו לא נתרחק כלל מהש\\\"י ואדרבא הוא מתאמר בנפשו עוד לאמור כי מצוה הוא עושה כל הימים\"",
            "passage": "וישמעו את קול ה' אלהים מתהלך כו' ויתחבא האדם ואשתו בתוך עץ הגן ויקרא לו ויאמר איכה וכו' ואירא כי עירום אנכי ואחבא. ויאמר מי הגיד לך כי עירום אתה המן העץ אשר צויתיך לבלתי אכל ממנו אכלת. ההרגש בפסוקים הללו מבואר בראשונים. והנראה בפירוש הענין ע\\\"ד מאמרם ז\\\"ל שקראו לאדה\\\"ר גנב שגנב מעץ הדעת לכך ויתחבא כי כאשר הבין האדם בעצמו שחטא מאד כי ראה הנחש כרוך אחריו ורע עליו המעשה כמ\\\"ש וידעו כי עירומים הם ערומים מכל מצוה ומכל טובה לכך ויתחבא בתוך עץ הגן הוא התורה ע\\\"ש ג\\\"ן פרשיות לתורה כמבואר בזוה\\\"ק והתחבא בתורה להמלט מזוהמת הנחש. ויקרא לו ה' איכה. ר\\\"ל איכה תמצא ידך ורגליך אחרי עשות המעשה כזה והשיב את קולך שמעתי ואירא כי עירום אנכי מכל טובה. ואמר לו הקב\\\"ה מי הגיד לך כי עירום אתה כי זה דרך הסט\\\"א וכל הדבקים בה להתנשאות ולגבהות לאמר כי חף אנכי מפשע כמו שאנו רואים כל הרשעים אומרים לנפשם צדיקים אנחנו ולא חטאנו וכמו זה אמה\\\"כ הנני נשפט אותך על אמרך לא חטאתי. כי כן דרך היצה\\\"ר מסמא את עיני אדם לאמור כי בכל אשר הוא עושה עדיין לא חטא כלל ועודנו לא נתרחק כלל מהש\\\"י ואדרבא הוא מתאמר בנפשו עוד לאמור כי מצוה הוא עושה כל הימים כמו שהשיא לחוה לאמר והייתם כאלהים לכן ההתחלת העבדות שיהיה האדם מכיר בעצמו כי חטא לה'. וצריך להיות תמיד פלס ומאזני משפט לפלס דרכיו אם יכונו באמת לה' ולא יעשה בנפשו שקר כמ\\\"ש דוד המלך ע\\\"ה ה' לי בעוזרי ואני אראה בשונאי. ר\\\"ל ה' לי בעוזרי עי\\\"כ אוכל לראות ולהכיר בשונאי לידע מי הוא האוהב אותי ומי הוא השונא המפתה אותי לדרך רעה כי היצה\\\"ט ויצה\\\"ר שניהם מפת' לדרך מצוה אך זה חלקו בחיים וזה אחריתו דרכי מות. לכן הודיעני דרך זו אלך. הורני ה' דרכיך. תעיתי כשה אובד בקש עבדך. ואל יהיה דבר זה קטן בעיני האדם לשום עינא פקיחא על נפשו בכל עניניו כי מצינו כן בצדיקים הגדולים שלא הכירו במעשיהם וחשבו למצוה והיה בהיפך כמו ענין מכירת יוסף כי עברו כ\\\"ב שנים ולא ידעו כי עשו עולה עד שראו תפיסת אחיהם ואת בנימין. אז אמרו אבל אשמים אנחנו וכתיב מיד אחריו כי המליץ בינותם ע\\\"י שהכירו שחטאו נעשה מליץ טוב עליהם. וכן היה רדיפת שאול לדוד כי סבור היה כי הוא מצוה להורגו. מעתה ק\\\"ו ב\\\"ב של ק\\\"ו לאנשים פחותי ערך כמונו עורי לב שכלו ימיהם בהבל צריך להבין ולהשכיל בפתוי היצה\\\"ר להנצל ממצודתו ודבריו הטובי' ולדעת כי איש חוטא הוא. וכזה המליצו חכז\\\"ל יש צדיק וטוב לו צדיק ורע לו רשע וטוב לו. ר\\\"ל שאומרים לנפשם כי טוב הוא ואינם יודעים בעצמם שום חטא כי הוא דומה בעיניו לצדיק וטוב לנפשו מאד. וז\\\"ש ג\\\"כ כאן מי הגיד לך כי עירום אתה המן העץ אכלת ועודך מכיר שחטאת מאין בא לך זאת והשיב כי האשה אשר נתת עמדי היא נתנה לי ומבואר במד\\\"ר כי הוא שוגג ולכך בשוגג כתיב או הודע אליו חטאתו כי עודנו זוכה להתוודע אליו חטאתו אבל במזיד אינו יודע כלל שחטא כי הכל טוב בעיניו וכשר לפניו. וד\\\"ל:",
            "explanation": "ביאור העניין הוא שבשעה שהאדם נופל ברשת היצר הרע, הוא עלול להאמין כי כל מעשיו הם מצוות ולא חטאים, ובכך נדמה כאילו פיו ולבו אינם שווים בתפילתו, שכן הוא מתפלל מתוך תחושת צדקות מדומה בעודו חוטא."
        },
        {
            "source": "Tiferet Shlomo, Torah, Toldot 24",
            "relevant_sentences": "\"לבו יודע מרת נפשו כי המרה את רוחו והלך בדרכי תעתועים בתאוות רעות וירא לנפשו לפתוח פיו. כמ\\\"ש אולי ימושני אבי והייתי בעיניו כמתעתע וכו'\"",
            "passage": "ותקח רבקה את בגדי עשו בנה הגדול החמודות כו' ותלבש את יעקב בנה הקטן. הנה בזה מורה לנו הכתוב דרך העבודה להש\\\"י כאשר הקדמנו לעיל בעניני התפלה בגשתו אל הרנה ואל התפלה ולבו יודע מרת נפשו כי המרה את רוחו והלך בדרכי תעתועים בתאוות רעות וירא לנפשו לפתוח פיו. כמ\\\"ש אולי ימושני אבי והייתי בעיניו כמתעתע וכו' אולם העצה הנכונה לזה עפ\\\"י מ\\\"ש בשם הבעש\\\"ט ע\\\"פ מאת כל איש אשר ידבנו לבו תקחו את תרומתי. היינו שכל אדם צריך לשית עצות בנפשו להפוך לעשות מדות טובות מכל אשר ידבנו לבו מהתאוות החיצוניו' ומדות הרעות אשר הרגיל בהם מהם יקח דרך לעבודת הבורא ב\\\"ה באותו חשק ובאותה התאווה ביתר שאת. ובזה פרשתי בפ' ציצית ולא תתורו אחרי לבבכם וכו' אשר אתם זונים אחריהם למען תזכרו ועשיתם כו'. פי' שלא יפול לב האדם בראותו הסתת היצר ח\\\"ו לתאוות רעות ולא יקשה בעיניו למה עשה כן הבורא ב\\\"ה להכניס האדם בעוה\\\"ז בעבודה קשה כזה. כי. באמת הוא לטובת האדם כי ממנו נקח לעבוד הבורא ב\\\"ה באותו חשק ובאותו תאווה. וזה ולא תתורו כו' אשר אתם זונים אחריהם. כי למען תזכרו ועשיתם את כל מצותי. כי ממנו נלמוד לעשות המצות בחשק נמרץ כנ\\\"ל. וזה ג\\\"כ הרמוז כאן ותקח רבקה את בגדי עשו כו' החמודות.הם התאוות והחמדות רעות של עשו כנ\\\"ל. ותלבש את יעקב בנה הקטן. הם הצדיקים שהם קטנים בעיניהם ומורא על ראשם לגשת אל הקודש. והם מלבישים אותו החשק והרצון של תאוות עוה\\\"ז לקחת אותו חשק לעבודת הבורא ב\\\"ה. וז\\\"פ ג\\\"כ ויגנוב יעקב את לב לבן הארמי. כי לבן הי' סבור שיעקב ילמוד ממנו דרכו ומדותיו. אך הוא הי' מהפך אותם לטובה. כנ\\\"ל:",
            "explanation": "ביאור העניין הוא שבשעת התפילה, כאשר האדם יודע בלבו כי הלך בדרכי תעתועים ותאוות רעות, הוא ירא לנפשו שמא ייראה בעיני הקב\"ה כמתעתע, כאילו פיו ולבו אינם שווים, ולכן עליו להפוך את התאוות לעבודת הבורא ביתר שאת."
        },
        {
            "source": "Tiferet Shlomo, Festivals, Shaar Tefillah 12",
            "relevant_sentences": "לכן הי' נותן לו בבקר מיד כדי שהעני יהי' יכול להתפלל ולהודות להקב\\\"ה שהזמין לו פרנסתו דאל\\\"כ בשעת התפלה הי' יכול העני ח\\\"ו להיות קורא תגר על הקב\\\"ה.",
            "passage": "ר' אלעזר יהיב פרוטה לעני והדר מצלי. היינו לעורר רחמים בעולם עוד י\\\"ל עפ\\\"י דברי רז\\\"ל מרבה צדקה מרבה שלום. שלום יעשה לי שהנותן צדקה עושה שלום בין הקב\\\"ה להעני. שהעני הולך ומהרהר ח\\\"ו בלבו על הקב\\\"ה לכל הוא נותן פרנסה כו'. ור\\\"א הי' נותן על הכוונה זו. לכן הי' נותן לו בבקר מיד כדי שהעני יהי' יכול להתפלל ולהודות להקב\\\"ה שהזמין לו פרנסתו דאל\\\"כ בשעת התפלה הי' יכול העני ח\\\"ו להיות קורא תגר על הקב\\\"ה. וז\\\"פ ר\\\"א יהיב פרוטה לעני והדר מצלי. היינו העני הי' מתפלל אח\\\"כ: (מכי\\\"ק)",
            "explanation": "ביאור העניין הוא שבשעת התפילה, אם העני לא קיבל פרנסתו, עלול הוא להרהר בלבו ח\"ו על הקב\"ה ולקרוא תגר, ונראה כאילו הוא משקר בתפילתו, ולכן ר' אלעזר היה נותן צדקה לעני קודם תפילתו כדי שיוכל להודות להקב\"ה בלב שלם."
        },
        {
            "source": "Tiferet Shlomo, Torah, Noach 16",
            "relevant_sentences": "אין משפטים ישירים",
            "passage": "במס' סנהדרין דף ק\\\"ח ע\\\"ב (אורשינא פירש\\\"י עוף ששמו חול בלשון המקרא ואינו מת לעולם) אשכחי' אבא דגני בספנא דתיבותא א\\\"ל לא בעית מזוני. א\\\"ל חזיתיך דהות טרידא אמינא לא אצערך. א\\\"ל יהא רעווא דלא תמות שנאמר ואומר עם קני אגוע וכחול ארבה ימים. הנראה ללמוד מזה כי כן יש בחי' צדיקים אשר קוראים אל ה' והוא יענם כמ\\\"ש בצרתה לי קראתי ויענני ובכל עת צרכותם קוראים אל ה' וכמ\\\"ש ונצעק וכו' וישמע את קולנו וכו' ויש בחי' צדיקים אשר אינם צועקים כלל על ענינם כמ\\\"ש טוב ויחיל ודומם לתשועת ה' ורק ברצון ובמחשבה לבד הם מצפים לישועה וכמ\\\"ש בזוה\\\"ק אצל אלישע לא בעינא לאטרוחי למארא וכמ\\\"ש באסתר לו. בקשה דבר. ועל הבחי' האלו נאמר רצון יראיו יעשה ואת שועתם ישמע ויושיעם. כי המעלה הראשונה הוא אשר ברצון לבד היא העליונה עליהם אמר הכתוב רצון יראיו יעשה. ואחרי' ואת שועתם ישמע ויושיעם שצועקים ונענים. וכזה היה ענין נח שלא התפלל כלום בכל צרתם רק נאמר ויזכור אלהי' את נח מאליו בא הזכרון בלא תפלה. ולכך אנו אומרים בפסוקי הזכרונות בר\\\"ה וגם את נח באהב' זכרת מעצמו עלה בזכרונך טוב לפניך כי אתה זוכר מעשה כולם ואין שכחה לפני כסא כבודך כמו כן תעלה זכרונינו לפניך בלא תפלה. ואח\\\"כ בשופרות אנו מזכירין רק קול בעלמא:",
            "explanation": "ביאור העניין הוא שישנם צדיקים אשר אינם זועקים בתפילתם אלא מצפים לישועה ברצון ובמחשבה בלבד, ולכן נראה כאילו אינם מתפללים כלל, אך באמת תפילתם היא במדרגה עליונה של רצון פנימי, וכך יכול להיראות כאילו הם משקרים בתפילתם כאשר אינם מבטאים את בקשותיהם בפה."
        },
        {
            "source": "Tiferet Shlomo, Torah, Vayishlach 9",
            "relevant_sentences": "אין משפטים ישירים",
            "passage": "ויאמר יעקב אל ביתו ואל כל אשר עמו הסירו את אלהי הנכר אשר בתוככם והטהרו ונקומה ונעלה בית אל. ואעשה שם מזבח וכו'. פירש\\\"י והטהרו מעבודת גלולים עכ\\\"ל. התורה מלמדת אותנו דרך לעבודת הבורא ב\\\"ה מדברי יעקב אבינו ע\\\"ה ונקדים דברי הש\\\"ס בקדושין כל שאינו יודע בטיב גיטין וקדושין לא יהי' לו עסק עמהם והרגישו המפורשים למה הקדימה גיטין לקדושין הלא בכ\\\"מ קדושין קודמין לגיטין דבתחלה האדם מקדש ואח\\\"כ אם מצא בה וכו' הוא מגרשה. אך נקדים דברי הש\\\"ס על פסוק מה ה' דורש ממך כי אם הצנע לכת עם ה' אלקיך. ודרשו חכז\\\"ל זה הוצאת המת והכנסת כלה. ונדחק רש\\\"י בפי' הש\\\"ס הזה. ועוד מה הוא הענין שדרשו דוקא הפי' הצנע לכת לשני דברים הללו דלמא הפי' הצנע לכת ליתן צדקה בסתר כמ\\\"ש מתן בסתר וכו' או להתפלל בהצנע כיון שכל הדברים טוב בהם הצניעות. ועוד מאי כי אם הצנע לכת וכי אם יקיים אדם הני תרי דברים הוצאות המת והכנסת כלה יותר אין הקב\\\"ה חפץ מן האדם. ולמה תרי\\\"ג מצות. אך נקדים לזה דברי הספרים הקדושים ובפרט האריז\\\"ל שכל המצות ותפלות ותורה ומעש\\\"ט שהאדם עושה אם חטא מקודם ולא עשה תשובה כל התפלות והמצות נוטלים הסט\\\"א וחיילותיו ואדרבא מוסיף כח לקליפה בתורה ומצות. ובזה פרשו הפסוק ולרשע אמר אלקים מה לך לספר חוקי וכו'. ובזה פרשו הפסוק סור מרע ועשה טוב היינו קודם עשיית הטוב מקודם צריך להיות סור מרע דהיינו לעשות תשובה. ובזה פרשו תשובה ומעשים טובים בעוה\\\"ז שלכל מעשים טובים שאנו עושים בעוה\\\"ז צריך תשובה מקודם ואח\\\"כ מעשים טובים. ובזה פרשנו ואמרנו שהדברים האלו מפורשים בתורה בפ' התשוב' בפ' וילך ושבת עד ה' אלקיך וכו' ושמעת בקולו ככל אשר אנכי מצוך וכו'. עוד שם פסוק אחר ואתה תשוב ושמעת בקול ה' כו' לשמור מצותיו וחוקותיו הכתובה בספר הזה כי תשוב אל ה' אלקיך כו' מבוארים הדברים שהתורה אומרת שהתשובה קודמת לכל המצות ומבלעדה לא ירים איש את ידו לעשות שום מצוה שהרי אמר הכתוב לשמור מצותיו וכו' כי תשוב וכו' שכל זמן שלא עשה תשובה הכל הולך לסט\\\"א. ובזה נחזור לש\\\"ס הנ\\\"ל הצנע לכת עם ה' אלהיך ע\\\"ד שאיתא בזוהר על פסוק הנסתרות לה' אלהינו שהיא יראה ואהבה שהם דברים שבלב. וזהו הצנע לכת עם ה' אלקיך שיראה ואהבה הם בהצנע לכת כי היא בתוך בנ\\\"א דהיינו השם י\\\"ה שהוא יראה ואהבה כמבואר בזוהר ותלך עם ה' אלקיך שהשם הוי' יהי' שורה עמך בכל דרכיך. וזהו הוצאות המת והכנסת כלה. וגם מבואר שס\\\"מ וסט\\\"א נקראים מתים. וזהו אמרו כאלו אכלו מזבחי מתים. וגם אמרו בש\\\"ס רשעים בחייהם קרוים מתים משום שהס\\\"ם וסט\\\"א שולטין על האדם הרשע כמאמר חכז\\\"ל רשעים יצה\\\"ר שופטן והן נקראים מתים לכן הרשעים שהם תחתיהן נקראים ג\\\"כ מתים כמוהם. וזה כוונת הש\\\"ס מעבירין את המת מלפני הכלה אם אדם רוצה להכניס הקדושה היינו השכינה הנקראת כלה לתוכו יצטרך מקודם לפנות המת ולהעבירו מלפני הכלה שאין אדם דר עם נחש וכו' ומכ\\\"ש הקב\\\"ה. וזה רמז הכתוב בפ' חיי שרה בדברי לבן ויאמר בא ברוך ה' למה תעמוד בחוץ ואנכי פניתי הבית ופרש\\\"י פניתי הבית מע\\\"ג רמז לנו הכתוב שקודם פניות הבית מע\\\"ג היינו פנימיות ועקמימות שבלב ע\\\"ד לא יהי' בך אל זר היינו היצה\\\"ר שבלבבו של אדם שאי אפשר לבוא בתוכו ברוך ה' ומכש\\\"כ השכינה וכמבואר בזוהר שצריך כל אדם להעביר הסט\\\"א מכל אבר ואבר אז שורה השכינה עליו. וזה רמזו רז\\\"ל זהו הוצאות המת והכנסת כלה היינו השכינה הנקראת כלה וזהו כל שאינו יודע בטיב גיטין וקדושין קודם כל מצוה. שידוע עיקר כוונת כל מצוה היתה להתקדש אותנו בהם כמ\\\"ש אומרים אשר קדשנו במצותיו שבכל מצוה ומצוה אנו מוסיפין עלינו קדושה ואם האדם נתעב בחטאיו ועוונו אין הקדושה יכולה לשרות על האדם כי אין אדם דר עם נחש וכו'. וזה נקרא גיטין היינו גרושין. וזה כל שאינו יודע בטוב גיטין וקדושין היינו מקודם גיטין ואח\\\"כ קדושין. ומזה פרשתי הכתוב משכו וקחו לכם צאן ופרשו רז\\\"ל משכו ידיכם מע\\\"ג שזה היתה מצוה ראשונה כמאמר חכז\\\"ל לא הי' צריך התורה להתחיל אלא מהחודש הזה לכם למדה התורה אותנו שקודם עשיית הקרבן שהיא מצות קרבן פסח למשוך ידיהם מע\\\"ג. ולזה היתה הרמזים וכוונת התורה במצוה הראשונה בפסח שיצאו מתתת הסט\\\"א היינו מיד מצרים דכל זמן שהיו תחת יד מצרים היו תחת יד הסט\\\"א כמבואר בספרים. אך אחר שיצאו ממצרים מתחת שיעבודם הי' כוונת הקב\\\"ה שיצאו מתחת יד שיעבוד היצה\\\"ר. ולזה מצוה ראשונה הוא פסח ואכילת מצה היינו להתקדש גופו של בנ\\\"י בהשראת הקדושה צוה הש\\\"י לגרש הסט\\\"א והיצה\\\"ר דהיינו ביעור חמץ הוא היצה\\\"ר כמבואר בזוה\\\"ק ובספרים. ולזה אמה\\\"כ אחר מצות קרבן פסח ואמר עוד ז' ימים מצות תאכלו אך ביום הראשון תשביתו שאור מבתיכם היינו מערב יו\\\"ט ולא ביו\\\"ט עצמו ע\\\"ד שאמרו מעבירין את המת מלפני הכלה. וזה כוונת רבא בש\\\"ס בפסחים דף ה' אך ביום הראשון הוא מעיו\\\"ט ולא ביו\\\"ט עצמו הרי נאמר לא תשחט על חמץ דם זבחי א\\\"כ ראינו שכוונת הכתוב שקודם עשיית המצוה יהי' ביעור חמץ. ולזה אמר אח\\\"כ ושמרתם את המצות ודדשו חכז\\\"ל אל תיקרי מצות אלא מצוות הרמז שבכל המצות צריך מקודם ביעור חמץ. ולזה יש לומר מה שמקשים שבדברי משה לא נזכר רק עשיית הפסח ולא נזכר כלל ביעור חמץ. אך במה שאמר משכו ידיכם מע\\\"ג כדרשת חכז\\\"ל ממילא מרמז בזה מצות ביעור חמץ כנ\\\"ל. ולזה בא הרמז בסמיכות בפ' כי תשא אלהי מסכה לא תעשו לכם את חג המצות תשמור. עוד רמז בכ' ובא השמש וטהר ואחר יאכל מן הקדשים. וזה ג\\\"כ בפ' משפטים לא תשתחוה לאלהיהם ולא תעבדם וכו' ושבר תשבר מצבותיהם ועבדתם את ה' אלהיכם כו'. וזה ג\\\"כ הרמז בפ' אדם כי יקריב מכם קרבן לה' מן הבהמה כו' תקריבו את קרבנכם. היינו מקודם צריך להקריב הבהמיות שבאדם לעשות לה' בכל דרכיך דעהו ואח\\\"כ אדם כי יקריב מכם כו' יכול האדם להתקרב להקב\\\"ה. וכן נאמר בפ' קדושים לרצונכם תזבחוהו היינו הרצון הרע שבכם תזבחוהו קודם עשיית הקרבן. וזה היתה כוונת יעקב אבינו ע\\\"ה בפסוק הזה הסירו את אלהי הנכר אשר בקרבכם ע\\\"ד שאמרו חכז\\\"ל לא יהי' בך אל זר זה היצה\\\"ר שהוא בתוך לבו של אדם והטהרו מע\\\"ג כפרש\\\"י ונקומה ונעלה בית אל ונעשה שם מזבח כו' היינו כנ\\\"ל שקודם עשיית המצוה ובפרט הקרבנות. הסירו את אלהי הנכר כו'. כן יהי רצון בכל מעשינו אמן:",
            "explanation": "ביאור העניין הוא שכאשר האדם לא עשה תשובה קודם תפילתו, אזי כל תפילותיו ומעשיו הטובים נלקחים על ידי הסטרא אחרא, ונראה כאילו פיו ולבו אינם שווים, כי אין הקדושה שורה עליו."
        },
        {
            "source": "Tiferet Shlomo, Torah, Vaera 1",
            "relevant_sentences": "אין משפטים ישירים",
            "passage": "וידבר אלהים אל משה ויאמר אליו אני ה' . להבין ענין האמירה הזאת שאמר אליו אני ה' מה אמר לו. אך הנה באה ללמד לאדם דעת להבין בעצמו כי בכ\\\"ע עמדו לפני ה' בתורה ותפלה כי הוא איננו כדאי וראוי לזכות ולעמוד לפתוח פיו לפני הש\\\"י ממה\\\"מ הקב\\\"ה ואינו בכחו לדבר מאומה זולת מחסד הבורא עליו אשר ישים דבר בפיו לאמר כה תדבר כמש\\\"א דוד המלך ע\\\"ה כי אין מלה בלשוני הן ה' ידעת כלה. לכן צריך האדם להכנע ולשבר לבבו קודם הלימוד והתפלה להתפלל לה' ולשאול ממנו מענה לשון כמ\\\"ש בברכת התורה אשר קדשנו במצותיו וצונו לעסוק בדברי תורה. ואעפ\\\"כ מתפללים והערב נא כו' את דברי תורתך בפינו שיהיה בו עריבות ומתיקות לפניך להיות נחת רוח לפני כסא כבודך אע\\\"פ שהאדם מחויב ללמוד במצות הבורא בחיוב דאורייתא מ\\\"מ אינו כשאר מלאכות שמחויב לראות להשלים פעולתו אשר נשלח אליה כי אורייתא צריך הקדמת דחילו ורחימו וכן בתפלה ושאר כל המצות כי הוא רק חסד עליון אשר יזכה האדם השפל לעמוד לפניו ולהתפלל כמ\\\"ש הללו את ה' מן השמים. ר\\\"ל להודות ולהלל לפניו ית\\\"ש הוא ג\\\"כ סיוע מן השמים טוב ה' לכל ורחמיו על כל מעשיו יודוך ה' כו' כל זה מצד הרחמנות אשר יודוך כל מעשיך. לכן אל יפול לב האדם עליו בראותו כי הקדים ליגע קודם התפלה הרבה בלימוד שיעורין כסדרן ואעפ\\\"כ מתהפך הוא בתחבולותיו בשעת התפלה ואיננה שגורה בפיו ואיננו יכול להתפלל כי הכל הוא מן השמים והוא יעשה את שלו. ועל כזה רמזו רז\\\"ל אל תעש תפלתך קבע. ענין הקביעות הוא הבא בכל עת בטבע. כן אל תעש תפלתך מצד שלמדת הרבה קודם התפלה בקביעות ועי\\\"כ נכון לך להתפלל. לא כן אלא רחמים ותחנונים לפני המקום מצד הרחמנות תבא לפני המקום. וכן נאמר ואתחנן כו' פרש\\\"י מתנת חנם אע\\\"פ שיש להם לצדיקים לתלות במעשיהם הטובים אעפ\\\"כ אינם מבקשים רק מתנת חנם. ר\\\"ל שיש להם לתלות שיהיה תפלתם נכונה ע\\\"י מעשיהם הטובים שלמדו הרבה ועשו מעש\\\"ט קודם התפלה אעפ\\\"כ אינם מבקשים ר\\\"ל הבקש' שלהם אינה רק מתנת חנם כנ\\\"ל. וז\\\"ש שצריך לומר קודם שמ\\\"ע אדני שפתי תפתח כי לולא זאת איך יכול לעמוד בתפל' כי איך יזכה ילוד אשה לעמוד לפני הקב\\\"ה. הנה כזה היה הענין אצל משרע\\\"ה ציר נאמן כי שלחו ה' לפדו' את בנ\\\"י ולהוציאם ממצרים ומשרע\\\"ה באהבתו לישראל הלך בהתלהבות לקיים דבר השליחות וכאשר ראה כי לא שמעו לו הרע בעיניו והתחיל לזעוק למה הרעות. אמר לו הקב\\\"ה דע לפני מי אתה עומד כי אני ה' כמו שמבואר בזוה\\\"ק מקמאי מלילת מילין אילין. ודו\\\"ק:",
            "explanation": "ביאור העניין הוא שבשעת התפילה, כאשר האדם מתייגע בלימוד ומעש\"ט קודם התפילה, עלול להיראות כאילו פיו ולבו אינם שווים, כי תפילתו אינה שגורה בפיו, אך באמת זוהי תזכורת שהכל תלוי ברחמי שמים ולא במעשיו בלבד."
        },
        {
            "source": "Tiferet Shlomo, Torah, Vaetchanan 20",
            "relevant_sentences": "גם בעמדם בתפלה שפתותיהם נעות ולבם בל עמהם.",
            "passage": "רק השמר לך ושמור את נפשך מאד כו' ופן יסור מלבבך כל ימי חייך והודעתם לבניך ולבני בניך כו' יום אשר עמדת כו' אשר ילמדון ליראה אותי כל הימים אשר הם חיים עלהאדמה ואת בניהם ילמדון. הנה לכאורה אין קשור לפסוקים הללו. גם מה שאמר פן יסורו מלבבך והודעתם לבניך. כיון שיסורו מלבבו איך יודיעום לבניהם. ונראה לפרש בדרך צחות על אותן בני אדם שהם עסוקים בהבלי עולם ומטפשין ומסירים מעל לוח לבם מצות השי\\\"ת. גם בעמדם בתפלה שפתותיהם נעות ולבם בל עמהם. ורק את בניהם אשר יוולד להם הם מייסרין אותם ללכת אל בית הספר שלא לבטל רגע אחת רק יעסקו בתורה ותפלה. והוא אינו משים אל לבו מה שהוא ממעט בעבודתו ית\\\"ש ואיך ימלא לבבו להוכיח אחרים בשבט מוסר ובניו מומם ואינו מרגיש מומו הפוסל אותו. וזה שמרמז הכתוב השמר לך כו' ופן יסורו מלבבך. ר\\\"ל אתה בעצמך תסור מלילך בדרכי השם. והודעת' לבניך. היינו שתוכיח רק את בניך שהם ילמדו ועל עצמך לא תשגיח כלל. לא זו הדרך ישכון אור רק אשר ילמדון ליראה כו' שהם עצמם ילמדו מקודם ליראה כו' ואח\\\"כ את בניהם ילמדון:",
            "explanation": "ביאור העניין הוא שבשעה שאדם עומד בתפילה ושפתותיו נעות אך לבו אינו עמו, נראה כאילו הוא משקר בתפילתו, שכן פיו ולבו אינם שווים, והרי זה כאילו הוא עוסק בהבלי עולם ולא בעבודת השי\"ת באמת."
        },
        {
            "source": "Tiferet Shlomo, Festivals, Sukkot 51",
            "relevant_sentences": "\"אין משפטים ישירים\"",
            "passage": "יהי לבי תמים בחוקיך למען לא אבוש. ובמד\\\"ר שבקש דוד המלך ע\\\"ה אף בשעת עשיית המצוות יהי' לבי תמים כי אע\\\"פ שלכך נברא היצה\\\"ר לבעבור תהי' הבחירה ביד האדם בכל זה צריך להתפלל שיעשה המצות בתמימות בלי שום פני' חיצונית למען לא אבוש כי באמת אם האדם עושה המצוה לשום כוונה חיצונית חלילה אז אח\\\"כ בעולם העליון הוא מתבייש מאד על סכלותו אשר לא טוב עשה וכמעשה המובא בס' ר' ייבא באחד שהגיד לחבירו בחלום איך שהוא מתבייש וחרפה תכסה פניו בהכריז עליו המלאך כוונת המצות אשר עשה בעולם הזה וכל הצדיקים ינוסו לקולם מג\\\"ע בשמעם אוולתו ופגמו ולכך צריך האדם להתפלל שלא יבוש בעה\\\"ב וזהו אחת שאלתי מאת ד' אותה אבקש שבתי בבית ד' כל ימי חיי פי' כל ימי חיי יעלו לפני ד'. לחזות בנועם ד'. פי' שאוכל לחזות ולהתראות לפני ד' ולא אבוש:",
            "explanation": "ביאור העניין הוא שבשעת עשיית המצוות, כאשר האדם מכוון כוונה חיצונית ולא לשם שמים, אזי בעולם העליון הוא מתבייש על סכלותו, וכך נראה כאילו פיו ולבו אינם שווים, ולכן יש להתפלל שיעשה המצוות בתמימות למען לא יבוש."
        },
        {
            "source": "Tiferet Shlomo, Torah, Beha'alotcha 1",
            "relevant_sentences": "אין משפטים ישירים",
            "passage": "ונסעו הקהתים נושאי המקדש. ופרש\\\"י נושאי דברים המקודשים. לכאורה דברי רש\\\"י הם אך למותר. כי כבר בסוף פ' במדבר במשא בני קהת באוהל מועד קודש הקדשים פרש\\\"י שם ג\\\"כ המקודש שבכלים הארון והשלחן ומזבחות והפרכת וכלי השרת. אמנם י\\\"ל כי הנה ידוע כי הצדיקים שבדור הם בתפלתן מעלים התפלות של כל ישראל אפי' מפחותי הערך הגם שלא התפללו בדו\\\"ר כמאמר הספרים על פסוק ועתה הנה צעקת בנ\\\"י באה אלי מהו לשון ועתה ופרשו ועתה תיכף בעת הזאת אחרי שהי' מעט דבר ה' אל משה הנה צעקת בנ\\\"י באה אלי בדבר ה' אליו מיד העלה תפלתן וזעקתם. וז\\\"ש בעבור ישמע העם בדברי עמך אל תיקרי ישמע אלא ישמע ופירושו ישמע תפלת העם בדברי עמך ע\\\"י דברי עמך. וזה ג\\\"כ היתה עבודת הלוים להעלות תפלת ישראל ופרש\\\"י נושאי דברים המקודשים לשון דיבורים המקודשים אפי' התפלות שלא נאמרו בדו\\\"ר כתקנת חכז\\\"ל אנשי כנה\\\"ג מכל מקום הם דיבורים המקודשים והלוים נושאים בתפלתם אלו הדיבורים המקודשים אל מקור העליון אשר זולתם לא עלו למקור העליון:",
            "explanation": "ביאור העניין הוא שבשעת התפילה, אף אם האדם אינו מתפלל בכוונה שלמה ובדברים שאינם כתקנת חז\"ל, הצדיקים והלוויים מעלים את תפילותיו למעלה, ונראה כאילו פיו ולבו אינם שווים, אך באמת תפילתו נחשבת לדיבורים מקודשים בזכות העלאתם על ידי הצדיקים."
        },
        {
            "source": "Tiferet Shlomo, Festivals, Shaar Tefillah 24",
            "relevant_sentences": "\"אל יהי' האדם שפל בשעת התפלה ויורד במחשבתו אל שחת.\"",
            "passage": "מזמור שיר חנוכת הבית לדוד. סדרו אנשי כנה\\\"ג לומר מזמור זה קודם התפלה. דהנה ידוע שהתפלה היא העיקר ההכנעה קודם התפלה לחשוב ברוממות האל ובשפלות עצמו ובעונותיו המרובים. והנה יכול ליפול לב האדם לגמרי ויאמר מה תועלת בתפלתי בוודאי לא יעלה לרצון למעלה כלל וזה הוא שני ההפכים בנושא אחד. ולזה צריך אמונה להאדם ויגבה לבו בדרכי השם שאדרבא תפלתו עולה למעלה ובוקע חלוני רקיע. ובזה י\\\"ל דברי המדרש. אם מזרע היהודים מרדכי כו' כשהם יורדים יורדים עד לעפר וכשהם עולים עולים עד לרקיע. ובזה יש לפרש דברי התפלה ונפשי כעפר לכל תהי' פתח לבי בתורתך וכו'. ולזה אמר אברהם הנה נא הואלתי לדבר ואנכי עפר ואפר. זה בשעה שהתחיל להתפלל. ואח\\\"כ צריך האדם להתחזק יותר ויותר כמו שאמר אברהם אולי יש חמשים צדיקים בתוך העיר וכו' אולי יש עשרה. היוצא מזה דבשעה שמתחיל האדם להתפלל צריך להיות כמו עפר בעצמו ואח\\\"כ עולה למעלה וזהו ממש כמו בבנין הבית שמתחלה חופר אדם בקרקע להניח יסוד ולבנותו ואח\\\"כ עולה ובונה עד לשמים. וז\\\"פ מזמור שיר חנוכת הבית לדוד. אליך ד' אקרא כו'. מה בצע בדמי ברדתי אל שחת היודך עפר. דהוא תמוה מאד דמאי הו\\\"א לאדם שיהי' לו ריווח שיבא אל השחת וכמובן. אך להנ\\\"ל ניחא דהפי' במחשבה. שאל יהי' האדם שפל בשעת התפלה ויורד במחשבתו אל שחת. ע\\\"ז אמר היודך עפר אם אהי' שפל ונבזה יותר מדאי א\\\"כ לא יהי' באפשר כלל להתפלל וכו'. פתחת שקי ותאזרני שמחה למען יזמרך כבוד ולא ידום היינו כנ\\\"ל שהקב\\\"ה יחזק לאדם ויסיר ממנו העצבות מעבירות שבידו למען יזמרך כבוד (ע\\\"ד שכ' האור המאיר) וז\\\"פ הפ' סור מרע ועשה טוב. שיפנה מחשבתו מהעבירות ויעשה טוב. וכן נ\\\"ל הפי' בפסוק בטח בד' ועשה טוב. דהנה כתיב אל תבטחו באלוף כדרשת חכז\\\"ל. אך כדי לעשות הטוב אסור להיות עניו. ולזה פירשו המפרשים העשיר לא ירבה והדל לא ימעיט אפי' כל העולם אומרים עליך כו' תהי' בעיניך כרשע. ואל תהי רשע בפני עצמך היינו כנ\\\"ל. ואין סתירה לב' הדברים אלו. (וזה הפי' אם מזרע היהודים כו' כשהם עולים כו'. דהנה אסתר אמרה כי אין לבא אל המלך בלבוש שק היינו בעצבות ולכך ותלבש אסתר מלכות ותעמוד בחצר בית המלך הפנימית. והנה החכמים היו רואים שמרדכי לובש שק וחשבו שלא יהי' נשמע בקול תפלתו אבל עכשיו שהסירה השק מעליו והלבישתו בגדי מלכות א\\\"כ יעלה תפלתו וכשהם עולי' עולי' עד לשמים. אין עמידה אלא תפלה. (עיי' בדרוש פורים בפ' והרכיבהו). וזהו ממעמקי' קראתיך ד' ד' שמעה כו' אם עונות תשמר יה אדני מי יעמוד. היינו תפלה. ואני בחסדך בטחתי יגל לבי בישועתך. אני בטוח שתושיעני. כי בהישועה אין אני שמח על עצמי רק על ישועת ישראל וזהו ישועת הקב\\\"ה כמ\\\"ש במד\\\"ר על פסוק לד' הישועה על. עמך ברכתך סלה. (וכן הפי' פתחת שקי ותאזרני שמחה. שהשמחה היא למען יזמרך כבוד). וזה הפי' אחור וקדם צרתני דהקב\\\"ה חפץ בזה שיהי' האדם שפל בדעתו ובשעת התפלה יהי' בהתרוממות שבונה עולמות בתפלתו. פליאה דעת ממני נשגבה לא אוכל לה. שיהי' ב' הפכיים בנושא אחד. אך התירוץ אנה אלך מרוחך ואנה מפניך אברח וכו' ע\\\"ד שכ' בס' מבשר צדק בפ' ויגש ע\\\"ש. העבר עיני מראות שוא בדרכיך חייני. העבר חרפתי אשר. יגורתי כו' זדים הליצוני עד מאד מתורתך לא נטיתי. רחוק מרשעים ישועה כי חוקיך לא דרשו. אליו פי קראתי ורומם תחת לשוני. און אם ראיתי בלבי כו'. וזה הכוונה הלוחות ושברי לוחות מונחים בארון. דארון הוא כינוי ללב כמבואר בזוהר הקדוש ושברי לוחות הוא לזכרון העונות שאז לדור המדבר היו לזכרון מעשה העגל זכור אשר הקצפת. ועכשיו יש לכל אדם יותר ויותר עונות מדור המדבר כידוע. ולכן מונחים בארון: (מכי\\\"ק)",
            "explanation": "ביאור העניין הוא שבשעת התפילה, אם האדם שפל במחשבתו יתר על המידה ויורד אל שחת, הרי זה נראה כאילו פיו ולבו אינם שווים, שכן תפילתו אינה עולה לרצון למעלה, אלא נראית כשקרית וחסרת כוונה אמיתית."
        }
    ]
}