{
    "question": "in which scenario can it appear as if a person is lying in his prayers?",
    "analyzed_passages": [
        {
            "source": "Tiferet Shlomo, Torah, Miketz 4",
            "relevant_sentences": "אין משפטים ישירים",
            "passage": "ויהי מקץ וכו'. פרש\\\"י כל לשון קץ סוף הוא. הנראה לרמז בדבריו הקדושים עפ\\\"י מ\\\"ש בפי' הפיוט קדם רבון עלמין במילין סתימין וכו'. להורות לכל איש בגשתו אל הרנה ואל התפלה על כל מחסורו בעניני עוה\\\"ז אשר יחסר לו לא ישים מגמתו על מצוקותיו רק יהיה עיניו ולבו על גודל צער גלות השכינה כמ\\\"ש בספרים על המשנה באבות דע מה למעלה ממך. פי' מהחסרון שחסר לך למטה תוכל להבין החסרון שנוגע למעלה צער גלות השכינה. וז\\\"ש ושמחתים בבית תפלתי תפלתם לא נאמר אלא תפלתי. פי' שיהיה עיקר תפלתם למען כבודו ית\\\"ש. וזה הרמז בגמ' שנים שנכנסו להתפלל. פי' בשעת התפלה צריך להיות בשני בחי'. מה שנוגע למעלה וגם בצרכי נפשו למטה. לכן במשה רבינו כשהיה מתפלל עבור אחותו כתיב אל נא רפא נא לה. הרמז בזה רפא נא לה' האחרונה בשם הוי' לעשות היחוד למעלה ואז ממילא תתרפא. וז\\\"פ לא על צדקותינו אנחנו מפילים תחנונינו לפניך כי על רחמיך הרבים. וז\\\"ש ואתה ברחמיך הרבים עמדת להם בעת צרתם. פי' שהעמידו נגד עיניהם צער גלות השכינה שהקב\\\"ה כביכול סובל גודל צער בנ\\\"י וכאשר באו למדריגה זו לעורר רחמי שמים אז נצמח להם הישועה רבת את ריבם. העולה מזה כי גם בכל נוסח התפלה שאנו מתפללים בשמ\\\"ע רפאנו ברך עלינו וכדומה הנראי' לעיני בשר כי הם דברים פשוטים הנצרכים בעוה\\\"ז. אמנם הם עומדים ברומו של עולם. וז\\\"פ קדם רבון עלמין במילין סתימין. כי במחשבה היא דברים סתומים לכן עולה לרצון למעלה. וז\\\"ש שועתנו קבל ושמע צעקתנו יודע תעלומות. פי' מה שאנו צועקים על מחסורינו אתה היודע תעלומות לבבנו כי כל כוונתינו על צער גלות השכינה כנ\\\"ל. ונחזור לענין הנ\\\"ל שזה רמז בדברי רש\\\"י במתוק שפתיו. רהי מקץ כל לשון קץ. פי' הצדיק כזה אשר כל לשונו בתפלתו הוא רק על הקץ ומצפה לישועת ה'. סוף הוא. פי' הוא אשר יזכה להיות בסוף ולראות במהרה בישועה ונחמה בבוא הגאולה ב\\\"ב. אמן:",
            "explanation": "ביאור העניין הוא שבשעת התפילה, כאשר האדם מתמקד רק בצרכיו האישיים ואינו מכוון את לבו לצער גלות השכינה ולכבוד ה', נראה כאילו תפילתו היא שקרית, כי עיקר הכוונה צריכה להיות למען כבודו יתברך ולא רק על מחסורו הפרטי."
        },
        {
            "source": "Tiferet Shlomo, Festivals, Shaar Tefillah 23",
            "relevant_sentences": "אין משפטים ישירים",
            "passage": "הודו לד' כי טוב כי לעולם חסדו. הנה עיקר ההודאה והשבח הוא בשביל כללות ישראל. כי אם האדם נותן הודאה על עצמו. חוץ דהוא גריעות בנפש שאינו שמח בישועת בנ\\י אך הוא ג\\\"כ גרעון בהודאה עצמה. למשל בשנה זו שהקב\\\"ה נתן מטר על הארץ והארץ נתנה יבולה. אם האדם יתן הודאה על עצמו לבד אין ההודאה גדולה כל כך אך אם האדם נותן הודאה על כל העולם שריחם על נפשות האומללים והרעבים אזי נותן האדם הודאה עצומה. ובפרט מי שיש לו קצת עושר אזי בשביל עצמו אינה נחשבת לו כ\\\"כ הטובה הזאת. אבל אם מסתכל על כל העולם כולו אזי רואה גודל החסד שעשה הקב\\\"ה בשנה זאת. וז\\\"פ הכ' הודו לד' כי טוב כי לעולם חסדו. לא תהללו בשביל עצמיכם רק כל אחד יהלל לד' עבור כל העולם שנעשה עמהם חסד. וז\\\"פ הכ' גם את העולם נתן בלבם. כדי להודות ולהלל להקב\\\"ה על כל הטובות ולהתפלל עליהם. וז\\\"פ הכ' ופדויי ד' ישובון ובאו ציון ברנה ושמחת עולם על ראשם שהשמחה לא תהי' על כל אחד לעצמו רק כ\\\"א יהי' שמח בשמחת חבירו ובשמחת כל העולם. ובזה תגדל השמחה על כל העולם ועל הצדיקים עד מאד. ובזה יהי' ששון ושמחה ישיגו. אך לזה צריך להיות לו טהרת הנשמה והנפש לקיים ואהבת לרעך כמוך. וז\\\"פ בידיד נפש כו' בהראות לה נועם זיווך אז תתחזק ותתרפא והיתה לה שמחת עולם. עיקר הרפואה הוא לאדם אם יש לו שמחת עולם מכלל ישראל לראות בישועתם וגדולתם. וכבר אמרתי לפרש בזה דברי הש\\\"ס גדול העונה אמן יותר מן המברך כו' מה טעם לזה. אך הפי' בזה דמצינו תפלות בלשון יחיד דהיינו ברכת השחר שלא עשני עכו\\\"ם וכן כל הברכות כולם הולכים כל אחד ואחד לעצמו. פוקח עורים מלביש ערומים כמבואר במס' ברכות א\\\"כ אם אדם עונה אמן על ברכת חבירו ונותן הודאה לשמים על שחבירו נברא יהודי ורואה בעינים ויש לו מלבושים ושאר ענינים אזי גדול העונה אמן יותר מן המברך. כי זה מברך על עצמו וזה מברך על חבירו. וזה הי' מעלת יתרו ששמח על הטובה אשר עשה ד' לישראל. ויאמר ברוך ד' אשר הציל אתכם מיד מצרים שהוא לא הי' במצרים בכלל השיעבוד ונתן הודאה על ישראל. וזה כוונת המד\\\"ר שזהו הי' גנאי לישראל שלא ברכו להקב\\\"ה עד שבא יתרו ונתן הודאה. והרי ישראל אמרו שירה מקודם. אך הם נתנו הודאה על עצמם וזה אין כל כך חשיבות. אבל יתרו נתן הודאה על אחרים והוא דבר גדול ודו\\\"ק. וז\\\"פ רבים אומרים לנפשי מי יראנו טוב נסה עלינו אור פניך כו' היינו שהם מבקשים עבור עצמם. אבל אני איני כן. נתת שמחה בלבי מעת דגנם ותירושם רבו. וז\\\"פ צדקתך לא כסיתי בתוך לבי היינו בעת שהתפללתי והי' עת רצון לא המשכתי את הישועה לעצמי רק נחלק בשוה עם כל העולם. וזהו לא כחדתי חסדך ואמתך לקהל רב ובזה אתה ד' לא תכלא רחמיך ממני. היינו כל המבקש על חבירו והוא צריך לאותו דבר הוא נענה תחלה דהיינו אם אחד יש לו פרנסה ממסחר התבואה ומתפלל על הגשמים ובשעת הזול אין לו פרנסה. וז\\\"פ והוא צריך לאותו הדבר שיהי' ח\\\"ו יוקר. אז הוא נענה תחלה. כי לא על הלחם לבדו יחי' האדם כו'. וז\\\"פ בגמ' תבוא מארה למי שאשתו ובניו מברכים לו. למה דוקא ברכת המזון. אך הפי' שהוא נותן הודאה רק על מה שאשתו ובניו יש להם פרנסתם. רק ההודאה צריך להיות על כלל העולם. וז\\\"פ הגמ' אצל בועז דכתי' וייטב לבו שהי' מברך ברכת המזון. פי' בשעה שהי' בגורן וראה הברכה בתבואות הי' מברך להקב\\\"ה על הכלל ישראל. וז\\\"פ כי פקד ד' את עמו לתת להם לחם. להם דייקא. משום הכי כתי' כי שמעה. הא כולם שמעו. אלא פי' שמעה לשון שמחה מכלל ישראל ולא השגיחה על עצמה כלל. וז\\\"ש בישעי' ס\\\"ג חסדי ד' אזכיר כעל כל אשר גמלנו ד' ורב טוב לבית ישראל אשר גמלם כרחמיו וכרוב חסדיו ודו\\\"ק. וז\\\"פ הפ' כהניה בעיר גוועו כי בקשו אוכל למו וישיבו את נפשם היינו שהפרנסה אשר בקשו לא הי' רק עבור עצמם. וכן תשובה עבור עצמם. לפי שגם התשובה וכפרת עוונות צריך האדם להתפלל עבור כלל ישראל. וז\\\"פ על זאת יתפלל כל חסיד אליך לעת מצוא רק לשטף מים רבים אליו לא יגיעו. מים הם החסדים. והוא מתפלל רק עבור כלל ישראל לטובתם. אפי' אם הוא אינו נהנה כלל מן החסדים. וזה כל העולם ניזון בשביל חנינא בני כו'. וזהו נפתלי אילה שלוחה הנותן אמרי שפר. אילה היא החסידה שבחיות. והתפלה הזאת בוקעת כל הרקיעים. וז\\\"ש אם שגורה תפלתי בפי. היינו שהוא מתפלל עבור הכלל. התפלה זאת מקובלת ברצון. וז\\\"ש בש\\\"ס אין הקב\\\"ה מואס בתפלתם של רבים שנאמר הן אל כביר לא ימאס. ואמאי אין נשמע עדיין. אך הפי' אם כל אחד מתפלל על חבירו וצרכי רבים אזי תפלתו נשמעת. ובזה י\\\"ל העוסק בתורה ובגמ\\\"ח ומתפלל עם הצבור מעלה אני עליו כאלו פדאני לי ולבני מן הגלות. ג\\\"כ הפי' כן בכל מה שעוסק בתורה הוא עושה עם הצבור דהתורה מגינה ומציל כוונתו בלימודו שכל הצבור יהיו ניצולים מעבירות שבידם. ובגמילות חסדים כוונתו עם הצבור שהשכר של גמ\\\"ח יהי' ג\\\"כ עם הצבור. וכן מתפלל עם הצבור לטובת כלל ישראל",
            "explanation": "ביאור העניין הוא שכאשר האדם מתפלל רק על עצמו ואינו כולל בתפילתו את כלל ישראל, נראה כאילו הוא משקר בתפילתו, שכן תפילתו צריכה להיות עבור הכלל ולא רק עבור טובתו האישית, וכך ניכר שהאדם אינו מתפלל בלב שלם אלא מתוך אנוכיות."
        },
        {
            "source": "Tiferet Shlomo, Torah, Vaetchanan 20",
            "relevant_sentences": "גם בעמדם בתפלה שפתותיהם נעות ולבם בל עמהם.",
            "passage": "רק השמר לך ושמור את נפשך מאד כו' ופן יסור מלבבך כל ימי חייך והודעתם לבניך ולבני בניך כו' יום אשר עמדת כו' אשר ילמדון ליראה אותי כל הימים אשר הם חיים עלהאדמה ואת בניהם ילמדון. הנה לכאורה אין קשור לפסוקים הללו. גם מה שאמר פן יסורו מלבבך והודעתם לבניך. כיון שיסורו מלבבו איך יודיעום לבניהם. ונראה לפרש בדרך צחות על אותן בני אדם שהם עסוקים בהבלי עולם ומטפשין ומסירים מעל לוח לבם מצות השי\\\"ת. גם בעמדם בתפלה שפתותיהם נעות ולבם בל עמהם. ורק את בניהם אשר יוולד להם הם מייסרין אותם ללכת אל בית הספר שלא לבטל רגע אחת רק יעסקו בתורה ותפלה. והוא אינו משים אל לבו מה שהוא ממעט בעבודתו ית\\\"ש ואיך ימלא לבבו להוכיח אחרים בשבט מוסר ובניו מומם ואינו מרגיש מומו הפוסל אותו. וזה שמרמז הכתוב השמר לך כו' ופן יסורו מלבבך. ר\\\"ל אתה בעצמך תסור מלילך בדרכי השם. והודעת' לבניך. היינו שתוכיח רק את בניך שהם ילמדו ועל עצמך לא תשגיח כלל. לא זו הדרך ישכון אור רק אשר ילמדון ליראה כו' שהם עצמם ילמדו מקודם ליראה כו' ואח\\\"כ את בניהם ילמדון:",
            "explanation": "ביאור העניין הוא שבעת אשר האדם עומד בתפילה ושפתותיו נעות, אך לבו אינו עמו, נראה הדבר כאילו הוא משקר בתפילתו, שכן פיו ולבו אינם שווים, והרי זה כעין שקר בתפילה."
        },
        {
            "source": "Tiferet Shlomo, Festivals, Shemini Atzeret 27",
            "relevant_sentences": "\"מכ\\\"ש אם ח\\\"ו האדם חוטא בברית פשיטא שאין תפלתו נשמעת ואין תורתו עולה למעלה.\"",
            "passage": "ה' עוז לעמו יתן ד' יברך את עמו בשלום. ויהיו נא אמרינו לרצון לפני אדון כל. הסמיכות של ב' הפסוקים הללו. נקדים לפרש הפסוק בתהלים. יפיפית מבני אדם הוצק חן בשפתותיך. חגור חרבך על ירך גבור הודך והדרך. עוד נקדים לפרש הפסוק. כל ארחות ד' חסד ואמת לנוצרי בריתו ועדותיו. דהנה ידוע שברית הלשון וברית המעור מכוונים זה כנגד זה כמבואר בספרים הקדושים דאם האדם איננו שומר את הדיבור אז ממילא בא לידי פגם הברית ח\\\"ו כמ\\\"ש בס' ראשית חכמה ובס' תומר דבורה על פסוק אל תתן את פיך לחטיא את בשרך. בשרך היינו הברית קודש כמ\\\"ש ועל בריתך שחתמת בבשרנו ע\\\"ש. ומכ\\\"ש אם ח\\\"ו האדם חוטא בברית פשיטא שאין תפלתו נשמעת ואין תורתו עולה למעלה. ובזה פרשתי המשנה אל תרבה שיחה עם האשה כו' מכאן אמרו המרבה שיחה כו' ובוטל מדברי תורה היינו שמבטלים דברי תורה שלו שלמד ושילמוד הכל הולך לסט\\\"א וכעין שאמרו מדאורייתא בביטול בעלמא סגי ולהוי כעפרא כו' אמרו פ\\\"ה גימט' מיל\\\"ה ובזוהר הקדוש \\\"מי \\\"יעלה \\\"לנו \\\"השמימה ר\\\"ת מילה. דהיינו אם האדם שומר את הברית אז תפלתו עולה השמימה. ובזה פרשתי והי' עקב תשמעון. עקב הוא שמירת הברית כידוע. ושמר ד' אלהיך לך את הברית לא יהי' בך עקר ועקרה ודרשו רז\\\"ל לא תהי' תפלתך עקורה היינו ע\\\"י שמירת הברית לא תהי' תפלתך עקורה ותהי' נשמעת למעלה. ובז\\\"פ נצור לשונך מרע ושפתיך מדבר מרמה. כפל הלשון לשונך ושפתיך. רמוז על שמירת הלשון וברי\\\"ק. וכ\\\"ז שהאדם אינו נשמר משמירת הברית ושמירת הפה אין המצות ומעש\\\"ט שלו הולכים למעלה רק לסט\\\"א ח\\\"ו. ולזה אמר מי האיש החפץ חיים כו' נצור לשונך מרע. ולזה אמר כל ארחות ד' חסד ואמת לנוצרי בריתו ועדותיו. דהיינו שהחסדים הולכים רק לבני ישראל שהם נוצרי בריתו ועדותיו. ונבוא לביאור הפסוקים הללו. יפיפית מבני אדם הוצק חן בשפתותיך. הנה ידוע שלא נכתב לשון חן רק לשומרי בריתו כגון אצל נח כתיב ונח מצא חן בעיני ד'. שכל דורו לא היו שומרים את הברית ונח שמר בריתו. ואצל יוסף כתיב ג\\\"כ לשון חן וימצא חן בעיניו. ויתן חנו בעיני שר בית הסוהר. וזהו חן וכבוד יתן ד' לא ימנע טוב להולכים בתמים. תמים הוא מי ששומר הברית כידוע בזוה\\\"ק. ויעקב איש תם נח צדיק תמים. ולזה יתן להם חן ולא ימנע טוב שיסוד העליון נקרא טוב כידוע. ולזה אמר הוצק חן בשפתותיך. היינו שהתפלות יתקבלו למעלה. וגם מצא חן בעיני ד' וע\\\"ז אמר מהיכן האדם זוכה לזה. חגור חרבך על ירך גבור הודך והדרך היינו שמירת היסוד כמבואר בזוהר הקדוש (פ' וארא דף כ\\\"ו). שפסוק הזה מרמז על שמירת הברית. ולזה אמר ד' עוז לעמו יתן הוא ספירת היסוד כמבואר בכוונת האר\\\"י ז\\\"ל ד' יברך את עמו בשלום. שלום הוא ג\\\"כ יסוד כמ\\\"ש במקום אחר מזה. ולזה אמר ויהיו נא אמרינו לרצון לפני אדון כל. אדון הוא ספירת המלכות כידוע כל הוא ספירת היסו\\\"ד כמבואר בכתבי האר\\\"י ז\\\"ל על ואתה מושל בכל ע\\\"ש. אדו\\\"ן כ\\\"ל הוא יחוד הוי' אדנ\\\"י וק\\\"ל. ולזה אנו אומרים בברכת המזון. במרום ילמדו עליו ועלינו זכות שתהא למשמרת שלום. היינו שמירת הברית הוא יסו\\\"ד ונמצא חן ושכל טוב וכו' שלאחר שמירת היסוד נמצא חן בעיני אלהים ואדם כמו שמצינו ביוסף הצדיק וק\\\"ל: (מכי\\\"ק)",
            "explanation": "ביאור העניין הוא שכאשר האדם חוטא בברית, תפילתו אינה נשמעת ותורתו אינה עולה למעלה, ולכן נראה כאילו הוא משקר בתפילתו, שכן פיו ולבו אינם שווים."
        },
        {
            "source": "Tiferet Shlomo, Torah, Toldot 9",
            "relevant_sentences": "אין משפטים ישירים",
            "passage": "ויתרוצצו הבנים בקרבה ותאמר אם כן למה זה אנכי כו'. ופרש\\\"י עוברת על פתחי תורה יעקב מפרכס לצאת. עוברת על פתחי ע\\\"ג עשו מפרכס לצאת. הנה בפ' זו מורה לנו התורה הקדושה דרך הישרה לעבודת הבורא ב\\\"ה שיהיה באמת ובתמים ולא יהיה דרכו דרך הפכפך וזר עד ארגיעה לשון שקר. כאשר נמצא רבים מעמי הארץ כי בשעה שעוסק בתורה ותפלה לבבו כלפיד יבער. וכאשר התעיף בו ואיננו כי אחר התפלה תיכף הולך בשרירות לבו חומד ומתאוה. וז\\\"פ הענין וירא אלהים את האור כי טוב כו' ודרשו חז\\\"ל שאיננו ראוי שישתמשו האור והחשך בערבוביא כו'. לכאורה אין להבין איך שייך לומר אור והחשך יחד בערבוביא תרתי דסתרי אהדדי. אך הרמז בזה. כי דרכי התורה ועבודה המה רומזים לאור. ותאוות העולם השפל והנבזה הם דומים לחשך. והאדם צריך לשמור מזה לבל יהי' בערבוביא פוסח על שני הסעיפים פעם הולך בדרכי התורה ופעם פונה לדרכי החשך ח\\\"ו. וכזה פרשנו בפ' צרופה אמרתך מאד ועבדך אהבה. כי זהו הצירוף והבחינה אם התו\\\"מ מביאים את האדם לידי האהבה לבל יסיר מני דרך הישרה. לכן עתה כאשר ראתה רבקה אמנו שהתרוצצו הבנים סברה כי הוא אדם אחד אשר פעם חשקו ללכת לבהמ\\\"ד ופעם חשקו ללכת לפתחי ע\\\"ג כדרך אנשי רשע כאשר יבוא בין הצדיקים יתלוה עמהם לעשות כמעשיהם. וכאשר פונה מהם ופגעו בו אנשים פוחזים וריקים הנה הוא כאחד מהם. לכן ותלך לדרוש את ה' מה יהיה בסופו. כי לא זה הדרך ישכון אור רק כיתד שלא תמוט. לזה כתיב ויאמר ה' לה שני גוים בבטנך. כי באמת הם שנים יעקב ועשו זה פונה לרשעו ותאוותו הרעה. וזה פונה לתומו וצדקתו לעד עומדת בל ימוט לנצח. ובזה יש לרמז מ\\\"ש להלן ויהי אך יצוא יצא יעקב מאת פני יצחק אביו והנה עשו אחיו בא מצידו. לרמז על הנ\\\"ל ויהי לשון צער כאשר נמצא איש הפכפך במעשיו אשר בשעת עשיית המצוה הוא בבחי' יעקב. וכאשר יצא מאת פני יצחק אביו בגמר תפלתו ועבודתו והנה חוזר לסורו נהפך לאיש אחר והנה עשו אחיו בא מצידו. מצידו. כי הסט\\\"א גובר עליו בתאוות עוה\\\"ז. אך צריך האדם להיות חזק ואמיץ כיתד שלא תמוט להשגיח על כל דרכיו בתם וביושר:",
            "explanation": "ביאור העניין הוא שבשעת התפילה והעיסוק בתורה, האדם עשוי להיראות כצדיק ולבבו בוער כלפיד, אך לאחר התפילה אם הוא הולך בשרירות לבו וחומד ומתאווה, הרי זה כאילו פיו ולבו אינם שווים ונראה כשקרן בתפילתו, כי דרכי התורה הם אור ותאוות העולם הם חושך, ואין ראוי שיהיו בערבוביא."
        },
        {
            "source": "Tiferet Shlomo, Festivals, Shaar Tefillah 6",
            "relevant_sentences": "אין משפטים ישירים",
            "passage": "(תהילים ס״ה:ב׳-ג׳) לך דומי' תהלה ולך ישולם נדר שומע תפלה עדיך וכו'. דברי עוונות גברו מני פשעינו אתה תכפרם וכו'. הסמיכות של הפסוק ולך ישולם נדר לפסוק שלאחריו שומע תפלה כו'. דהנה איש מישראל הרוצה להתפלל נזכר מיד עוונותיו העצומים. ובפרט שמורא עלה על ראשו שלא מיבעיא שתפלתו אינה נכנסת לפני הבורא ב\\\"ה אך גם אדרבא נותן כח בעבודתו ותורתו לסט\\\"א ח\\\"ו כמבואר בספרים הקדושים [ועי\\\"ז יש יניקה להחיצונים מהקדושה] מכח התורה ומצות ח\\\"ו. ולזה היתה כוונת דוד המלך ע\\\"ה (תהילים כ״ז:ח׳) לך אמר לבי בקשו פני את פניך ד' אבקש. (ולזה התפלל אל תסתר פניך ממני) היינו שהאדם נופל בדעתו במורשי לבבו ונפשו חשקה להתפלל. והיינו את פניך ד' אבקש. ולזה התפלל אל תסתר פניך ממני וכו' ונחני באורח מישור. היינו שהתפלות ילכו למעלה בדרך הישר. ולזה אמר אל תתנני בנפש צרי. היינו שהתפלות לא יכנסו ח\\\"ו בנפש הסט\\\"א. אך התיקון לאיש הישראלי שרוצה להתפלל לקבל עליו מכאן ולהבא לעבוד את ד' בכל לבו ולשוב על עוונותיו והימים הראשונים יפלו. והנה אצל הקב\\\"ה המחשבה כמעשה שהקב\\\"ה יודע מחשבות בנ\\\"א שאדם הזה יעשה תשובה נכונה. ולזה אף שלא עשה עדיין תשובה אצל הקב\\\"ה הוא כמעשה. דאצל בני אדם אם אחד חייב ממון לחבירו ואינו רוצה לפרוע לו זמן זמנים ואח\\\"כ נתחרט והוא רוצה לפרוע לו אזי אינו מאמין לו מחמת שכפר לו זמן זמנים עד שיפרע לו אזי הוא מתפייס עמו אבל אצל הקב\\\"ה מיד כשאדם מדבר לפני הש\\\"י ב\\\"ה שבדעתו לשוב בתשובה הקב\\\"ה יודע שיעשה תשובה ומיד מוחל לו וכמו שמצינו בדניאל שמיד שקבל עליו להתענות מיד אמר הקב\\\"ה שנענה כמבואר בש\\\"ס תענית דף ח' ע\\\"ב. וזה דנדר הוא הרי עלי נדר ולזה אמר לך דומי' דהיינו מהראוי שלא יתפלל כלל מחמת הטעמים הנ\\\"ל שאדרבא נותן כח התפלה להחיצונים ח\\\"ו. ולזה אמר ולך דווקא להקב\\\"ה שהוא יודע מה שיהי' בסוף ישולם נדר שהנדר הוא כמו ששלם כבר הנדר. שאצל הקב\\\"ה העבר וההוה והעתיד הוא הכל אחד כמו שאיתא בספרים ולזה אני מקבל עלי שלא אחטא עוד ומקבל עליו לעשות תשובה. ולזה אמר מיד אח\\\"כ שומע תפלה עדיך כל בשר יבואו היינו שמיד שקבל עליו לעשות תשובה מיד הולכים התפלות להקב\\\"ה. דברי עוונות גברו מני פשעינו אתה תכפרם וכו'. ובזה י\\\"ל כוונת הכתוב (בתהילים ל״ב:ה׳) חטאתי אודיעך ועוני לא כסיתי אמרתי אודה עלי פשעי לד' ואתה נשאת עון חטאתי סלה. על זאת יתפלל כל חסיד עליך. דבל\\\"ז אי אפשר להתפלל דסביביו נשערה מאד והיו יראים החסידים להתפלל מחמת יראה הנ\\\"ל. ולזה אמר אודה עלי פשעי היינו שמתוודה ומקבל עליו שלא יחטא עוד עי\\\"ז יתפלל כל חסיד. רק לשטף מים רבים אליו לא יגיעו. הכוונה לסט\\\"א כמ\\\"ש מים רבים לא יוכלו לכבות את האהבה כמ\\\"ש חכז\\\"ל על העובדי כוכבים ומזלות. אליו לא יגיעו. היינו שהתפלות אינם נכנסים ח\\\"ו לסט\\\"א רק לשמים ונעשים עטרה להבורא ב\\\"ה וק\\\"ל: (מכי\\\"ק)",
            "explanation": "ביאור העניין הוא שבשעת התפילה, כאשר האדם נזכר בעוונותיו וחושש שתפילתו תיתן כוח לסטרא אחרא, נראה כאילו הוא משקר בתפילתו, אך באמת אם יקבל עליו לשוב בתשובה, הקב\"ה יודע מחשבותיו ומקבל תפילתו כאילו כבר שב בתשובה."
        },
        {
            "source": "Tiferet Shlomo, Festivals, Shabbat 16",
            "relevant_sentences": "\"אוא\\\"כ נראה ח\\\"ו כמשקר בתפלה.\"",
            "passage": "ממקומך מלכנו תופיע ותמלוך עלינו כי מחכי' אנחנו לך. יש להבין וכי כל ישראל כולם כאחד הם מחכים ומצפים על כבוד הש\\\"י בלי שום כוונה אחרת. וא\\\"כ נראה ח\\\"ו כמשקר בתפלה. אך הפי' הוא כי ע\\\"ז הענין בעצמו אנו מבקשים מאת הש\\\"י ב\\\"ה שיתן בלבבנו שכל ותשוקה הזה ע\\\"י האור שיופיע עלינו אור העליון מלמעלה בקבלת מלכותו ואז עי\\\"כ נהי' מחכים אנחנו לך באמת בכל לבבנו כדי שתתגדל ותתקדש בתוך ירושלי' במהרה. כי עתה בעונותינו הרבים הנה אם אמנם בכל אחד ואחד מבנ\\\"י יש בו ניצוץ קדוש ועליון מנשמתו העליונה וחלק האלקי המצפה להדבק בשרשו בכ\\\"ז הנה הוא מכוסה וטמיר בקרב האדם מחמת סיבות גשמיות עולם הזה. אבל כאשר ממקומך תופיע מלכנו אור העליון יותר אז תאיר אור בנפשנו ויתגלה כי באמת מחכים אנחנו לך וכו'. וכ\\\"נ ממקומו הוא יפן ברחמים ויחון עם המיחדים שמו. פי' ג\\\"כ כנ\\\"ל שהש\\\"י יפן ברחמיו לעמו לתת בלבבם שלימות מכח העליון להיותם מיחדים שמו באהבה לפעול היחוד למעלה כי אם אין מתעורר אור העליון אין כח שלמטה עולה בשלימות כנ\\\"ל: (מכי\\\"ק)",
            "explanation": "ביאור העניין הוא שבשעת התפילה, כאשר האדם מתפלל ומבקש מהקב\"ה להופיע ולהמליך עלינו, עלול להיראות כאילו הוא משקר בתפילתו אם אין בלבו כוונה אמיתית לחכות ולצפות לכבוד השם יתברך, אך באמת התפילה היא בקשה שהקב\"ה ייתן בלבנו את השכל והתשוקה האמיתית לחכות לו, וכך תתגלה הכוונה האמיתית שבקרבנו."
        },
        {
            "source": "Tiferet Shlomo, Torah, Vayishlach 9",
            "relevant_sentences": "\"ובפרט האריז\\\"ל שכל המצות ותפלות ותורה ומעש\\\"ט שהאדם עושה אם חטא מקודם ולא עשה תשובה כל התפלות והמצות נוטלים הסט\\\"א וחיילותיו ואדרבא מוסיף כח לקליפה בתורה ומצות.\"",
            "passage": "ויאמר יעקב אל ביתו ואל כל אשר עמו הסירו את אלהי הנכר אשר בתוככם והטהרו ונקומה ונעלה בית אל. ואעשה שם מזבח וכו'. פירש\\\"י והטהרו מעבודת גלולים עכ\\\"ל. התורה מלמדת אותנו דרך לעבודת הבורא ב\\\"ה מדברי יעקב אבינו ע\\\"ה ונקדים דברי הש\\\"ס בקדושין כל שאינו יודע בטיב גיטין וקדושין לא יהי' לו עסק עמהם והרגישו המפורשים למה הקדימה גיטין לקדושין הלא בכ\\\"מ קדושין קודמין לגיטין דבתחלה האדם מקדש ואח\\\"כ אם מצא בה וכו' הוא מגרשה. אך נקדים דברי הש\\\"ס על פסוק מה ה' דורש ממך כי אם הצנע לכת עם ה' אלקיך. ודרשו חכז\\\"ל זה הוצאת המת והכנסת כלה. ונדחק רש\\\"י בפי' הש\\\"ס הזה. ועוד מה הוא הענין שדרשו דוקא הפי' הצנע לכת לשני דברים הללו דלמא הפי' הצנע לכת ליתן צדקה בסתר כמ\\\"ש מתן בסתר וכו' או להתפלל בהצנע כיון שכל הדברים טוב בהם הצניעות. ועוד מאי כי אם הצנע לכת וכי אם יקיים אדם הני תרי דברים הוצאות המת והכנסת כלה יותר אין הקב\\\"ה חפץ מן האדם. ולמה תרי\\\"ג מצות. אך נקדים לזה דברי הספרים הקדושים ובפרט האריז\\\"ל שכל המצות ותפלות ותורה ומעש\\\"ט שהאדם עושה אם חטא מקודם ולא עשה תשובה כל התפלות והמצות נוטלים הסט\\\"א וחיילותיו ואדרבא מוסיף כח לקליפה בתורה ומצות. ובזה פרשו הפסוק ולרשע אמר אלקים מה לך לספר חוקי וכו'. ובזה פרשו הפסוק סור מרע ועשה טוב היינו קודם עשיית הטוב מקודם צריך להיות סור מרע דהיינו לעשות תשובה. ובזה פרשו תשובה ומעשים טובים בעוה\\\"ז שלכל מעשים טובים שאנו עושים בעוה\\\"ז צריך תשובה מקודם ואח\\\"כ מעשים טובים. ובזה פרשנו ואמרנו שהדברים האלו מפורשים בתורה בפ' התשוב' בפ' וילך ושבת עד ה' אלקיך וכו' ושמעת בקולו ככל אשר אנכי מצוך וכו'. עוד שם פסוק אחר ואתה תשוב ושמעת בקול ה' כו' לשמור מצותיו וחוקותיו הכתובה בספר הזה כי תשוב אל ה' אלקיך כו' מבוארים הדברים שהתורה אומרת שהתשובה קודמת לכל המצות ומבלעדה לא ירים איש את ידו לעשות שום מצוה שהרי אמר הכתוב לשמור מצותיו וכו' כי תשוב וכו' שכל זמן שלא עשה תשובה הכל הולך לסט\\\"א. ובזה נחזור לש\\\"ס הנ\\\"ל הצנע לכת עם ה' אלהיך ע\\\"ד שאיתא בזוהר על פסוק הנסתרות לה' אלהינו שהיא יראה ואהבה שהם דברים שבלב. וזהו הצנע לכת עם ה' אלקיך שיראה ואהבה הם בהצנע לכת כי היא בתוך בנ\\\"א דהיינו השם י\\\"ה שהוא יראה ואהבה כמבואר בזוהר ותלך עם ה' אלקיך שהשם הוי' יהי' שורה עמך בכל דרכיך. וזהו הוצאות המת והכנסת כלה. וגם מבואר שס\\\"מ וסט\\\"א נקראים מתים. וזהו אמרו כאלו אכלו מזבחי מתים. וגם אמרו בש\\\"ס רשעים בחייהם קרוים מתים משום שהס\\\"ם וסט\\\"א שולטין על האדם הרשע כמאמר חכז\\\"ל רשעים יצה\\\"ר שופטן והן נקראים מתים לכן הרשעים שהם תחתיהן נקראים ג\\\"כ מתים כמוהם. וזה כוונת הש\\\"ס מעבירין את המת מלפני הכלה אם אדם רוצה להכניס הקדושה היינו השכינה הנקראת כלה לתוכו יצטרך מקודם לפנות המת ולהעבירו מלפני הכלה שאין אדם דר עם נחש וכו' ומכ\\\"ש הקב\\\"ה. וזה רמז הכתוב בפ' חיי שרה בדברי לבן ויאמר בא ברוך ה' למה תעמוד בחוץ ואנכי פניתי הבית ופרש\\\"י פניתי הבית מע\\\"ג רמז לנו הכתוב שקודם פניות הבית מע\\\"ג היינו פנימיות ועקמימות שבלב ע\\\"ד לא יהי' בך אל זר היינו היצה\\\"ר שבלבבו של אדם שאי אפשר לבוא בתוכו ברוך ה' ומכש\\\"כ השכינה וכמבואר בזוהר שצריך כל אדם להעביר הסט\\\"א מכל אבר ואבר אז שורה השכינה עליו. וזה רמזו רז\\\"ל זהו הוצאות המת והכנסת כלה היינו השכינה הנקראת כלה וזהו כל שאינו יודע בטיב גיטין וקדושין קודם כל מצוה. שידוע עיקר כוונת כל מצוה היתה להתקדש אותנו בהם כמ\\\"ש אומרים אשר קדשנו במצותיו שבכל מצוה ומצוה אנו מוסיפין עלינו קדושה ואם האדם נתעב בחטאיו ועוונו אין הקדושה יכולה לשרות על האדם כי אין אדם דר עם נחש וכו'. וזה נקרא גיטין היינו גרושין. וזה כל שאינו יודע בטוב גיטין וקדושין היינו מקודם גיטין ואח\\\"כ קדושין. ומזה פרשתי הכתוב משכו וקחו לכם צאן ופרשו רז\\\"ל משכו ידיכם מע\\\"ג שזה היתה מצוה ראשונה כמאמר חכז\\\"ל לא הי' צריך התורה להתחיל אלא מהחודש הזה לכם למדה התורה אותנו שקודם עשיית הקרבן שהיא מצות קרבן פסח למשוך ידיהם מע\\\"ג. ולזה היתה הרמזים וכוונת התורה במצוה הראשונה בפסח שיצאו מתתת הסט\\\"א היינו מיד מצרים דכל זמן שהיו תחת יד מצרים היו תחת יד הסט\\\"א כמבואר בספרים. אך אחר שיצאו ממצרים מתחת שיעבודם הי' כוונת הקב\\\"ה שיצאו מתחת יד שיעבוד היצה\\\"ר. ולזה מצוה ראשונה הוא פסח ואכילת מצה היינו להתקדש גופו של בנ\\\"י בהשראת הקדושה צוה הש\\\"י לגרש הסט\\\"א והיצה\\\"ר דהיינו ביעור חמץ הוא היצה\\\"ר כמבואר בזוה\\\"ק ובספרים. ולזה אמה\\\"כ אחר מצות קרבן פסח ואמר עוד ז' ימים מצות תאכלו אך ביום הראשון תשביתו שאור מבתיכם היינו מערב יו\\\"ט ולא ביו\\\"ט עצמו ע\\\"ד שאמרו מעבירין את המת מלפני הכלה. וזה כוונת רבא בש\\\"ס בפסחים דף ה' אך ביום הראשון הוא מעיו\\\"ט ולא ביו\\\"ט עצמו הרי נאמר לא תשחט על חמץ דם זבחי א\\\"כ ראינו שכוונת הכתוב שקודם עשיית המצוה יהי' ביעור חמץ. ולזה אמר אח\\\"כ ושמרתם את המצות ודדשו חכז\\\"ל אל תיקרי מצות אלא מצוות הרמז שבכל המצות צריך מקודם ביעור חמץ. ולזה יש לומר מה שמקשים שבדברי משה לא נזכר רק עשיית הפסח ולא נזכר כלל ביעור חמץ. אך במה שאמר משכו ידיכם מע\\\"ג כדרשת חכז\\\"ל ממילא מרמז בזה מצות ביעור חמץ כנ\\\"ל. ולזה בא הרמז בסמיכות בפ' כי תשא אלהי מסכה לא תעשו לכם את חג המצות תשמור. עוד רמז בכ' ובא השמש וטהר ואחר יאכל מן הקדשים. וזה ג\\\"כ בפ' משפטים לא תשתחוה לאלהיהם ולא תעבדם וכו' ושבר תשבר מצבותיהם ועבדתם את ה' אלהיכם כו'. וזה ג\\\"כ הרמז בפ' אדם כי יקריב מכם קרבן לה' מן הבהמה כו' תקריבו את קרבנכם. היינו מקודם צריך להקריב הבהמיות שבאדם לעשות לה' בכל דרכיך דעהו ואח\\\"כ אדם כי יקריב מכם כו' יכול האדם להתקרב להקב\\\"ה. וכן נאמר בפ' קדושים לרצונכם תזבחוהו היינו הרצון הרע שבכם תזבחוהו קודם עשיית הקרבן. וזה היתה כוונת יעקב אבינו ע\\\"ה בפסוק הזה הסירו את אלהי הנכר אשר בקרבכם ע\\\"ד שאמרו חכז\\\"ל לא יהי' בך אל זר זה היצה\\\"ר שהוא בתוך לבו של אדם והטהרו מע\\\"ג כפרש\\\"י ונקומה ונעלה בית אל ונעשה שם מזבח כו' היינו כנ\\\"ל שקודם עשיית המצוה ובפרט הקרבנות. הסירו את אלהי הנכר כו'. כן יהי רצון בכל מעשינו אמן:",
            "explanation": "ביאור העניין הוא שכאשר האדם חוטא ולא שב בתשובה, כל תפילותיו ומצוותיו נלקחות על ידי כוחות הטומאה, ונראה כאילו הוא משקר בתפילתו, שכן כוונתו אינה טהורה והקדושה אינה שורה עליו."
        },
        {
            "source": "Tiferet Shlomo, Torah, Pinchas 15",
            "relevant_sentences": "אין משפטים ישירים",
            "passage": "ויקרב משה את משפטן לפני ה'. ויאמר ה' אל משה כן בנות צלפחד דוברות. יל\\\"ד מהו לשון כן הול\\\"ל אמת בנות צלפחד דוברות. אכן הנה כבר ידוע כי כל שאלת האדם בצרכיו מאת השי\\\"ת ותפלותיו הרבים לא נכון להם להתפלל עלצרכי עצמו בעניני עוה\\\"ז רק לכוון בהם להיות בזה כבוד שמים בכל דרכיך דעהו שיהיו כל עניני האדם רק לכבוד הש\\\"י ב\\\"ה על אחת כמה וכמה בשעת התפלה צריך לכוון לבו רק לשמים וממנו בא הישועה גם לעוה\\\"ז כמ\\\"ש ויזעקו אל ה' בצר להם וממצוקותיה' יושיעם. פי' שיהי' כל כוונתם אל ה' שהוא כביכול בצר להם עמהם ממילא ממצוקותיהם יושיעם. והנה עד\\\"ז הוא פי' כל הברכות שבש\\\"ע אע\\\"פ שהם שאלת צרכיו רפואה וברכת השנים הכל הוא למעלה כיל\\\"ח וצריך לכוון להש\\\"י כשמתפלל בהם ליחוד שלמעלה וע\\\"י כן שלום על ישראל. והנה לפעמים מי שאין בו דעת לכל אלה להתפלל על ה' כנ\\\"ל. הנה זהו העצה נכונה כשבא אל הצדיק הדור הנה הוא מליץ טוב בעדו כי גם הוא כוונתו רק לשמים ומקרב את עניניו וצרכיו שהוא ג\\\"כ לצורך גבוה ית\\\"ש. וז\\\"ש בגמרא מי שיש לו חולה בתוך ביתו ילך אצל חכם ויבקש עליו רחמים כי הצדיק הוא היודע להמליץ עליו רחמים בתפלתו וע\\\"ז הבטיח הש\\\"י למשרע\\\"ה וחנותי את אשר אחון ואמרו חכז\\\"ל אעפ\\\"י שאינו הגון ואינו כדאי הפי' שאין כוונתו רצויה להתקבל למעלה אני אעביר כל טובי על פניך שיהיה בך כח כזה להטיב לברואיו להמליץ טוב בעדם וללמד זכות עליהם עי\\\"כ וחנותי את אשר אחון. וז\\\"פ הנה אנכי בא אליך בעב הענן בעבור ישמעו העם בדברי עמך כו' וישב משה את דברי העם אל ה'. ר\\\"ל גם דברי פשוטי העם שאינם יודעים להתפלל באמת ברצוןובכוונה למעלה עכ\\\"ז יעלו לרצון על ידי הצדיק. וזה הענין כשבאו בנות צלפחד לתבוע נחלה בא\\\"י תחלה הנה יש לפרש בזה כוונה פשטיות שרצו בתחלה כדרך הארץ. ויש לפרש בהם עוד שהיה כוונתם על קדושת הארץ שהיו מחבבות הארץ ולכן כשבאו לפני משה ויקרב את משפטן לפני ה'. שהי' מקרב וממתיק אותם שתביעתן הוא ג\\\"כ למקום ב\\\"ה כדרך הנכון להצדיק לקרב את בנ\\\"י לפני הש\\\"י ולזה השיב לו הקב\\\"ה כן בנות צלפחד דוברות אינך צריך עוד להמתיק ולתקן דבריהם בכוונתם. כן בנות צלפחד דוברות מתחלה רק לרצון הש\\\"י:",
            "explanation": "ביאור העניין הוא שבשעת התפילה, כאשר האדם אינו מכוון את כוונתו לשמים אלא לצרכיו האישיים בלבד, נראה כאילו הוא משקר בתפילתו, אך כאשר הצדיק מקרב את תפילתו וממתיק אותה, היא מתקבלת לרצון השם יתברך."
        },
        {
            "source": "Tiferet Shlomo, Torah, Toldot 24",
            "relevant_sentences": "\"לבו יודע מרת נפשו כי המרה את רוחו והלך בדרכי תעתועים בתאוות רעות וירא לנפשו לפתוח פיו. כמ\\\"ש אולי ימושני אבי והייתי בעיניו כמתעתע וכו'\"",
            "passage": "ותקח רבקה את בגדי עשו בנה הגדול החמודות כו' ותלבש את יעקב בנה הקטן. הנה בזה מורה לנו הכתוב דרך העבודה להש\\\"י כאשר הקדמנו לעיל בעניני התפלה בגשתו אל הרנה ואל התפלה ולבו יודע מרת נפשו כי המרה את רוחו והלך בדרכי תעתועים בתאוות רעות וירא לנפשו לפתוח פיו. כמ\\\"ש אולי ימושני אבי והייתי בעיניו כמתעתע וכו' אולם העצה הנכונה לזה עפ\\\"י מ\\\"ש בשם הבעש\\\"ט ע\\\"פ מאת כל איש אשר ידבנו לבו תקחו את תרומתי. היינו שכל אדם צריך לשית עצות בנפשו להפוך לעשות מדות טובות מכל אשר ידבנו לבו מהתאוות החיצוניו' ומדות הרעות אשר הרגיל בהם מהם יקח דרך לעבודת הבורא ב\\\"ה באותו חשק ובאותה התאווה ביתר שאת. ובזה פרשתי בפ' ציצית ולא תתורו אחרי לבבכם וכו' אשר אתם זונים אחריהם למען תזכרו ועשיתם כו'. פי' שלא יפול לב האדם בראותו הסתת היצר ח\\\"ו לתאוות רעות ולא יקשה בעיניו למה עשה כן הבורא ב\\\"ה להכניס האדם בעוה\\\"ז בעבודה קשה כזה. כי. באמת הוא לטובת האדם כי ממנו נקח לעבוד הבורא ב\\\"ה באותו חשק ובאותו תאווה. וזה ולא תתורו כו' אשר אתם זונים אחריהם. כי למען תזכרו ועשיתם את כל מצותי. כי ממנו נלמוד לעשות המצות בחשק נמרץ כנ\\\"ל. וזה ג\\\"כ הרמוז כאן ותקח רבקה את בגדי עשו כו' החמודות.הם התאוות והחמדות רעות של עשו כנ\\\"ל. ותלבש את יעקב בנה הקטן. הם הצדיקים שהם קטנים בעיניהם ומורא על ראשם לגשת אל הקודש. והם מלבישים אותו החשק והרצון של תאוות עוה\\\"ז לקחת אותו חשק לעבודת הבורא ב\\\"ה. וז\\\"פ ג\\\"כ ויגנוב יעקב את לב לבן הארמי. כי לבן הי' סבור שיעקב ילמוד ממנו דרכו ומדותיו. אך הוא הי' מהפך אותם לטובה. כנ\\\"ל:",
            "explanation": "ביאור העניין הוא שבשעת התפילה, כאשר האדם חש כי חטא והלך בדרכי תעתועים, ירא הוא לפתוח פיו בתפילה פן יראה בעיני עצמו כמתעתע, אך העצה היא להפוך את התאוות הרעות לחשק לעבודת הבורא, ובכך להימנע מהתחושה שהוא משקר בתפילתו."
        },
        {
            "source": "Tiferet Shlomo, Festivals, Sukkot 51",
            "relevant_sentences": "\"אין משפטים ישירים\"",
            "passage": "יהי לבי תמים בחוקיך למען לא אבוש. ובמד\\\"ר שבקש דוד המלך ע\\\"ה אף בשעת עשיית המצוות יהי' לבי תמים כי אע\\\"פ שלכך נברא היצה\\\"ר לבעבור תהי' הבחירה ביד האדם בכל זה צריך להתפלל שיעשה המצות בתמימות בלי שום פני' חיצונית למען לא אבוש כי באמת אם האדם עושה המצוה לשום כוונה חיצונית חלילה אז אח\\\"כ בעולם העליון הוא מתבייש מאד על סכלותו אשר לא טוב עשה וכמעשה המובא בס' ר' ייבא באחד שהגיד לחבירו בחלום איך שהוא מתבייש וחרפה תכסה פניו בהכריז עליו המלאך כוונת המצות אשר עשה בעולם הזה וכל הצדיקים ינוסו לקולם מג\\\"ע בשמעם אוולתו ופגמו ולכך צריך האדם להתפלל שלא יבוש בעה\\\"ב וזהו אחת שאלתי מאת ד' אותה אבקש שבתי בבית ד' כל ימי חיי פי' כל ימי חיי יעלו לפני ד'. לחזות בנועם ד'. פי' שאוכל לחזות ולהתראות לפני ד' ולא אבוש:",
            "explanation": "ביאור העניין הוא שבשעת עשיית המצוות, אם האדם עושה המצוה לשום כוונה חיצונית חלילה, אזי בעולם העליון הוא מתבייש מאד על סכלותו, וכך נראה כאילו פיו ולבו אינם שווים, ולכן יש להתפלל שיעשה המצות בתמימות למען לא יבוש."
        },
        {
            "source": "Tiferet Shlomo, Torah, Vaera 1",
            "relevant_sentences": "אין משפטים ישירים",
            "passage": "וידבר אלהים אל משה ויאמר אליו אני ה' . להבין ענין האמירה הזאת שאמר אליו אני ה' מה אמר לו. אך הנה באה ללמד לאדם דעת להבין בעצמו כי בכ\\\"ע עמדו לפני ה' בתורה ותפלה כי הוא איננו כדאי וראוי לזכות ולעמוד לפתוח פיו לפני הש\\\"י ממה\\\"מ הקב\\\"ה ואינו בכחו לדבר מאומה זולת מחסד הבורא עליו אשר ישים דבר בפיו לאמר כה תדבר כמש\\\"א דוד המלך ע\\\"ה כי אין מלה בלשוני הן ה' ידעת כלה. לכן צריך האדם להכנע ולשבר לבבו קודם הלימוד והתפלה להתפלל לה' ולשאול ממנו מענה לשון כמ\\\"ש בברכת התורה אשר קדשנו במצותיו וצונו לעסוק בדברי תורה. ואעפ\\\"כ מתפללים והערב נא כו' את דברי תורתך בפינו שיהיה בו עריבות ומתיקות לפניך להיות נחת רוח לפני כסא כבודך אע\\\"פ שהאדם מחויב ללמוד במצות הבורא בחיוב דאורייתא מ\\\"מ אינו כשאר מלאכות שמחויב לראות להשלים פעולתו אשר נשלח אליה כי אורייתא צריך הקדמת דחילו ורחימו וכן בתפלה ושאר כל המצות כי הוא רק חסד עליון אשר יזכה האדם השפל לעמוד לפניו ולהתפלל כמ\\\"ש הללו את ה' מן השמים. ר\\\"ל להודות ולהלל לפניו ית\\\"ש הוא ג\\\"כ סיוע מן השמים טוב ה' לכל ורחמיו על כל מעשיו יודוך ה' כו' כל זה מצד הרחמנות אשר יודוך כל מעשיך. לכן אל יפול לב האדם עליו בראותו כי הקדים ליגע קודם התפלה הרבה בלימוד שיעורין כסדרן ואעפ\\\"כ מתהפך הוא בתחבולותיו בשעת התפלה ואיננה שגורה בפיו ואיננו יכול להתפלל כי הכל הוא מן השמים והוא יעשה את שלו. ועל כזה רמזו רז\\\"ל אל תעש תפלתך קבע. ענין הקביעות הוא הבא בכל עת בטבע. כן אל תעש תפלתך מצד שלמדת הרבה קודם התפלה בקביעות ועי\\\"כ נכון לך להתפלל. לא כן אלא רחמים ותחנונים לפני המקום מצד הרחמנות תבא לפני המקום. וכן נאמר ואתחנן כו' פרש\\\"י מתנת חנם אע\\\"פ שיש להם לצדיקים לתלות במעשיהם הטובים אעפ\\\"כ אינם מבקשים רק מתנת חנם. ר\\\"ל שיש להם לתלות שיהיה תפלתם נכונה ע\\\"י מעשיהם הטובים שלמדו הרבה ועשו מעש\\\"ט קודם התפלה אעפ\\\"כ אינם מבקשים ר\\\"ל הבקש' שלהם אינה רק מתנת חנם כנ\\\"ל. וז\\\"ש שצריך לומר קודם שמ\\\"ע אדני שפתי תפתח כי לולא זאת איך יכול לעמוד בתפל' כי איך יזכה ילוד אשה לעמוד לפני הקב\\\"ה. הנה כזה היה הענין אצל משרע\\\"ה ציר נאמן כי שלחו ה' לפדו' את בנ\\\"י ולהוציאם ממצרים ומשרע\\\"ה באהבתו לישראל הלך בהתלהבות לקיים דבר השליחות וכאשר ראה כי לא שמעו לו הרע בעיניו והתחיל לזעוק למה הרעות. אמר לו הקב\\\"ה דע לפני מי אתה עומד כי אני ה' כמו שמבואר בזוה\\\"ק מקמאי מלילת מילין אילין. ודו\\\"ק:",
            "explanation": "ביאור העניין הוא שבשעת התפילה, כאשר האדם מתאמץ בלימוד ובמעשים טובים קודם התפילה, עלול להיראות כאילו תפילתו אינה שגורה בפיו ואינו יכול להתפלל, אך באמת זוהי תזכורת שהכל הוא מן השמים ויש לפנות בתפילה ברחמים ותחנונים ולא מתוך תחושת קביעות או זכות עצמית."
        },
        {
            "source": "Tiferet Shlomo, Festivals, Shaar Tefillah 12",
            "relevant_sentences": "לכן הי' נותן לו בבקר מיד כדי שהעני יהי' יכול להתפלל ולהודות להקב\\\"ה שהזמין לו פרנסתו דאל\\\"כ בשעת התפלה הי' יכול העני ח\\\"ו להיות קורא תגר על הקב\\\"ה.",
            "passage": "ר' אלעזר יהיב פרוטה לעני והדר מצלי. היינו לעורר רחמים בעולם עוד י\\\"ל עפ\\\"י דברי רז\\\"ל מרבה צדקה מרבה שלום. שלום יעשה לי שהנותן צדקה עושה שלום בין הקב\\\"ה להעני. שהעני הולך ומהרהר ח\\\"ו בלבו על הקב\\\"ה לכל הוא נותן פרנסה כו'. ור\\\"א הי' נותן על הכוונה זו. לכן הי' נותן לו בבקר מיד כדי שהעני יהי' יכול להתפלל ולהודות להקב\\\"ה שהזמין לו פרנסתו דאל\\\"כ בשעת התפלה הי' יכול העני ח\\\"ו להיות קורא תגר על הקב\\\"ה. וז\\\"פ ר\\\"א יהיב פרוטה לעני והדר מצלי. היינו העני הי' מתפלל אח\\\"כ: (מכי\\\"ק)",
            "explanation": "ביאור העניין הוא שבשעת התפילה, אם העני לא קיבל פרנסתו, עלול הוא להרהר בלבו ולקרוא תגר על הקב\"ה, ונראה כאילו פיו ולבו אינם שווים, ולכן ר' אלעזר היה נותן צדקה לעני קודם תפילתו כדי שיוכל להתפלל בלב שלם ולהודות להקב\"ה."
        },
        {
            "source": "Tiferet Shlomo, Festivals, Sukkot 47",
            "relevant_sentences": "אין משפטים ישירים",
            "passage": "(בחי' יעקב) אשרי איש ירא את ד' במצותיו חפץ מאד. להבין כוונת הכתוב כי לכאורה הוא ב' ענינים כי מי שהוא ירא מאד הנה יירא ויבוש מלעשות מצותיו כי אומר מה אני ומה חיי ומי אנכי כי אזכה להתקרב אל ד' לעשות מצותיו. אולם הנה זה מלמדנו הכתוב שיהי' כל מעשי האדם בהשכל וחכמה ובזמנים חלוקים לא להשתמש בשניהם כאחד אם אמנם כי צריך האדם להתגבר על עצמו ביראת ד' ולהתוודות על פשעיו ולבכות במר נפשו. אך זה לא בכל עת ולא זו העת בשעת תורה ותפלה כי בשעת תורה ותפלה צריך להיות בשמחה ואהבה. וע\\\"ז נאמר סור מרע ועשה טוב בשעת עשיית המצוה אין לזכור העבירה. עשה דוחה ל\\\"ת. פי' המצוה דוחה העבירה. כי אם בשעת המצוה יזכור חטאיו אז יתרשל ויבוש מעשות את המצוה וזהו מעשה היצר לבלבל את האדם בעת התפלה בעצבות עוונותיו אך לזה לפקוד ולשוב על עוונותיו צריך זמן בפ\\\"ע בקומו בחצות לילה או קודם אור הבקר אך אז ישוב אל לבבו כל הימים אשר עברו בהשער בנפשו גודל פחדו והדר גאונו ואז יתוודה במר נפשו מקירות לבו. ואח\\\"כ יתעורר מעפרו ויקום אל התורה והתפלה להתעודד בשמחה וקול זמרה וע\\\"ז נאמר עבדו את ד' בשמחה. וכזה הי' ענין יעקב אבינו ע\\\"ה כאשר צותה עליו רבקה ואעשה אותם מטעמים לאביך כאשר אהב. רבקה רומז לשכינה הקדושה כמבואר בזוה\\\"ק. והשכינה צוותה לעשות מצות ומעש\\\"ט הם המטעמים ויעקב הוא רמז לכנ\\\"י והי' ירא אולי ימשני אבי במעשי הרעים פן אהי' כמתעתע והבאתי עלי קללה. אך השכינה צוותה עליו לך ועשה ואל תירא כי עתה אין הזמן לפשפש במעשים בעת עשיית המצוה ועלי קללתך בני. אך עשה מטעמים לאביך. נחת רוח לפני ד' באהבה וזה כאשר אהב. וז\\\"ש הכתוב אשרי האיש ירא את ד' ביראה ואעפ\\\"כ במצותיו חפץ מאד בשעת עשיית המצות חפץ מאד לעשותם באהבה עזה:",
            "explanation": "ביאור העניין הוא שבשעת התפילה, אם האדם יזכור את חטאיו ויתמלא בעצבות, ייראה כאילו פיו ולבו אינם שווים, כי אז ייראה כמתעתע בעבודתו, ולכן עליו להתמקד בשמחה ואהבה בעת עשיית המצוות."
        },
        {
            "source": "Tiferet Shlomo, Festivals, Shavuot 14",
            "relevant_sentences": "\"אבל בתחלה אתם לא תכוונו על כך בעבור טובתכם\"",
            "passage": "וירא אלהים את האור כי טוב ויבדל אלהים בין האור ובין החשך כו'. ואמרו חכז\\\"ל שבקשו האור והחשך להשתמש בערבוביא. אך וירא אלהים את האור כי טוב לכן ויבדל אלהים בין האור ובין החשך. הנה יש להתבונן איכה שייך להשתמש האור והחשך יחד בערבוביא שני הפכים בנושא אחד. אכן הנה התורה נקרא אור והתאוות עולם הזה נקראים חשך כנודע. ולכן הנה העוסק בתורה ובעבודה צריך להיות לבו וכוונתו טהורה לש\\\"ש לבד ולא לשום כוונה חיצונית כלל כמ\\\"ש יראת ד' היא אוצרו. יראת ד' טהורה וכו'. וכמ\\\"ש חכז\\\"ל לעבוד שלא ע\\\"מ לקבל פרס שהפי' הוא לא על שכר עולם הזה גם לא על תקוות שכר עוה\\\"ב כנ\\\"ל. לכן האדם העובד את הש\\\"י צריך לישר לבבו שלא יגיע לו בוודאי שום שכר וגמול כלל חלף עבודתו ואפי' אם חלילה עוד להיפך יסבול וישא הכל ולא ינוח מעבודתו והוא שכתוב לעבוד ולמשא על עבודתו ועל משאו כנ\\\"ל. וזהו הרמז במ\\\"ת שכפה עליהם הר כגיגית שאמרו חכז\\\"ל אע\\\"פ שיכפה עליהם חלילה משא הרב הכבידים על שכמם אעפ\\\"כ יקבלו הכל לטובה כנ\\\"ל. וזהו ע\\\"ד שפי' הרב הרמ\\\"ע ענין הטענות של יהושע עם ישראל כמוב' בסוף ספר יהושע שאמר להם בתחלה ועתה יראו את ד' ואם רע בעיניכם לעבוד את ד' בחרו לכם כו' ויען העם ויאמר חלילה לנו לעזוב את ד' כו' כי הוא הוציאנו ממצרים ועשה כל האותות כו' שבתשובה הזאת של ישראל הבין יהושע כי ע\\\"כ לא יעזבו את ד' בעבור הטובות שעשה להם. ואם חלילה יהי' להיפך אז שוב ישובו מאחריו ח\\\"ו ע\\\"כ אמר להם שנית לא תוכלו לעבוד את ד' כי אלהים קנא שמו לא ישא לפשעכם שהבינם כי לפעמים יתהלך עמם במדה\\\"ד על מעשיהם. ואעפ\\\"כ לא תשכחו את ד' אלהיכם כי גם הרעה ח\\\"ו תקבלו כמו הטובה. אז ויענו כל העם לא כי את ד' נעבוד ובקולו נשמע בכל הבחי' שיעברו עלינו אח\\\"כ ויכרות להם יהושע ברית וכתי' וישם לו חק ומשפט בשכם. הפי' חק הוא דבר שהוא בגזירות המלך בלי טעם ומשפט מורה על בחי' יסורין ר\\\"ל כנודע. וז\\\"פ שבכריתות הברית התנה עמהם שאע\\\"פ שיהי' לפעמים גזירה שהוא כחוק בלא טעם אעפ\\\"כ אל יקשה בעיניך למה עשה ד' ככה. וגם צריך לקבל ר\\\"ל גם המשפט בחי' היסורים לבלתי יפול ח\\\"ו מעבדות הש\\\"י כי הכל לטובה. וזהו באמת המדה של בנ\\\"י שבכל הצרות והגליות שעברו עליהם בכל זה הם חזקים וקיימים הם באמונתם כיתד שלא תמוט לעולם. אבל בעובדי כוכבים כתי' והי' כי ירעב והתקצף וקלל במלכו ובאלהיו וכו'. וזפ\\\"ה כל הגוים אשר עשית יבואו וישתחוו לפניך כי גדול אתה ועושה נפלאות פי' שהם אך משתחוים לפניך בעת אשר תעשה עמהם נפלאות ונסים אבל אנחנו עמך כו' נודה לך לעולם. הורני ד' דרכך כו' אודך ד' אלהי בכל לבבי ואכבדה שמך לעולם פי' לעולם בכל הבחינות שיעברו עלינו נודה לשמך. כי עיקר הוא חסדך גדול עלי מה שהצלת נפשי משאול תחתיה מעונשי הגיהנם ח\\\"ו כנ\\\"ל. וז\\\"ש מגיד דבריו ליעקב חוקיו ומשפטיו לישראל שהוא בחי' חוק ומשפט וכו' ובכ\\\"ז הם קבלו התורה אבל לא עשה כן לכל גוי ומשפטים בל ידעום כו' ואעפ\\\"כ לא רצו לקבל התורה כו'. וזהו הרמז שאמרו במרה שם שם לו חוק ומשפט כי בתחלתם מיד במרה על הדינין נצטוו שאע\\\"פ שיעברו חלילה הדינין עליהם כנ\\\"ל בכ\\\"ז יקבלו עליהם המצות וז\\\"ש שם שם לו חק ומשפט. הנה פי' חק ומשפט כבר בארנו כנ\\\"ל. אבל אח\\\"כ כתי' והי' אם שמוע תשמעו וכו' ושמרת כל חוקיו כל המחלה אשר שמתי במצרים לא אשים עליך כו' כי באמת סוף הדבר שלא יעשה עמנו רעה. אבל בתחלה אתם לא תכוונו על כך בעבור טובתכם כמו שהזהיר הכתוב לא תעשון אתי אלהי כסף וכו' והבן. וזה שאמרו המקדש את האשה ע\\\"מ שאין לך עלי שאר כסות ועונה ר\\\"י אומר בדבר שבממון תנאו קיים לכך בלי ספק כי אין צריך לקוות בתפלתו ועבודתו על זה. והנה כבר מבואר בספר חובות הלבבות כל עניני פחיתות הזאת ע\\\"ש. ומה גם כי הלכה פסוקה היא כי הפועל העובד אינו רשאי לאכול בשעת מלאכה זולת אשר יחוננו הבע\\\"ב ממדת החסד ע\\\"ש בב\\\"מ. והנה לכך צריך ליזהר מלהשתמש בערבוביא חשך ואור להיות בכוונת התורה והעבודה לערב האור התורה בחשך של העולם הזה כמבו' במדרש שהתחלנו. ולכך ויבדל אלהים בין האור והחושך. אבל חכז\\\"ל אמרו שגנוז לצדיקים לע\\\"ל הפי' הוא כי צריך ליזהר שלא להתכוון גם על עוה\\\"ב בעשיית המצות כמ\\\"ש וזהו הפי' וירא אלהים את האור כי טוב וגנזו לצדיקים לע\\\"ל דהנה העיקר האור של תורה יתגלה לצדיקים לע\\\"ל. וז\\\"פ גנזו לשכר העוה\\\"ב לצדיקים לע\\\"ל פי' העתיד לבא להם השכר שלא יהנו ממנו כלל בעולם הזה ולבל ידעו ממנו כלל בעולם הזה אם יש להם שכר לע\\\"ל אם לא. וכמש\\\"א ר' אבוהו כל אילון לאבוהו ואני אמרתי לריק יגעתי. פי' שהוא זכה לכל זה ע\\\"י מה שאמר בלבו תמיד כי לריק יגעתי כי מי יודע אם יקבלו מצותי ועבודתי וז\\\"פ שגנזו מהם לבל יכוונו עליו. וזה ודע שמתן שכרן של צדיקים לע\\\"ל. פי' הידיעה ממתן שכרם של צדיקים הוא לעתיד לבא אבל בעולם הזה אף הידיעה הזאת אין להם. וז\\\"ש דור המדבר אין להם חלק לעוה\\\"ב. פי' שלא ידעו מזה בעולם הזה אם יש להם חלק בעוה\\\"ב. וז\\\"ש הוה זהיר במצוה קלה כבחמורה שאין אתה יודע מתן שכרם של מצות. פי' כאשר אין אתה יודע אם יתנו לך איזה שכר בעד המצות אשר אתה עושה. א\\\"כ אין לך לשער גודל המצוה או הקטנה ממנה כי אין חילוק בעיניך בין זו לזו כי כולם מרועה אחד ניתנו מפי הש\\\"י ב\\\"ה. וז\\\"פ הפ' שהתחלנו וירא אלהים את האור כי טוב. פי' אור התורה הוא טוב שבקשו האור והחשך להשתמש בערבוביא. פי' בכוונת תערובות אור התורה עם מתן שכר ותאוות העולם הזה שהוא חשך. ויבדל אלהים. וגנזו לשכר העתיד לבא לצדיקים כנ\\\"ל:",
            "explanation": "ביאור העניין הוא שבשעת התפילה, כאשר האדם מכוון בעבודתו לשם טובת עצמו או שכר בעולם הזה, נראה כאילו פיו ולבו אינם שווים, שכן כוונתו אינה טהורה לשם שמים בלבד, אלא מעורבת בתאוות העולם הזה שהוא חשך, ולכן יש להבדיל בין האור והחשך ולא לכוון בעבור טובתכם."
        }
    ]
}