{
    "question_id": "fb3363c7-fc9e-4930-972d-1f27adf54735",
    "question": "in which scenario can it appear as if a person is lying in his prayers?",
    "selected_passages": [
        {
            "section": "Torah",
            "topic": "Vaetchanan",
            "number": "20",
            "passage": "רק השמר לך ושמור את נפשך מאד כו' ופן יסור מלבבך כל ימי חייך והודעתם לבניך ולבני בניך כו' יום אשר עמדת כו' אשר ילמדון ליראה אותי כל הימים אשר הם חיים עלהאדמה ואת בניהם ילמדון. הנה לכאורה אין קשור לפסוקים הללו. גם מה שאמר פן יסורו מלבבך והודעתם לבניך. כיון שיסורו מלבבו איך יודיעום לבניהם. ונראה לפרש בדרך צחות על אותן בני אדם שהם עסוקים בהבלי עולם ומטפשין ומסירים מעל לוח לבם מצות השי\\\"ת. גם בעמדם בתפלה שפתותיהם נעות ולבם בל עמהם. ורק את בניהם אשר יוולד להם הם מייסרין אותם ללכת אל בית הספר שלא לבטל רגע אחת רק יעסקו בתורה ותפלה. והוא אינו משים אל לבו מה שהוא ממעט בעבודתו ית\\\"ש ואיך ימלא לבבו להוכיח אחרים בשבט מוסר ובניו מומם ואינו מרגיש מומו הפוסל אותו. וזה שמרמז הכתוב השמר לך כו' ופן יסורו מלבבך. ר\\\"ל אתה בעצמך תסור מלילך בדרכי השם. והודעת' לבניך. היינו שתוכיח רק את בניך שהם ילמדו ועל עצמך לא תשגיח כלל. לא זו הדרך ישכון אור רק אשר ילמדון ליראה כו' שהם עצמם ילמדו מקודם ליראה כו' ואח\\\"כ את בניהם ילמדון:",
            "english_translation": "Only take heed to yourself and guard your soul diligently lest you forget and lest it depart from your heart all the days of your life and make them known to your children and your children's children the day you stood when they will learn to fear me all the days that they live on the earth and teach their children. Behold apparently there is no connection to these verses. Also what he said lest they depart from your heart and make them known to your children. Since they depart from his heart how will they make them known to their children. And it seems to explain humorously about those people who are busy with worldly vanities and become foolish and remove from their heart's tablet the commandments of God. Even when standing in prayer their lips move but their hearts are not with them. And only their children who are born to them they discipline them to go to school not to waste a single moment only to engage in Torah and prayer. And he does not take to heart what he diminishes in his service to God and how can he fill his heart to rebuke others with the rod of discipline while his children have blemishes and he does not feel his own blemish that disqualifies him. And this is what the verse hints take heed to yourself lest they depart from your heart meaning you yourself will turn from walking in God's ways. And make them known to your children meaning you will rebuke only your children that they should learn while on yourself you do not watch at all. This is not the way light dwells but rather they should learn to fear that they themselves should first learn to fear and afterward teach their children.",
            "average_score": 9.0,
            "reference": "Tiferet Shlomo, on Torah, Vaetchanan 20"
        },
        {
            "section": "Festivals",
            "topic": "Shaar Tefillah",
            "number": "6",
            "passage": "(תהילים ס״ה:ב׳-ג׳) לך דומי' תהלה ולך ישולם נדר שומע תפלה עדיך וכו'. דברי עוונות גברו מני פשעינו אתה תכפרם וכו'. הסמיכות של הפסוק ולך ישולם נדר לפסוק שלאחריו שומע תפלה כו'. דהנה איש מישראל הרוצה להתפלל נזכר מיד עוונותיו העצומים. ובפרט שמורא עלה על ראשו שלא מיבעיא שתפלתו אינה נכנסת לפני הבורא ב\\\"ה אך גם אדרבא נותן כח בעבודתו ותורתו לסט\\\"א ח\\\"ו כמבואר בספרים הקדושים [ועי\\\"ז יש יניקה להחיצונים מהקדושה] מכח התורה ומצות ח\\\"ו. ולזה היתה כוונת דוד המלך ע\\\"ה (תהילים כ״ז:ח׳) לך אמר לבי בקשו פני את פניך ד' אבקש. (ולזה התפלל אל תסתר פניך ממני) היינו שהאדם נופל בדעתו במורשי לבבו ונפשו חשקה להתפלל. והיינו את פניך ד' אבקש. ולזה התפלל אל תסתר פניך ממני וכו' ונחני באורח מישור. היינו שהתפלות ילכו למעלה בדרך הישר. ולזה אמר אל תתנני בנפש צרי. היינו שהתפלות לא יכנסו ח\\\"ו בנפש הסט\\\"א. אך התיקון לאיש הישראלי שרוצה להתפלל לקבל עליו מכאן ולהבא לעבוד את ד' בכל לבו ולשוב על עוונותיו והימים הראשונים יפלו. והנה אצל הקב\\\"ה המחשבה כמעשה שהקב\\\"ה יודע מחשבות בנ\\\"א שאדם הזה יעשה תשובה נכונה. ולזה אף שלא עשה עדיין תשובה אצל הקב\\\"ה הוא כמעשה. דאצל בני אדם אם אחד חייב ממון לחבירו ואינו רוצה לפרוע לו זמן זמנים ואח\\\"כ נתחרט והוא רוצה לפרוע לו אזי אינו מאמין לו מחמת שכפר לו זמן זמנים עד שיפרע לו אזי הוא מתפייס עמו אבל אצל הקב\\\"ה מיד כשאדם מדבר לפני הש\\\"י ב\\\"ה שבדעתו לשוב בתשובה הקב\\\"ה יודע שיעשה תשובה ומיד מוחל לו וכמו שמצינו בדניאל שמיד שקבל עליו להתענות מיד אמר הקב\\\"ה שנענה כמבואר בש\\\"ס תענית דף ח' ע\\\"ב. וזה דנדר הוא הרי עלי נדר ולזה אמר לך דומי' דהיינו מהראוי שלא יתפלל כלל מחמת הטעמים הנ\\\"ל שאדרבא נותן כח התפלה להחיצונים ח\\\"ו. ולזה אמר ולך דווקא להקב\\\"ה שהוא יודע מה שיהי' בסוף ישולם נדר שהנדר הוא כמו ששלם כבר הנדר. שאצל הקב\\\"ה העבר וההוה והעתיד הוא הכל אחד כמו שאיתא בספרים ולזה אני מקבל עלי שלא אחטא עוד ומקבל עליו לעשות תשובה. ולזה אמר מיד אח\\\"כ שומע תפלה עדיך כל בשר יבואו היינו שמיד שקבל עליו לעשות תשובה מיד הולכים התפלות להקב\\\"ה. דברי עוונות גברו מני פשעינו אתה תכפרם וכו'. ובזה י\\\"ל כוונת הכתוב (בתהילים ל״ב:ה׳) חטאתי אודיעך ועוני לא כסיתי אמרתי אודה עלי פשעי לד' ואתה נשאת עון חטאתי סלה. על זאת יתפלל כל חסיד עליך. דבל\\\"ז אי אפשר להתפלל דסביביו נשערה מאד והיו יראים החסידים להתפלל מחמת יראה הנ\\\"ל. ולזה אמר אודה עלי פשעי היינו שמתוודה ומקבל עליו שלא יחטא עוד עי\\\"ז יתפלל כל חסיד. רק לשטף מים רבים אליו לא יגיעו. הכוונה לסט\\\"א כמ\\\"ש מים רבים לא יוכלו לכבות את האהבה כמ\\\"ש חכז\\\"ל על העובדי כוכבים ומזלות. אליו לא יגיעו. היינו שהתפלות אינם נכנסים ח\\\"ו לסט\\\"א רק לשמים ונעשים עטרה להבורא ב\\\"ה וק\\\"ל: (מכי\\\"ק)",
            "english_translation": "To You silence is praise and to You a vow shall be paid, O hearer of prayer, unto You all flesh shall come. Words of iniquities have overpowered me; our transgressions, You shall atone for them. For You my heart says \"Seek My face\"; Your face, O Lord, I seek. Hide not Your face from me, and lead me on a straight path. Do not give me over to the will of my adversaries. For with the Holy One, blessed be He, thought is like deed, as He knows the thoughts of men that this person will make proper repentance. And thus even though he has not yet repented, with the Holy One it is as if done. And this is why immediately after accepting upon himself to repent, immediately the prayers go to the Holy One. Words of iniquities have overpowered me; our transgressions, You shall atone for them.",
            "average_score": 9.0,
            "reference": "Tiferet Shlomo, on Festivals, Shaar Tefillah 6"
        },
        {
            "section": "Torah",
            "topic": "Toldot",
            "number": "9",
            "passage": "ויתרוצצו הבנים בקרבה ותאמר אם כן למה זה אנכי כו'. ופרש\\\"י עוברת על פתחי תורה יעקב מפרכס לצאת. עוברת על פתחי ע\\\"ג עשו מפרכס לצאת. הנה בפ' זו מורה לנו התורה הקדושה דרך הישרה לעבודת הבורא ב\\\"ה שיהיה באמת ובתמים ולא יהיה דרכו דרך הפכפך וזר עד ארגיעה לשון שקר. כאשר נמצא רבים מעמי הארץ כי בשעה שעוסק בתורה ותפלה לבבו כלפיד יבער. וכאשר התעיף בו ואיננו כי אחר התפלה תיכף הולך בשרירות לבו חומד ומתאוה. וז\\\"פ הענין וירא אלהים את האור כי טוב כו' ודרשו חז\\\"ל שאיננו ראוי שישתמשו האור והחשך בערבוביא כו'. לכאורה אין להבין איך שייך לומר אור והחשך יחד בערבוביא תרתי דסתרי אהדדי. אך הרמז בזה. כי דרכי התורה ועבודה המה רומזים לאור. ותאוות העולם השפל והנבזה הם דומים לחשך. והאדם צריך לשמור מזה לבל יהי' בערבוביא פוסח על שני הסעיפים פעם הולך בדרכי התורה ופעם פונה לדרכי החשך ח\\\"ו. וכזה פרשנו בפ' צרופה אמרתך מאד ועבדך אהבה. כי זהו הצירוף והבחינה אם התו\\\"מ מביאים את האדם לידי האהבה לבל יסיר מני דרך הישרה. לכן עתה כאשר ראתה רבקה אמנו שהתרוצצו הבנים סברה כי הוא אדם אחד אשר פעם חשקו ללכת לבהמ\\\"ד ופעם חשקו ללכת לפתחי ע\\\"ג כדרך אנשי רשע כאשר יבוא בין הצדיקים יתלוה עמהם לעשות כמעשיהם. וכאשר פונה מהם ופגעו בו אנשים פוחזים וריקים הנה הוא כאחד מהם. לכן ותלך לדרוש את ה' מה יהיה בסופו. כי לא זה הדרך ישכון אור רק כיתד שלא תמוט. לזה כתיב ויאמר ה' לה שני גוים בבטנך. כי באמת הם שנים יעקב ועשו זה פונה לרשעו ותאוותו הרעה. וזה פונה לתומו וצדקתו לעד עומדת בל ימוט לנצח. ובזה יש לרמז מ\\\"ש להלן ויהי אך יצוא יצא יעקב מאת פני יצחק אביו והנה עשו אחיו בא מצידו. לרמז על הנ\\\"ל ויהי לשון צער כאשר נמצא איש הפכפך במעשיו אשר בשעת עשיית המצוה הוא בבחי' יעקב. וכאשר יצא מאת פני יצחק אביו בגמר תפלתו ועבודתו והנה חוזר לסורו נהפך לאיש אחר והנה עשו אחיו בא מצידו. מצידו. כי הסט\\\"א גובר עליו בתאוות עוה\\\"ז. אך צריך האדם להיות חזק ואמיץ כיתד שלא תמוט להשגיח על כל דרכיו בתם וביושר:",
            "english_translation": "And the children struggled within her, and she said if it is so why am I thus, and Rashi explained when she passed by the doors of Torah study Jacob would stir to come out, when she passed by the doors of idol worship Esau would stir to come out, behold in this portion the holy Torah shows us the straight path to serve the Creator blessed be He that it should be in truth and sincerity and one's path should not be fickle and strange until suddenly speaking falsehood, as is found among many common people for in the hour they engage in Torah and prayer their heart burns like a torch, and when you look away it is gone for after prayer they immediately go after their heart's desires lusting and craving, and this explains the matter \"And God saw the light that it was good\" and our sages interpreted that it is not fitting for light and darkness to be used in mixture, at first glance it is incomprehensible how light and darkness could be together in mixture as they contradict each other, but the hint in this is that the ways of Torah and service allude to light, and the desires of this lowly despised world are like darkness, and a person must guard against this so it won't be mixed straddling two branches sometimes going in Torah's ways and sometimes turning to ways of darkness God forbid, and thus we explained the verse \"Your word is very pure and Your servant loves it\" for this is the refinement and test if Torah and commandments bring a person to love so they won't turn from the straight path, therefore now when Rebecca our mother saw the children struggling she thought it was one person who sometimes desired to go to the study hall and sometimes desired to go to doors of idol worship like the way of wicked people when they come among the righteous they join with them to act like them, and when they turn from them and encounter worthless frivolous people behold they are like one of them, therefore she went to inquire of God what would be in the end, for this is not the path where light dwells but rather like an unmovable stake, for this it is written \"And God said to her two nations are in your womb\" for truly they are two Jacob and Esau this one turns to his wickedness and evil desire and this one turns to his integrity and his righteousness stands forever never to be moved, and in this there is a hint to what is written later \"And it happened just as Jacob went out from before Isaac his father and behold Esau his brother came from his hunting\" hinting to the above \"and it happened\" is an expression of distress when there is found a fickle person in their deeds who during performance of a commandment is in the aspect of Jacob, and when he goes out from before Isaac his father upon completing his prayer and service and behold he returns to his ways transformed to another person and behold Esau his brother comes from his hunting, from his hunting because the Other Side overpowers him with worldly desires, but a person must be strong and courageous like an unmovable stake to watch over all his ways in integrity and uprightness.",
            "average_score": 9.0,
            "reference": "Tiferet Shlomo, on Torah, Toldot 9"
        },
        {
            "section": "Torah",
            "topic": "Bereshit",
            "number": "40",
            "passage": "וישמעו את קול ה' אלהים מתהלך כו' ויתחבא האדם ואשתו בתוך עץ הגן ויקרא לו ויאמר איכה וכו' ואירא כי עירום אנכי ואחבא. ויאמר מי הגיד לך כי עירום אתה המן העץ אשר צויתיך לבלתי אכל ממנו אכלת. ההרגש בפסוקים הללו מבואר בראשונים. והנראה בפירוש הענין ע\\\"ד מאמרם ז\\\"ל שקראו לאדה\\\"ר גנב שגנב מעץ הדעת לכך ויתחבא כי כאשר הבין האדם בעצמו שחטא מאד כי ראה הנחש כרוך אחריו ורע עליו המעשה כמ\\\"ש וידעו כי עירומים הם ערומים מכל מצוה ומכל טובה לכך ויתחבא בתוך עץ הגן הוא התורה ע\\\"ש ג\\\"ן פרשיות לתורה כמבואר בזוה\\\"ק והתחבא בתורה להמלט מזוהמת הנחש. ויקרא לו ה' איכה. ר\\\"ל איכה תמצא ידך ורגליך אחרי עשות המעשה כזה והשיב את קולך שמעתי ואירא כי עירום אנכי מכל טובה. ואמר לו הקב\\\"ה מי הגיד לך כי עירום אתה כי זה דרך הסט\\\"א וכל הדבקים בה להתנשאות ולגבהות לאמר כי חף אנכי מפשע כמו שאנו רואים כל הרשעים אומרים לנפשם צדיקים אנחנו ולא חטאנו וכמו זה אמה\\\"כ הנני נשפט אותך על אמרך לא חטאתי. כי כן דרך היצה\\\"ר מסמא את עיני אדם לאמור כי בכל אשר הוא עושה עדיין לא חטא כלל ועודנו לא נתרחק כלל מהש\\\"י ואדרבא הוא מתאמר בנפשו עוד לאמור כי מצוה הוא עושה כל הימים כמו שהשיא לחוה לאמר והייתם כאלהים לכן ההתחלת העבדות שיהיה האדם מכיר בעצמו כי חטא לה'. וצריך להיות תמיד פלס ומאזני משפט לפלס דרכיו אם יכונו באמת לה' ולא יעשה בנפשו שקר כמ\\\"ש דוד המלך ע\\\"ה ה' לי בעוזרי ואני אראה בשונאי. ר\\\"ל ה' לי בעוזרי עי\\\"כ אוכל לראות ולהכיר בשונאי לידע מי הוא האוהב אותי ומי הוא השונא המפתה אותי לדרך רעה כי היצה\\\"ט ויצה\\\"ר שניהם מפת' לדרך מצוה אך זה חלקו בחיים וזה אחריתו דרכי מות. לכן הודיעני דרך זו אלך. הורני ה' דרכיך. תעיתי כשה אובד בקש עבדך. ואל יהיה דבר זה קטן בעיני האדם לשום עינא פקיחא על נפשו בכל עניניו כי מצינו כן בצדיקים הגדולים שלא הכירו במעשיהם וחשבו למצוה והיה בהיפך כמו ענין מכירת יוסף כי עברו כ\\\"ב שנים ולא ידעו כי עשו עולה עד שראו תפיסת אחיהם ואת בנימין. אז אמרו אבל אשמים אנחנו וכתיב מיד אחריו כי המליץ בינותם ע\\\"י שהכירו שחטאו נעשה מליץ טוב עליהם. וכן היה רדיפת שאול לדוד כי סבור היה כי הוא מצוה להורגו. מעתה ק\\\"ו ב\\\"ב של ק\\\"ו לאנשים פחותי ערך כמונו עורי לב שכלו ימיהם בהבל צריך להבין ולהשכיל בפתוי היצה\\\"ר להנצל ממצודתו ודבריו הטובי' ולדעת כי איש חוטא הוא. וכזה המליצו חכז\\\"ל יש צדיק וטוב לו צדיק ורע לו רשע וטוב לו. ר\\\"ל שאומרים לנפשם כי טוב הוא ואינם יודעים בעצמם שום חטא כי הוא דומה בעיניו לצדיק וטוב לנפשו מאד. וז\\\"ש ג\\\"כ כאן מי הגיד לך כי עירום אתה המן העץ אכלת ועודך מכיר שחטאת מאין בא לך זאת והשיב כי האשה אשר נתת עמדי היא נתנה לי ומבואר במד\\\"ר כי הוא שוגג ולכך בשוגג כתיב או הודע אליו חטאתו כי עודנו זוכה להתוודע אליו חטאתו אבל במזיד אינו יודע כלל שחטא כי הכל טוב בעיניו וכשר לפניו. וד\\\"ל:",
            "english_translation": "And they heard the voice of the Lord God walking and the man and his wife hid themselves among the trees of the garden and He called to him and said where are you and I was afraid because I was naked and I hid myself and He said who told you that you were naked have you eaten from the tree which I commanded you not to eat from it you have eaten and the feeling in these verses is explained by the early ones and it appears in the explanation of the matter according to their saying that they called Adam a thief who stole from the tree of knowledge therefore he hid himself for when man understood in himself that he had greatly sinned because he saw the serpent wrapped around him and the deed was evil upon him as it is written and they knew they were naked stripped of all commandments and all goodness therefore he hid himself among the trees of the garden which is the Torah named for the 53 portions of Torah as explained in the holy Zohar and he hid in Torah to escape from the contamination of the serpent and God called to him where are you meaning how will you find your hands and feet after doing such a deed and he replied I heard your voice and I was afraid because I am naked of all goodness and the Holy One Blessed be He said to him who told you that you were naked for this is the way of the Other Side and all who cling to it to become proud and haughty saying I am free from transgression as we see all the wicked say to themselves we are righteous and have not sinned.",
            "average_score": 9.0,
            "reference": "Tiferet Shlomo, on Torah, Bereshit 40"
        },
        {
            "section": "Festivals",
            "topic": "Shaar Tefillah",
            "number": "23",
            "passage": "הודו לד' כי טוב כי לעולם חסדו. הנה עיקר ההודאה והשבח הוא בשביל כללות ישראל. כי אם האדם נותן הודאה על עצמו. חוץ דהוא גריעות בנפש שאינו שמח בישועת בנ\\י אך הוא ג\\\"כ גרעון בהודאה עצמה. למשל בשנה זו שהקב\\\"ה נתן מטר על הארץ והארץ נתנה יבולה. אם האדם יתן הודאה על עצמו לבד אין ההודאה גדולה כל כך אך אם האדם נותן הודאה על כל העולם שריחם על נפשות האומללים והרעבים אזי נותן האדם הודאה עצומה. ובפרט מי שיש לו קצת עושר אזי בשביל עצמו אינה נחשבת לו כ\\\"כ הטובה הזאת. אבל אם מסתכל על כל העולם כולו אזי רואה גודל החסד שעשה הקב\\\"ה בשנה זאת. וז\\\"פ הכ' הודו לד' כי טוב כי לעולם חסדו. לא תהללו בשביל עצמיכם רק כל אחד יהלל לד' עבור כל העולם שנעשה עמהם חסד. וז\\\"פ הכ' גם את העולם נתן בלבם. כדי להודות ולהלל להקב\\\"ה על כל הטובות ולהתפלל עליהם. וז\\\"פ הכ' ופדויי ד' ישובון ובאו ציון ברנה ושמחת עולם על ראשם שהשמחה לא תהי' על כל אחד לעצמו רק כ\\\"א יהי' שמח בשמחת חבירו ובשמחת כל העולם. ובזה תגדל השמחה על כל העולם ועל הצדיקים עד מאד. ובזה יהי' ששון ושמחה ישיגו. אך לזה צריך להיות לו טהרת הנשמה והנפש לקיים ואהבת לרעך כמוך. וז\\\"פ בידיד נפש כו' בהראות לה נועם זיווך אז תתחזק ותתרפא והיתה לה שמחת עולם. עיקר הרפואה הוא לאדם אם יש לו שמחת עולם מכלל ישראל לראות בישועתם וגדולתם. וכבר אמרתי לפרש בזה דברי הש\\\"ס גדול העונה אמן יותר מן המברך כו' מה טעם לזה. אך הפי' בזה דמצינו תפלות בלשון יחיד דהיינו ברכת השחר שלא עשני עכו\\\"ם וכן כל הברכות כולם הולכים כל אחד ואחד לעצמו. פוקח עורים מלביש ערומים כמבואר במס' ברכות א\\\"כ אם אדם עונה אמן על ברכת חבירו ונותן הודאה לשמים על שחבירו נברא יהודי ורואה בעינים ויש לו מלבושים ושאר ענינים אזי גדול העונה אמן יותר מן המברך. כי זה מברך על עצמו וזה מברך על חבירו. וזה הי' מעלת יתרו ששמח על הטובה אשר עשה ד' לישראל. ויאמר ברוך ד' אשר הציל אתכם מיד מצרים שהוא לא הי' במצרים בכלל השיעבוד ונתן הודאה על ישראל. וזה כוונת המד\\\"ר שזהו הי' גנאי לישראל שלא ברכו להקב\\\"ה עד שבא יתרו ונתן הודאה. והרי ישראל אמרו שירה מקודם. אך הם נתנו הודאה על עצמם וזה אין כל כך חשיבות. אבל יתרו נתן הודאה על אחרים והוא דבר גדול ודו\\\"ק. וז\\\"פ רבים אומרים לנפשי מי יראנו טוב נסה עלינו אור פניך כו' היינו שהם מבקשים עבור עצמם. אבל אני איני כן. נתת שמחה בלבי מעת דגנם ותירושם רבו. וז\\\"פ צדקתך לא כסיתי בתוך לבי היינו בעת שהתפללתי והי' עת רצון לא המשכתי את הישועה לעצמי רק נחלק בשוה עם כל העולם. וזהו לא כחדתי חסדך ואמתך לקהל רב ובזה אתה ד' לא תכלא רחמיך ממני. היינו כל המבקש על חבירו והוא צריך לאותו דבר הוא נענה תחלה דהיינו אם אחד יש לו פרנסה ממסחר התבואה ומתפלל על הגשמים ובשעת הזול אין לו פרנסה. וז\\\"פ והוא צריך לאותו הדבר שיהי' ח\\\"ו יוקר. אז הוא נענה תחלה. כי לא על הלחם לבדו יחי' האדם כו'. וז\\\"פ בגמ' תבוא מארה למי שאשתו ובניו מברכים לו. למה דוקא ברכת המזון. אך הפי' שהוא נותן הודאה רק על מה שאשתו ובניו יש להם פרנסתם. רק ההודאה צריך להיות על כלל העולם. וז\\\"פ הגמ' אצל בועז דכתי' וייטב לבו שהי' מברך ברכת המזון. פי' בשעה שהי' בגורן וראה הברכה בתבואות הי' מברך להקב\\\"ה על הכלל ישראל. וז\\\"פ כי פקד ד' את עמו לתת להם לחם. להם דייקא. משום הכי כתי' כי שמעה. הא כולם שמעו. אלא פי' שמעה לשון שמחה מכלל ישראל ולא השגיחה על עצמה כלל. וז\\\"ש בישעי' ס\\\"ג חסדי ד' אזכיר כעל כל אשר גמלנו ד' ורב טוב לבית ישראל אשר גמלם כרחמיו וכרוב חסדיו ודו\\\"ק. וז\\\"פ הפ' כהניה בעיר גוועו כי בקשו אוכל למו וישיבו את נפשם היינו שהפרנסה אשר בקשו לא הי' רק עבור עצמם. וכן תשובה עבור עצמם. לפי שגם התשובה וכפרת עוונות צריך האדם להתפלל עבור כלל ישראל. וז\\\"פ על זאת יתפלל כל חסיד אליך לעת מצוא רק לשטף מים רבים אליו לא יגיעו. מים הם החסדים. והוא מתפלל רק עבור כלל ישראל לטובתם. אפי' אם הוא אינו נהנה כלל מן החסדים. וזה כל העולם ניזון בשביל חנינא בני כו'. וזהו נפתלי אילה שלוחה הנותן אמרי שפר. אילה היא החסידה שבחיות. והתפלה הזאת בוקעת כל הרקיעים. וז\\\"ש אם שגורה תפלתי בפי. היינו שהוא מתפלל עבור הכלל. התפלה זאת מקובלת ברצון. וז\\\"ש בש\\\"ס אין הקב\\\"ה מואס בתפלתם של רבים שנאמר הן אל כביר לא ימאס. ואמאי אין נשמע עדיין. אך הפי' אם כל אחד מתפלל על חבירו וצרכי רבים אזי תפלתו נשמעת. ובזה י\\\"ל העוסק בתורה ובגמ\\\"ח ומתפלל עם הצבור מעלה אני עליו כאלו פדאני לי ולבני מן הגלות. ג\\\"כ הפי' כן בכל מה שעוסק בתורה הוא עושה עם הצבור דהתורה מגינה ומציל כוונתו בלימודו שכל הצבור יהיו ניצולים מעבירות שבידם. ובגמילות חסדים כוונתו עם הצבור שהשכר של גמ\\\"ח יהי' ג\\\"כ עם הצבור. וכן מתפלל עם הצבור לטובת כלל ישראל",
            "english_translation": "Give thanks to the Lord for He is good, for His kindness endures forever. The main thanksgiving and praise is for the entirety of Israel. For if a person gives thanks only for himself, besides being a deficiency in the soul for not rejoicing in the salvation of others, it is also a deficiency in the thanksgiving itself. For example, in this year when the Holy One Blessed be He gave rain upon the earth and the earth yielded its produce, if a person gives thanks only for himself the thanksgiving is not so great, but if a person gives thanks for the whole world that He had mercy on the souls of the wretched and hungry, then the person gives tremendous thanks. And especially one who has some wealth, for himself this goodness is not considered so significant. But if he looks at the whole world, then he sees the greatness of the kindness that the Holy One Blessed be He did this year. And this explains the verse \"Give thanks to the Lord for He is good, for His kindness endures forever\" - do not praise for yourselves alone, rather each one should praise the Lord for the whole world with whom kindness was done. And this explains the verse \"Also the world He placed in their hearts\" - in order to give thanks and praise to the Holy One Blessed be He for all the good and to pray for them. And this explains the verse \"And the redeemed of the Lord shall return and come to Zion with song and eternal joy upon their heads\" - that the joy will not be for each one alone, rather each one will rejoice in his fellow's joy and in the joy of the whole world. And through this the joy will greatly increase for the whole world and for the righteous. And through this \"they will achieve gladness and joy.\" But for this one needs purity of soul and spirit to fulfill \"love your neighbor as yourself.\"",
            "average_score": 9.0,
            "reference": "Tiferet Shlomo, on Festivals, Shaar Tefillah 23"
        },
        {
            "section": "Festivals",
            "topic": "Rosh Hashanah",
            "number": "17",
            "passage": "א\\\"י אתם נצבים היום כולכם לפני ד' אלהיכם. ידוע מ\\\"ש המפרשים שזה רמז על יום ר\\\"ה. היום זה ר\\\"ה. ומרמז לנו הכתוב דרך הישרה בגשתו אל הרנה ואל התפלה להיות כל מגמתו רק על מה שנוגע לכבוד הבורא ב\\\"ה על צער גלות השכינה. וז\\\"ש הרמב\\\"ן על מ\\\"ש בגמ' ולעבדו בכל לבבכם עבודה זו תפלה כי הוא באמת עבודה קשה לגמור כל נוסח התפלה במחשבה נכונה שיהי' כוונתו למעלה. כי אם ישים כל מגמתו מה שיחסר לו היא תפלה פסולה כנודע. וזה הי' מעלת ר\\\"ח בן דוסא שאמרו עליו כל העולם ניזון בשביל חנינא בני וחנינא בני די לו בקב חרובין. כי הי' מסתפק במיעוט בדבר המצוי לו בכל עת ולא הוצרך לבקש עבור צרכיו מאומה רק מה שנוגע למעלה כבוד הבורא וכללות ישראל לכן הוא הי' צנור השפע לכלל ישראל. וזה הפי' (בתהלים ק\\\"א). תפלה לעני כי יעטוף ולפני ד' ישפוך שיחו. פי' שהוא עני כי יעטוף לשון איחור כמ\\\"ש והיו העטופים כו' וישליך אחר גיוו כל הצטרכות שלו הנוגע לעצמו. רק לפני ד' ישפוך שיחו. מה שנוגע לכבוד הבורא יהי' עיקר תפלתו כנ\\\"ל. וזה הרמז (בר\\\"ה דף ח' ע\\\"ב) במאמר הגמ' דאמר רב חסדא מלך וצבור מלך נכנס תחלה לדין וכו'. איבעית אימא לאו אורח ארעא למיקם מלכא אבראי כו'. רב חסדא פי' רב חסד. מלך וצבור פי' מה שנוגע לכבוד המלך ממ\\\"ה הקב\\\"ה. וצבור היינו מה שנוגע צרכי כללות בנ\\\"א. מלך נכנס תחלה. פי' תחלת ועיקר מגמת תפלתו יהי' מה שנוגע לכבוד הבורא מלכו של עולם על צער גלות השכינה דלאו אורח ארעא דליקום מלכא אבראי. והבן. כי כאשר האדם עומד בר\\\"ה במסירות נפש ולא ישגיח עבור עצמו כלל רק עבור גלות השכינה אז ממילא בטילים כל המקטריגים ומסטינים אשר עליו. כמ\\\"ש כתות מכתת שיעורי'. כי אם האדם שפל בדעתו ובטל במציאותו מחמת המסירות נפש וכל העומד לשרוף כשרוף דמי והוא כאין ומי יעמוד עליו לשטנו. ואז ממילא ימולא כל משאלות לבו וכל צרכיו לטובה. כי באמת יש לנו להשען על אבינו שבשמים כי הוא אדון המושיע בכל צרותינו. אך השכינה הקדושה אין עוזר לה בלתי אם אנו נתעורר תחלה באתערותא דלתתא. וז\\\"ש ימלא ד' כל משאלותיך ר\\\"ל כל משאלות לבבך יהי' ימלא ד' שיהי' שם הוי' בשלימות בלי פירוד. וז\\\"ש אתם נצבים. אתם אותיות אמת. נצבים היום כולכם. היום הוא ר\\\"ה יהי' כל עמדו ומצבו לתפלה. לפני ד' מה שנוגע לכבוד הש\\\"י. ואז ממילא ישמע לקול תפלתנו למלאות כל משאלות לבבינו אמן:",
            "english_translation": "You are standing today, all of you, before the Lord your God. Known what the commentators wrote that this hints at Rosh Hashana. Today is Rosh Hashana. And the verse hints to us the straight path in approaching prayer, that all one's intention should be only regarding what concerns the honor of the Creator, blessed be He, regarding the pain of the Divine Presence in exile. And this is what the Ramban wrote about what is said in the Gemara \"and to serve Him with all your heart\" - this service is prayer, for it is truly difficult work to complete the entire prayer text with proper thought that one's intention should be directed above. For if one puts all their focus on what they lack, it is an invalid prayer, as is known. And this was the virtue of Rabbi Chanina ben Dosa, about whom they said the whole world is sustained for the sake of my son Chanina, while my son Chanina is satisfied with a measure of carobs. For he was content with little that was available to him always and did not need to request anything for his needs, only what concerned the honor of the Creator above and the Jewish people as a whole, therefore he was the channel of abundance for all Israel. And this is the meaning in Psalms 101 \"A prayer of the poor man when he faints and pours out his speech before God.\" The explanation is that he is poor because he wraps himself, language of delay as it says \"and the wrapped ones, \" and casts behind his back all his personal needs. Only before God does he pour out his speech - what concerns the Creator's honor should be his main prayer as mentioned above. And this is hinted at in Rosh Hashana 8b in the Gemara's statement that Rav Chisda said: A king and public - the king enters first for judgment etc. If you wish, say it is not proper conduct for the king to wait outside etc. Rav Chisda means great kindness. King and public means what concerns the honor of the King, the Holy One blessed be He. And public means what concerns the needs of people in general. The king enters first means the beginning and main focus of his prayer should be what concerns the Creator's honor, King of the world, regarding the pain of the Divine Presence in exile, for it is not proper conduct for the king to wait outside. Understand, for when a person stands on Rosh Hashana with self-sacrifice and does not look out for himself at all but only for the Divine Presence in exile, then automatically all prosecutors and accusers against him are nullified, as it says \"broken vessels lose their measure.\" For if a person is humble in mind and nullified in existence due to self-sacrifice, and anything standing to be burned is considered as if burned, and he is as nothing - who will stand to accuse him? And then automatically all his heart's requests and needs will be fulfilled for good. For truly we must rely on our Father in heaven for He is the Master who saves us in all our troubles. But the holy Divine Presence has no helper unless we first awaken with an awakening from below. And this is the meaning of \"May God fulfill all your requests\" - meaning all your heart's requests should be that God's name be complete without division. And this is \"You are standing\" - the letters spell \"truth.\" \"Standing today all of you\" - today is Rosh Hashana, all your standing and position should be for prayer before God regarding what concerns His honor. And then automatically He will hear our prayer's voice to fulfill all our heart's requests, Amen.",
            "average_score": 9.0,
            "reference": "Tiferet Shlomo, on Festivals, Rosh Hashanah 17"
        },
        {
            "section": "Festivals",
            "topic": "Shaar Tefillah",
            "number": "12",
            "passage": "ר' אלעזר יהיב פרוטה לעני והדר מצלי. היינו לעורר רחמים בעולם עוד י\\\"ל עפ\\\"י דברי רז\\\"ל מרבה צדקה מרבה שלום. שלום יעשה לי שהנותן צדקה עושה שלום בין הקב\\\"ה להעני. שהעני הולך ומהרהר ח\\\"ו בלבו על הקב\\\"ה לכל הוא נותן פרנסה כו'. ור\\\"א הי' נותן על הכוונה זו. לכן הי' נותן לו בבקר מיד כדי שהעני יהי' יכול להתפלל ולהודות להקב\\\"ה שהזמין לו פרנסתו דאל\\\"כ בשעת התפלה הי' יכול העני ח\\\"ו להיות קורא תגר על הקב\\\"ה. וז\\\"פ ר\\\"א יהיב פרוטה לעני והדר מצלי. היינו העני הי' מתפלל אח\\\"כ: (מכי\\\"ק)",
            "english_translation": "Rabbi Eleazar would give a coin to a poor person and then pray. This is to arouse mercy in the world and also according to the words of our sages, increasing charity increases peace. Peace he will make for me, for one who gives charity makes peace between the Holy One Blessed be He and the poor person. For the poor person goes and contemplates Heaven forbid in his heart about the Holy One Blessed be He that He gives livelihood to all etc. And Rabbi Eleazar would give with this intention. Therefore he would give to him in the morning immediately so that the poor person would be able to pray and thank the Holy One Blessed be He who provided his livelihood, for otherwise during prayer the poor person might Heaven forbid complain against the Holy One Blessed be He. And this is the meaning of Rabbi Eleazar gives a coin to the poor person and then prays, meaning the poor person would pray afterwards.",
            "average_score": 9.0,
            "reference": "Tiferet Shlomo, on Festivals, Shaar Tefillah 12"
        },
        {
            "section": "Torah",
            "topic": "Miketz",
            "number": "4",
            "passage": "ויהי מקץ וכו'. פרש\\\"י כל לשון קץ סוף הוא. הנראה לרמז בדבריו הקדושים עפ\\\"י מ\\\"ש בפי' הפיוט קדם רבון עלמין במילין סתימין וכו'. להורות לכל איש בגשתו אל הרנה ואל התפלה על כל מחסורו בעניני עוה\\\"ז אשר יחסר לו לא ישים מגמתו על מצוקותיו רק יהיה עיניו ולבו על גודל צער גלות השכינה כמ\\\"ש בספרים על המשנה באבות דע מה למעלה ממך. פי' מהחסרון שחסר לך למטה תוכל להבין החסרון שנוגע למעלה צער גלות השכינה. וז\\\"ש ושמחתים בבית תפלתי תפלתם לא נאמר אלא תפלתי. פי' שיהיה עיקר תפלתם למען כבודו ית\\\"ש. וזה הרמז בגמ' שנים שנכנסו להתפלל. פי' בשעת התפלה צריך להיות בשני בחי'. מה שנוגע למעלה וגם בצרכי נפשו למטה. לכן במשה רבינו כשהיה מתפלל עבור אחותו כתיב אל נא רפא נא לה. הרמז בזה רפא נא לה' האחרונה בשם הוי' לעשות היחוד למעלה ואז ממילא תתרפא. וז\\\"פ לא על צדקותינו אנחנו מפילים תחנונינו לפניך כי על רחמיך הרבים. וז\\\"ש ואתה ברחמיך הרבים עמדת להם בעת צרתם. פי' שהעמידו נגד עיניהם צער גלות השכינה שהקב\\\"ה כביכול סובל גודל צער בנ\\\"י וכאשר באו למדריגה זו לעורר רחמי שמים אז נצמח להם הישועה רבת את ריבם. העולה מזה כי גם בכל נוסח התפלה שאנו מתפללים בשמ\\\"ע רפאנו ברך עלינו וכדומה הנראי' לעיני בשר כי הם דברים פשוטים הנצרכים בעוה\\\"ז. אמנם הם עומדים ברומו של עולם. וז\\\"פ קדם רבון עלמין במילין סתימין. כי במחשבה היא דברים סתומים לכן עולה לרצון למעלה. וז\\\"ש שועתנו קבל ושמע צעקתנו יודע תעלומות. פי' מה שאנו צועקים על מחסורינו אתה היודע תעלומות לבבנו כי כל כוונתינו על צער גלות השכינה כנ\\\"ל. ונחזור לענין הנ\\\"ל שזה רמז בדברי רש\\\"י במתוק שפתיו. רהי מקץ כל לשון קץ. פי' הצדיק כזה אשר כל לשונו בתפלתו הוא רק על הקץ ומצפה לישועת ה'. סוף הוא. פי' הוא אשר יזכה להיות בסוף ולראות במהרה בישועה ונחמה בבוא הגאולה ב\\\"ב. אמן:",
            "english_translation": "And it came to pass at the end etc. Rashi explains that every expression of 'end' means conclusion. It appears to hint in his holy words according to what is written in the explanation of the poem 'Before the Master of Worlds' with hidden words etc. To instruct every person when approaching prayer and supplication for all his needs in matters of this world that he lacks, he should not focus on his distress but rather have his eyes and heart on the great pain of the Divine Presence in exile as written in the books on the Mishnah in Avot know what is above from you, meaning from the lack that you lack below you can understand the deficiency that affects above the pain of the Divine Presence in exile. And this is what is said 'And I will gladden them in My house of prayer' - it does not say their prayer but rather My prayer, meaning that the main prayer should be for His blessed glory. And this is the hint in the Gemara two who entered to pray, meaning during prayer one needs to be in two aspects - what affects above and also one's personal needs below. Therefore with Moses when he prayed for his sister it is written please heal her please, hinting heal please to the final letter in God's name to create unity above and then automatically she will be healed. And this explains not for our righteousness do we cast our supplications before You but for Your great mercy. And this is what is said and You in Your great mercy stood for them in their time of trouble, meaning they set before their eyes the pain of the Divine Presence in exile that God as it were suffers the great pain of Israel and when they reached this level to arouse heavenly mercy then salvation sprouted for them fighting their fight. Rising from this that also in all the prayer text that we pray in the Amidah heal us bless us and similar which appear to physical eyes as simple things needed in this world, however they stand at the height of the world. And this explains Before the Master of Worlds with hidden words, for in thought they are hidden things therefore they rise favorably above. And this is what is said accept our plea and hear our cry Knower of Hidden Things, meaning what we cry about our needs You who knows hidden things of our hearts for all our intention is about the pain of the Divine Presence in exile as mentioned above. And returning to the above matter this is hinted in Rashi's words with his sweet lips and it came to pass at the end every expression of end, meaning such a righteous person whose every word in prayer is only about the end and anticipates God's salvation. It is the end, meaning he who will merit to be at the end and see quickly salvation and comfort when redemption comes speedily in our days Amen.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Torah, Miketz 4"
        },
        {
            "section": "Festivals",
            "topic": "Rosh Hashanah",
            "number": "42",
            "passage": "וזכור לנו ד' אלהינו אהבת הקדמונים. הנ\\\"ל בענין הזכרונות. דהנה כבר כתבנו בפנים על מ\\\"ש אזהרה בענין הזכרון דכתיב מחה תמחה את זכר עמלק מתחת השמים לא תשכח. הכוונה בזה שהאדם צריך למחות ולעקור ולבטל מקרבו מזכרת של היצה\\\"ר מה שהוא מעורר אותו ומזכירו תאוות וצרכי עולם הזה בדברי שוא ותפל ומה גם כי בשעת התפלה ולימוד התורה כשאדם נותן אל לבו להיות נכון לעמוד לפני הש\\\"י הוא מבלבל אותו בתחבולותיו ומזכירו דאגת עולם הזה וצרכי ביתו ופרנסתו. לכן גם מה שלומד בעת ההיא בא לבחי' השכחה כי איננו יכול לעבוד בשמחה. לכן הזהיר הכ' מחה תמחה את זכר עמלק הוא היצה\\\"ר מה שהוא מזכירך ומבלבל אותך תמחה מלוח לבבך. עי\\\"כ לא תשכח את כל דברי התורה שתלמוד. אך זאת יעלה על זכרונו כי הוא עומד לשרת לפני ד' ית\\\"ש. וז\\\"ש ד' הפיר עצת גוים הניא מחשבות עמים. רבות מחשבות בלב איש ועצת ד' היא תקום. ר\\\"ל ד' נותן לו עוז לאדם להפר ולהניא מלבו המחשבות רעות של העמים ותאוותם רק עצת ד' מה שנוגע לעבדות הש\\\"י היא תקום. והנה כאלה מחשבות וזכרונות הש\\\"י הוא הנכון. וזה שהבטיח הש\\\"י בתוה\\\"ק וזכרתי להם ברית ראשונים ר\\\"ל אעלה להם בלבבם לזכרון העבדות של הראשונים האבות הקדושים שהמשיכו אל העולם עבודה וקדושה. וז\\\"ש מבקשים זכרנו בזכרון טוב לפניך וזכר לנו ד' אלהינו אהבת הקדמונים בחי' האהבה של הקדמונים שעבדו את ד' מאהבה לנכון וזהו הזוכר למזכיריו טובות זכרונות. הש\\\"י הוא.. המזכיר אותנו זכרונות טובות של הקדושה כנ\\\"ל. וזהו הפי' זכרנו לחיים מלך חפץ בחיים. ר\\\"ל תזכירנו למה אנו חיים בזה כדי שיהי' לנו חיים אמיתים במה שהמלך חפץ בחיים כאלה. כמ\\\"ש ושמרתם מצותי וכו' וחי בהם אני ד'. וז\\\"ש בגמ' אמרו לפני פסוקי מלכות כדי שתמליכוני עליכם זכרונות כדי שיעלה זכרוניכם לפני. ר\\\"ל ע\\\"י שתמליכוני עליכם ותקבלו עליכם עול מלכותי עי\\\"כ יעלה זכרוניכם לפני. שיהי' לכם מחשבות קדושות שתזכרו תמיד באחדות הש\\\"י. וז\\\"ש ביעלה ויבא וכו' זכרונינו ופקדונינו. פי' שנזכור תמיד להתפלל על משיח בן דוד וירושלים ועל כל בית ישראל לטובה. וזהו ענין תפלת הזכרונות וע\\\"ז סיום הברכה זוכר הברית שהקב\\\"ה יזכירנו ברית האבות לעבדו באמת כמוהם לעולם אמן כי\\\"ר:",
            "english_translation": "And remember for us, Lord our God, the love of the ancients. Regarding the matter of remembrances, we have already written about what was warned concerning remembrance, as it is written \"you shall blot out the memory of Amalek from under heaven; do not forget.\" The intention in this is that a person must erase, uproot, and nullify from within himself the reminder of the evil inclination which awakens and reminds him of desires and worldly needs with vain and foolish matters, especially during prayer and Torah study when a person prepares his heart to stand before the Blessed Name, it confuses him with its schemes and reminds him of worldly concerns and household needs and livelihood. Therefore even what he learns at that time comes to forgetfulness because he cannot serve with joy. Therefore Scripture warns \"blot out the memory of Amalek\" which is the evil inclination that reminds you and confuses you - erase it from your heart's tablet. Through this you will not forget all the Torah words you learn. But this should rise in his memory that he stands to serve before the Blessed Lord. And this is what is said \"The Lord frustrates the counsel of nations, thwarts the plans of peoples. Many thoughts are in a person's heart but the Lord's counsel shall stand.\" Meaning the Lord gives strength to a person to nullify and prevent from his heart the evil thoughts of the peoples and their desires - only the Lord's counsel regarding divine service shall stand. And such thoughts and remembrances of the Blessed Name are proper. And this is what the Blessed Name promised in the Holy Torah \"I will remember for them the covenant of the ancients\" meaning I will raise in their hearts the remembrance of the service of the first ones, the holy forefathers who drew service and holiness into the world. And this is what is requested \"Remember us with good remembrance before You\" and \"Remember for us Lord our God the love of the ancients\" - the aspect of love of the ancients who served the Lord properly with love, and this is \"Who remembers those who mention Him with good remembrances.\" The Blessed Name is the one who reminds us of good remembrances of holiness as mentioned. And this is the meaning of \"Remember us for life, King who desires life\" - meaning remind us why we live in this world in order to have true life in what the King desires in such lives, as it is written \"Keep My commandments and live by them, I am the Lord.\" And this is what the Gemara says \"Recite before Me verses of kingship to crown Me over you, remembrances so that your remembrance shall rise before Me\" - meaning through crowning Me over you and accepting the yoke of My kingship, through this your remembrance will rise before Me, that you will have holy thoughts and always remember the unity of the Blessed Name. And this is what is said in Ya'aleh V'yavo \"our remembrance and our being remembered\" - meaning that we should always remember to pray for the Messiah son of David and Jerusalem and for all the house of Israel for good. And this is the matter of the prayer of remembrances and on this concludes the blessing \"Who remembers the covenant\" that the Holy One Blessed be He will remind us of the covenant of the forefathers to serve Him in truth like them forever, amen, may it be His will.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Festivals, Rosh Hashanah 42"
        },
        {
            "section": "Festivals",
            "topic": "Shemini Atzeret",
            "number": "27",
            "passage": "ה' עוז לעמו יתן ד' יברך את עמו בשלום. ויהיו נא אמרינו לרצון לפני אדון כל. הסמיכות של ב' הפסוקים הללו. נקדים לפרש הפסוק בתהלים. יפיפית מבני אדם הוצק חן בשפתותיך. חגור חרבך על ירך גבור הודך והדרך. עוד נקדים לפרש הפסוק. כל ארחות ד' חסד ואמת לנוצרי בריתו ועדותיו. דהנה ידוע שברית הלשון וברית המעור מכוונים זה כנגד זה כמבואר בספרים הקדושים דאם האדם איננו שומר את הדיבור אז ממילא בא לידי פגם הברית ח\\\"ו כמ\\\"ש בס' ראשית חכמה ובס' תומר דבורה על פסוק אל תתן את פיך לחטיא את בשרך. בשרך היינו הברית קודש כמ\\\"ש ועל בריתך שחתמת בבשרנו ע\\\"ש. ומכ\\\"ש אם ח\\\"ו האדם חוטא בברית פשיטא שאין תפלתו נשמעת ואין תורתו עולה למעלה. ובזה פרשתי המשנה אל תרבה שיחה עם האשה כו' מכאן אמרו המרבה שיחה כו' ובוטל מדברי תורה היינו שמבטלים דברי תורה שלו שלמד ושילמוד הכל הולך לסט\\\"א וכעין שאמרו מדאורייתא בביטול בעלמא סגי ולהוי כעפרא כו' אמרו פ\\\"ה גימט' מיל\\\"ה ובזוהר הקדוש \\\"מי \\\"יעלה \\\"לנו \\\"השמימה ר\\\"ת מילה. דהיינו אם האדם שומר את הברית אז תפלתו עולה השמימה. ובזה פרשתי והי' עקב תשמעון. עקב הוא שמירת הברית כידוע. ושמר ד' אלהיך לך את הברית לא יהי' בך עקר ועקרה ודרשו רז\\\"ל לא תהי' תפלתך עקורה היינו ע\\\"י שמירת הברית לא תהי' תפלתך עקורה ותהי' נשמעת למעלה. ובז\\\"פ נצור לשונך מרע ושפתיך מדבר מרמה. כפל הלשון לשונך ושפתיך. רמוז על שמירת הלשון וברי\\\"ק. וכ\\\"ז שהאדם אינו נשמר משמירת הברית ושמירת הפה אין המצות ומעש\\\"ט שלו הולכים למעלה רק לסט\\\"א ח\\\"ו. ולזה אמר מי האיש החפץ חיים כו' נצור לשונך מרע. ולזה אמר כל ארחות ד' חסד ואמת לנוצרי בריתו ועדותיו. דהיינו שהחסדים הולכים רק לבני ישראל שהם נוצרי בריתו ועדותיו. ונבוא לביאור הפסוקים הללו. יפיפית מבני אדם הוצק חן בשפתותיך. הנה ידוע שלא נכתב לשון חן רק לשומרי בריתו כגון אצל נח כתיב ונח מצא חן בעיני ד'. שכל דורו לא היו שומרים את הברית ונח שמר בריתו. ואצל יוסף כתיב ג\\\"כ לשון חן וימצא חן בעיניו. ויתן חנו בעיני שר בית הסוהר. וזהו חן וכבוד יתן ד' לא ימנע טוב להולכים בתמים. תמים הוא מי ששומר הברית כידוע בזוה\\\"ק. ויעקב איש תם נח צדיק תמים. ולזה יתן להם חן ולא ימנע טוב שיסוד העליון נקרא טוב כידוע. ולזה אמר הוצק חן בשפתותיך. היינו שהתפלות יתקבלו למעלה. וגם מצא חן בעיני ד' וע\\\"ז אמר מהיכן האדם זוכה לזה. חגור חרבך על ירך גבור הודך והדרך היינו שמירת היסוד כמבואר בזוהר הקדוש (פ' וארא דף כ\\\"ו). שפסוק הזה מרמז על שמירת הברית. ולזה אמר ד' עוז לעמו יתן הוא ספירת היסוד כמבואר בכוונת האר\\\"י ז\\\"ל ד' יברך את עמו בשלום. שלום הוא ג\\\"כ יסוד כמ\\\"ש במקום אחר מזה. ולזה אמר ויהיו נא אמרינו לרצון לפני אדון כל. אדון הוא ספירת המלכות כידוע כל הוא ספירת היסו\\\"ד כמבואר בכתבי האר\\\"י ז\\\"ל על ואתה מושל בכל ע\\\"ש. אדו\\\"ן כ\\\"ל הוא יחוד הוי' אדנ\\\"י וק\\\"ל. ולזה אנו אומרים בברכת המזון. במרום ילמדו עליו ועלינו זכות שתהא למשמרת שלום. היינו שמירת הברית הוא יסו\\\"ד ונמצא חן ושכל טוב וכו' שלאחר שמירת היסוד נמצא חן בעיני אלהים ואדם כמו שמצינו ביוסף הצדיק וק\\\"ל: (מכי\\\"ק)",
            "english_translation": "The Lord will give strength to His people, the Lord will bless His people with peace. May our words be pleasing before the Master of all. The connection of these two verses. Let us first explain the verse in Psalms. You are fairer than the sons of men, grace is poured upon your lips. Gird your sword upon your thigh, O mighty one, your glory and your majesty. Let us further explain the verse. All the paths of the Lord are kindness and truth to those who keep His covenant and His testimonies. For it is known that the covenant of the tongue and the covenant of circumcision are aligned with each other as explained in the holy books that if a person does not guard his speech then he will come to damage the covenant heaven forbid as written in Reishit Chochma and Tomer Devorah on the verse do not let your mouth cause your flesh to sin.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Festivals, Shemini Atzeret 27"
        },
        {
            "section": "Festivals",
            "topic": "Rosh Hashanah",
            "number": "40",
            "passage": "א\\\"י אתה זוכר מעשה עולם ופוקד כל יצורי קדם. יבואר הענין כי בר\\\"ה יורד כל ההשפעות גם על המצות ומעש\\\"ט כי הוא הראש והתחלה לכל השנה. וזה הרמז ופוקד כל יצורי קדם. לשון פקודי ד' ישרים הם המצות ומעש\\\"ט וכל זה ע\\\"י מדת היסוד צי\\\"ע שהוא המשפיע בחי' דכר שבא ע\\\"י שמירת הברית. וז\\\"פ אתה זוכר מעשה עולם להביא השפעות טובות ופוקד כל יצורי קדם הם המצות שנקראו פקודי קדם. קדם ידעתי מעדותיך כו' כי כל ברי\\\"ע הי' בשביל ישראל שנקראו ראשית. רק ע\\\"י החטא אדה\\\"ר נתערב טו\\\"ר ע\\\"י עץ הדעת. ובר\\\"ה יצא יוסף מבית האסורים. מדתו של יוסף בחי' צי\\\"ע. ואז ממילא יורדים כל השפעות הן במילי דעלמא ובמילי דשמיא כמ\\\"ש בווין תתקטר. השכינה הקדושה מתדבקת בהצדיק והוא המשפיע לבנ\\\"י. וז\\\"פ אתם נצבים היום זה ר\\\"ה כידוע. ראשיכם שבטיכם וכו' לעברך בברית ד' אלהיך. פי' זה ההבטחה לבני ישראל שיזכו להיות בחי' המשפיע צי\\\"ע שנקרא ברית כיל\\\"ח ואתם תהיו צנור מכל ההשפעות לטובה אמן: כי דורשיך לעולם לא יכשלו כו' כי זכר כל המעשים לפניך בא ואתה דורש מעשה כולם. הנ\\\"ל עפ\\\"י מ\\\"ש בתיקוני הזוהר צווחין ככלבין הב הב. כי דרך האמת למבקשי ד' בימים האדירים האלו לבל ישים האדם מגמתו בתפלתו בכל ענינו מה שחסר לו לבדו רק ישפוך שיחו לטובת הכלל כל ישראל. וזה הרמז כי דורשיך לעולם. מה שמתפלל עבור כללות ישראל בעולם. בזה לא יכשלו. כי איננו נוגע בדבר לכן יעלה תפלתו לרצון למעלה. כי זכר כל המעשים לפניך בא. פי' אם הוא בבחי' המשפיע בחי' דכר לכל המעשים. לפניך בא לקבל ברצון תפלתו. מה דסני לך לחברך לא תעביד. האמנם כי כל צרכי עולם הזה נמאסים בעיניך לחברך לא תעביד ותמיד תבקש רחמים להשפיע כ\\\"ט לעולם:",
            "english_translation": "You remember the deeds of the world and take account of all ancient creatures. The matter will be explained that on Rosh Hashanah all influences descend also upon the commandments and good deeds for it is the head and beginning of the entire year. And this is the hint of \"takes account of all ancient creatures\" in the language of \"the precepts of the Lord are just\" which are the commandments and good deeds and all this through the attribute of foundation righteous one who influences the male aspect that comes through guarding the covenant. And this explains \"You remember the deeds of the world\" to bring good influences and \"takes account of all ancient creatures\" which are the commandments called ancient precepts. \"Of old I knew from Your testimonies\" etc. for all creation was for Israel who are called first. Only through the sin of Adam good and evil became mixed through the tree of knowledge. And on Rosh Hashanah Joseph left prison, his attribute being the aspect of righteous foundation. And then automatically all influences descend both in worldly matters and heavenly matters as written \"in Vav you shall be bound.\" The holy Divine Presence cleaves to the righteous one and he influences the children of Israel. And this explains \"You are standing today\" which is Rosh Hashanah as known. \"Your heads your tribes etc. to enter into the covenant of the Lord your God.\" This means the promise to Israel that they will merit to be the aspect of righteous foundation influencer called covenant as is known and you will be a channel for all good influences amen.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Festivals, Rosh Hashanah 40"
        },
        {
            "section": "Torah",
            "topic": "Noach",
            "number": "17",
            "passage": "[עוד מכת\\\"י]וזה פי' יראת ה' תוסיף ימים. מי שהוא ירא שמים עליהם נאמר כי אין מחסור ליראיו. פי' אף שיש להם חוסר רב בעניני עוה\\\"ז מ\\\"מ אינם מטריחים את בוראם ואומרים כל מה דעביר רחמנא לטב עביד ואינם מתפללים על מה שנוגע לעצמם.רק. מה שנוגע לכבוד הבורא ב\\\"ה ולכבוד כלל ישראל. צא ולמד מאברהם אבינו ע\\\"ה שלא התפלל על לוט בעבור שהיה אחיו והוה כאלו התפלל על עצמו. וכן לא רצה ג\\\"כ להפוך דעת הבורא ב\\\"ה בעת העקידה שלא לשחוט את בנו יחידו. וזה שאמר לו הש\\\"י מיד אחר העקידה עתה ידעתי כי ירא אלהים אתה:",
            "english_translation": "And this is the explanation of \"fear of God adds days.\" For one who fears Heaven it is said \"those who fear Him lack nothing.\" Meaning even though they have great lack in matters of this world, nevertheless they do not trouble their Creator and say everything the Merciful One does is for good, and they do not pray about what concerns themselves, only what concerns the honor of the blessed Creator and the honor of the Jewish people. Go and learn from our father Abraham peace be upon him who did not pray for Lot because he was his brother and it would be as if praying for himself. And likewise he did not want to change the mind of the blessed Creator at the time of the binding regarding not slaughtering his only son. And this is what God said to him immediately after the binding \"now I know that you fear God.\"",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Torah, Noach 17"
        },
        {
            "section": "Torah",
            "topic": "Pinchas",
            "number": "15",
            "passage": "ויקרב משה את משפטן לפני ה'. ויאמר ה' אל משה כן בנות צלפחד דוברות. יל\\\"ד מהו לשון כן הול\\\"ל אמת בנות צלפחד דוברות. אכן הנה כבר ידוע כי כל שאלת האדם בצרכיו מאת השי\\\"ת ותפלותיו הרבים לא נכון להם להתפלל עלצרכי עצמו בעניני עוה\\\"ז רק לכוון בהם להיות בזה כבוד שמים בכל דרכיך דעהו שיהיו כל עניני האדם רק לכבוד הש\\\"י ב\\\"ה על אחת כמה וכמה בשעת התפלה צריך לכוון לבו רק לשמים וממנו בא הישועה גם לעוה\\\"ז כמ\\\"ש ויזעקו אל ה' בצר להם וממצוקותיה' יושיעם. פי' שיהי' כל כוונתם אל ה' שהוא כביכול בצר להם עמהם ממילא ממצוקותיהם יושיעם. והנה עד\\\"ז הוא פי' כל הברכות שבש\\\"ע אע\\\"פ שהם שאלת צרכיו רפואה וברכת השנים הכל הוא למעלה כיל\\\"ח וצריך לכוון להש\\\"י כשמתפלל בהם ליחוד שלמעלה וע\\\"י כן שלום על ישראל. והנה לפעמים מי שאין בו דעת לכל אלה להתפלל על ה' כנ\\\"ל. הנה זהו העצה נכונה כשבא אל הצדיק הדור הנה הוא מליץ טוב בעדו כי גם הוא כוונתו רק לשמים ומקרב את עניניו וצרכיו שהוא ג\\\"כ לצורך גבוה ית\\\"ש. וז\\\"ש בגמרא מי שיש לו חולה בתוך ביתו ילך אצל חכם ויבקש עליו רחמים כי הצדיק הוא היודע להמליץ עליו רחמים בתפלתו וע\\\"ז הבטיח הש\\\"י למשרע\\\"ה וחנותי את אשר אחון ואמרו חכז\\\"ל אעפ\\\"י שאינו הגון ואינו כדאי הפי' שאין כוונתו רצויה להתקבל למעלה אני אעביר כל טובי על פניך שיהיה בך כח כזה להטיב לברואיו להמליץ טוב בעדם וללמד זכות עליהם עי\\\"כ וחנותי את אשר אחון. וז\\\"פ הנה אנכי בא אליך בעב הענן בעבור ישמעו העם בדברי עמך כו' וישב משה את דברי העם אל ה'. ר\\\"ל גם דברי פשוטי העם שאינם יודעים להתפלל באמת ברצוןובכוונה למעלה עכ\\\"ז יעלו לרצון על ידי הצדיק. וזה הענין כשבאו בנות צלפחד לתבוע נחלה בא\\\"י תחלה הנה יש לפרש בזה כוונה פשטיות שרצו בתחלה כדרך הארץ. ויש לפרש בהם עוד שהיה כוונתם על קדושת הארץ שהיו מחבבות הארץ ולכן כשבאו לפני משה ויקרב את משפטן לפני ה'. שהי' מקרב וממתיק אותם שתביעתן הוא ג\\\"כ למקום ב\\\"ה כדרך הנכון להצדיק לקרב את בנ\\\"י לפני הש\\\"י ולזה השיב לו הקב\\\"ה כן בנות צלפחד דוברות אינך צריך עוד להמתיק ולתקן דבריהם בכוונתם. כן בנות צלפחד דוברות מתחלה רק לרצון הש\\\"י:",
            "english_translation": "And Moses brought their case before the Lord. And the Lord said to Moses, \"The daughters of Zelophehad speak correctly.\" It should be asked what is the meaning of \"correctly\" - it should have said \"truly\" the daughters of Zelophehad speak. Indeed it is already known that all requests of man for his needs from the Blessed Name and his many prayers are not proper to pray for his own needs in matters of this world but only to intend in them to bring honor to Heaven in all your ways know Him that all matters of man should be only for the honor of the Blessed Name how much more so during prayer one must direct his heart only to Heaven and from Him comes salvation also to this world as it is written \"They cried to the Lord in their distress and from their troubles He saved them.\" This means that all their intention should be to the Lord who is as if in distress with them consequently from their troubles He will save them. And thus is the explanation of all blessings in the Shulchan Aruch even though they are requests for needs healing and blessing of the years all is above as is known and one must intend to the Blessed Name when praying them for unification above and through this peace upon Israel. And sometimes one who lacks understanding for all these to pray to the Lord as mentioned above. This is the proper advice when he comes to the righteous one of the generation he is a good advocate for him because his intention too is only for Heaven and brings close his matters and needs which are also for the high purpose blessed be He. And this is what the Gemara says one who has a sick person in his house should go to a sage and request mercy for him because the righteous one knows how to advocate mercy for him in his prayer and for this the Blessed Name promised Moses \"I will be gracious to whom I will be gracious\" and the Sages said even though he is not worthy and not deserving meaning his intention is not proper to be accepted above I will pass all My goodness before you that you will have such power to benefit His creatures to advocate good for them and teach merit for them through this \"I will be gracious to whom I will be gracious.\" And this explains \"Behold I come to you in the thick cloud so that the people will hear when I speak with you etc.\" and Moses brought back the words of the people to the Lord. Meaning also the words of the simple people who do not know how to pray truly with desire and intention above nevertheless they will be accepted through the righteous one. And this is the matter when the daughters of Zelophehad came to claim inheritance in the Land of Israel first there is to interpret in this a simple intention that they wanted at first in the way of the world. And there is to interpret in them further that their intention was for the holiness of the Land that they cherished the Land and therefore when they came before Moses and he brought their case before the Lord that he was bringing close and sweetening them that their claim is also for the Blessed Place in the proper way for the righteous to bring the children of Israel before the Blessed Name and to this the Holy One Blessed be He answered him \"correctly the daughters of Zelophehad speak\" you do not need to further sweeten and fix their words in their intention. \"Correctly the daughters of Zelophehad speak\" from the beginning only for the will of the Blessed Name.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Torah, Pinchas 15"
        },
        {
            "section": "Torah",
            "topic": "Vaera",
            "number": "1",
            "passage": "וידבר אלהים אל משה ויאמר אליו אני ה' . להבין ענין האמירה הזאת שאמר אליו אני ה' מה אמר לו. אך הנה באה ללמד לאדם דעת להבין בעצמו כי בכ\\\"ע עמדו לפני ה' בתורה ותפלה כי הוא איננו כדאי וראוי לזכות ולעמוד לפתוח פיו לפני הש\\\"י ממה\\\"מ הקב\\\"ה ואינו בכחו לדבר מאומה זולת מחסד הבורא עליו אשר ישים דבר בפיו לאמר כה תדבר כמש\\\"א דוד המלך ע\\\"ה כי אין מלה בלשוני הן ה' ידעת כלה. לכן צריך האדם להכנע ולשבר לבבו קודם הלימוד והתפלה להתפלל לה' ולשאול ממנו מענה לשון כמ\\\"ש בברכת התורה אשר קדשנו במצותיו וצונו לעסוק בדברי תורה. ואעפ\\\"כ מתפללים והערב נא כו' את דברי תורתך בפינו שיהיה בו עריבות ומתיקות לפניך להיות נחת רוח לפני כסא כבודך אע\\\"פ שהאדם מחויב ללמוד במצות הבורא בחיוב דאורייתא מ\\\"מ אינו כשאר מלאכות שמחויב לראות להשלים פעולתו אשר נשלח אליה כי אורייתא צריך הקדמת דחילו ורחימו וכן בתפלה ושאר כל המצות כי הוא רק חסד עליון אשר יזכה האדם השפל לעמוד לפניו ולהתפלל כמ\\\"ש הללו את ה' מן השמים. ר\\\"ל להודות ולהלל לפניו ית\\\"ש הוא ג\\\"כ סיוע מן השמים טוב ה' לכל ורחמיו על כל מעשיו יודוך ה' כו' כל זה מצד הרחמנות אשר יודוך כל מעשיך. לכן אל יפול לב האדם עליו בראותו כי הקדים ליגע קודם התפלה הרבה בלימוד שיעורין כסדרן ואעפ\\\"כ מתהפך הוא בתחבולותיו בשעת התפלה ואיננה שגורה בפיו ואיננו יכול להתפלל כי הכל הוא מן השמים והוא יעשה את שלו. ועל כזה רמזו רז\\\"ל אל תעש תפלתך קבע. ענין הקביעות הוא הבא בכל עת בטבע. כן אל תעש תפלתך מצד שלמדת הרבה קודם התפלה בקביעות ועי\\\"כ נכון לך להתפלל. לא כן אלא רחמים ותחנונים לפני המקום מצד הרחמנות תבא לפני המקום. וכן נאמר ואתחנן כו' פרש\\\"י מתנת חנם אע\\\"פ שיש להם לצדיקים לתלות במעשיהם הטובים אעפ\\\"כ אינם מבקשים רק מתנת חנם. ר\\\"ל שיש להם לתלות שיהיה תפלתם נכונה ע\\\"י מעשיהם הטובים שלמדו הרבה ועשו מעש\\\"ט קודם התפלה אעפ\\\"כ אינם מבקשים ר\\\"ל הבקש' שלהם אינה רק מתנת חנם כנ\\\"ל. וז\\\"ש שצריך לומר קודם שמ\\\"ע אדני שפתי תפתח כי לולא זאת איך יכול לעמוד בתפל' כי איך יזכה ילוד אשה לעמוד לפני הקב\\\"ה. הנה כזה היה הענין אצל משרע\\\"ה ציר נאמן כי שלחו ה' לפדו' את בנ\\\"י ולהוציאם ממצרים ומשרע\\\"ה באהבתו לישראל הלך בהתלהבות לקיים דבר השליחות וכאשר ראה כי לא שמעו לו הרע בעיניו והתחיל לזעוק למה הרעות. אמר לו הקב\\\"ה דע לפני מי אתה עומד כי אני ה' כמו שמבואר בזוה\\\"ק מקמאי מלילת מילין אילין. ודו\\\"ק:",
            "english_translation": "And God spoke to Moses and said to him I am the Lord. To understand the matter of this saying that He said to him I am the Lord what did He say to him. Indeed it came to teach man knowledge to understand within himself that in all circumstances he stands before the Lord in Torah and prayer for he is not worthy and deserving to merit and stand to open his mouth before the Holy One blessed be He and it is not in his power to speak anything except from the Creator's kindness upon him who puts words in his mouth to say thus shall you speak as King David peace be upon him said for there is no word on my tongue behold Lord You know it all. Therefore a person needs to humble himself and break his heart before learning and prayer to pray to the Lord and ask from Him for an answer of tongue as it is said in the blessing of the Torah who sanctified us with His commandments and commanded us to engage in words of Torah. And nevertheless we pray and make sweet etc. Your Torah words in our mouths that there should be pleasantness and sweetness before You to be satisfaction before Your throne of glory even though a person is obligated to learn by the Creator's command as a Torah obligation nevertheless it is not like other tasks that one must see to complete his action that he was sent to do for Torah requires the precedence of fear and love and so too in prayer and all other commandments for it is only supreme kindness that the lowly person merits to stand before Him and pray as it is said praise the Lord from the heavens meaning to thank and praise before Him blessed be He is also assistance from heaven the Lord is good to all and His mercies are upon all His works they will thank You Lord etc. all this is from the aspect of mercy that all Your works will thank You therefore let not a person's heart fall upon seeing that he preceded to toil before prayer much in learning regular lessons and nevertheless he turns in his strategies during prayer and it is not fluent in his mouth and he cannot pray for everything is from heaven and He will do His part and about this the Sages hinted do not make your prayer fixed the matter of fixedness is that which comes naturally at all times so do not make your prayer from the side that you learned much before prayer regularly and through this it is proper for you to pray not so but rather mercy and supplications before the Omnipresent from the aspect of mercy come before the Omnipresent and so it is said and I beseeched etc Rashi explained a free gift even though the righteous have to rely on their good deeds nevertheless they only ask for a free gift meaning that they have to rely that their prayer will be proper through their good deeds that they learned much and did good deeds before prayer nevertheless they only ask meaning their request is only a free gift as mentioned above and this is what is said that one needs to say before the Amidah Lord open my lips for without this how can one stand in prayer for how can one born of woman merit to stand before the Holy One blessed be He behold this was the matter with Moses our teacher peace be upon him the faithful messenger for the Lord sent him to redeem the children of Israel and take them out of Egypt and Moses our teacher peace be upon him in his love for Israel went with enthusiasm to fulfill the matter of the mission and when he saw that they did not listen to him it was bad in his eyes and he began to cry out why have You done evil the Holy One blessed be He said to him know before whom you stand for I am the Lord as is explained in the holy Zohar from before you spoke these words and examine carefully.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Torah, Vaera 1"
        },
        {
            "section": "Festivals",
            "topic": "Sukkot",
            "number": "51",
            "passage": "יהי לבי תמים בחוקיך למען לא אבוש. ובמד\\\"ר שבקש דוד המלך ע\\\"ה אף בשעת עשיית המצוות יהי' לבי תמים כי אע\\\"פ שלכך נברא היצה\\\"ר לבעבור תהי' הבחירה ביד האדם בכל זה צריך להתפלל שיעשה המצות בתמימות בלי שום פני' חיצונית למען לא אבוש כי באמת אם האדם עושה המצוה לשום כוונה חיצונית חלילה אז אח\\\"כ בעולם העליון הוא מתבייש מאד על סכלותו אשר לא טוב עשה וכמעשה המובא בס' ר' ייבא באחד שהגיד לחבירו בחלום איך שהוא מתבייש וחרפה תכסה פניו בהכריז עליו המלאך כוונת המצות אשר עשה בעולם הזה וכל הצדיקים ינוסו לקולם מג\\\"ע בשמעם אוולתו ופגמו ולכך צריך האדם להתפלל שלא יבוש בעה\\\"ב וזהו אחת שאלתי מאת ד' אותה אבקש שבתי בבית ד' כל ימי חיי פי' כל ימי חיי יעלו לפני ד'. לחזות בנועם ד'. פי' שאוכל לחזות ולהתראות לפני ד' ולא אבוש:",
            "english_translation": "Let my heart be perfect in Your statutes so that I will not be ashamed. And in the Midrash, King David peace be upon him requested that even during the performance of commandments his heart should be perfect, for although the evil inclination was created for the purpose of giving humans free choice, nevertheless one must pray to perform the commandments with wholeness without any external motives so that I will not be ashamed, for truly if a person performs a commandment for any external intention heaven forbid, then afterward in the upper world he becomes very ashamed of his foolishness for not acting properly, as in the story brought in the book of Rabbi Yiba about one who told his friend in a dream how he is ashamed and shame covers his face when the angel announces the intentions of the commandments he performed in this world and all the righteous flee from Paradise upon hearing his foolishness and blemish, and therefore a person must pray not to be ashamed in the World to Come, and this is \"One thing I ask from God, that I seek: that I dwell in the house of God all the days of my life\" meaning all the days of my life shall rise before God, \"to behold the pleasantness of God\" meaning that I should be able to behold and appear before God and not be ashamed.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Festivals, Sukkot 51"
        }
    ],
    "timestamp": "2024-12-24T08:22:45.681745",
    "metadata": {
        "total_passages_processed": 91,
        "selection_criteria": "Passages with average score above 7.0",
        "scoring_version": "3.0"
    }
}