{
    "question_id": "2478a061-a065-46b0-9f10-c55a250e5d39",
    "question": "our existence on this world is in the merit of the prayers of our forefathers",
    "selected_passages": [
        {
            "section": "Torah",
            "topic": "Beshalach",
            "number": "22",
            "passage": "א\\\"י זה אלי ואנוהו כו' . פרש\\\"י אלהי אבי לא אני תחלת הקדושה אלא מוחזקת ועומדת לי הקדושה ואלקותו עלי מימי אבותי. הנה כבר נתבאר במ\\\"א כי זהו מנת חלק אבותינו הקדושים בכל צדקתם ועבודתם להש\\\"י להוריד ולהשאיר ברכה לזרעם אחריהם כיום הזה וכוונתם הי' מאז להיות בניהם אחריהם עובדים את ה' באהבה ויראה ובתמימות כמוהם אשר ע\\\"כ יתארו בשם אבות להיותם נאמנים לתולדותם הבאים אחריהם מכחם. וע\\\"כ הצדיקים הקדושים ההם בחייהם ובמותם לא נפרדו מזרעם אחריהם בכל דור וכח האב דבוק בבן לא נפרד ממנו גם עתה. א\\\"כ כל עניני המצות ומעש\\\"ט אשר בנ\\\"י עושים שייך ומגיע לשורש נשמתם של אבותינו הקדושים ומיוחס להם לכך צריך האדם לומר מתי יגיעו מעשי למעשה אבותי להדבק בשורש האבות כנ\\\"ל. וזש\\\"א אלהינו ואלהי אבותינו האלקות מאבותינו נמשך לנו כן כל ענין כריתות ברית עם האבות הי' רק למען תת השפעות טובות לבנים כי כן מורה ענין הברית וכרות עמו הברית לתת ר\\\"ל כל ענין הברית רק לתת כו' לכן נאמר וזכרתי להם ברית ראשונים כנ\\\"ל. וכ\\\"נ וארא אל האבות כו' ואזכור את בריתי כו' . ר\\\"ל כבר הראיתי להאבות כל הטוב והשפעות טובות אשר יגיע לבנ\\\"י זרע ברך ה' בשם אל שדי לכן ואזכור את בריתי. והנה כי כן כי כל הטובות אשר יגיע לעם בנ\\\"י הם נוגעים אל האבות ומטובתם של הבנים מגיע שמחה להאבות אשר עמנו כהיום הזה משרשם. לכן רמזו בתפלת י\\\"ח אתה גבור כו' מחיה מתים ורב להושיע. מכלכל חיים בחסד כו' סומך נופלים ורופא חולים כו' . לכאורה מה ענין סומך נופלים וכו' לענין מחי' מתים. אבל לפי דרכינו יאמר בזה שאתה גבור ובעל גבורות ונמתקין בשרשם ורב להושיע בזה מחי' מתים הם האבות ובמה שאתה מכלכל חיים בחסד וסומך נופלים בזה מקיים אמונתו לישיני עפר דמיכי חברון כמ\\\"ש במ\\\"א ע\\\"פ כי ידעתיו למען אשר יצוה את בניו כו' למען הביא ה' על אברהם כי באמת הכל שב אל אברהם וכן ביעקב מה זרעו בחיים אף הוא בחיים כנ\\\"ל. וז\\\"ש ומשמחתך ששמחת בו ביעקב כי לו מגיע השמחה ואח\\\"כ נאמר בפ' ק\\\"ש שמע ישראל ישראל סבא ושמעו אל ישרא\\\"ל אביכם. ונחזור לענין הנה בקריעת ים סוף לא הי' כל הגדולות והונראות רק זאת לבד להעביר את ישראל בחרבה כי לכאורה לא הי' ענין הכרחי כמבו' בספרים. אך באמת גבהו מחשבות ה' בענין קריעת י\\\"ס וסודו ידוע להמשכילים כמבו' בזוה\\\"ק בעתיקא תליא מלתא וכדי לדכאינן במיין עלאין בבחי' נחל קדומים לגוזר ים סוף לגזרים והעביר ישראל בתוכו כנודע בספרים. ע\\\"כ כמוהו יעברו גאולים לעתיד כמ\\\"ש והכהו לשבעה נחלים והדריך בנעלים כי הוא ענין עבדות טהרה וקדושה לכן אחרי העבירם בים סוף נתקדשו ואמרו תיכף שירה ולא אמרו זאת אחר צאתם ממצרים. ולכן נאמר וירא ישראל ישראל סבא כנ\\\"ל. וזה שפרש\\\"י מוחזקת ועומדת היא הקדושה ואלקותו מימי אבותי כי אלקותו ועוצם הקדושה היא באה לי מכח חזקה זה היא של אבותי אשר השאירו אחריהם ברכה אתנו כנ\\\"ל:",
            "english_translation": "This is my God and I will glorify Him etc. Rashi explains 'the God of my father' - I am not the first of holiness, rather the holiness and His divinity upon me is established and maintained from the days of my fathers. Behold it has already been explained elsewhere that this was the portion of our holy forefathers in all their righteousness and service to God to bring down and leave blessing for their offspring after them as this day and their intention was from then that their children after them would serve God with love and fear and wholeheartedness like them, which is why they are called fathers, being faithful to their descendants coming after them from their power. And therefore these holy righteous ones in their lives and deaths did not separate from their offspring after them in every generation and the power of the father clings to the son not separated from him even now. Therefore all matters of commandments and good deeds that the children of Israel do belong and reach to the root of the souls of our holy fathers and are attributed to them therefore a person must say when will my deeds reach the deeds of my fathers to cling to the root of the fathers as mentioned above. And this is what is meant by \"our God and God of our fathers\" - the divinity from our fathers extends to us, so too all matters of covenants with the fathers were only to give good influences to the children for so indicates the matter of covenant and He cut with him the covenant to give meaning the entire matter of the covenant was only to give etc. therefore it says \"and I will remember for them the covenant of the first ones\" as mentioned above.",
            "average_score": 9.0,
            "reference": "Tiferet Shlomo, on Torah, Beshalach 22"
        },
        {
            "section": "Torah",
            "topic": "Eikev",
            "number": "11",
            "passage": "לא בצדקתך וביושר לבבך אתה בא לרשת כו' ולמען הקים את הדבר אשר נשבע ה' לאבותיכם לאברהם ליצחק וליעקב . הנ\\\"ל לבאר דהנה מצינו בהפטרה של פרשה הזאת. הביטו אל אברהם אביכם ואל שרה תחוללכם כי אחד קראתיו וכו' כי נחם ה' ציון נחם כל חורבותי' כו'. יש לדקדק מה ענין הסמיכה זה לזה פתח בשבחו של א\\\"א ע\\\"ה ומסיים בנחמת ציון. אולם כבר בארנו במ\\\"א פי' הגמ' כל המתאבל על ירושלים זוכה ורואה בשמחתה. הפי' הוא שזוכה מיד לראות בעוה\\\"ז הנחמות של עתיד שע\\\"י שהצדיק מצטער ומתאבל על חורבן ירושלים הוא מעורר הגאולה לכן מראים לו תיכף הנחמות העתידים כמו שראה ישעי' הנביא כל הישועות העתידי' וז\\\"ש עולמך תראה בחייך. וז\\\"ש עמו אנכי בצרה אחלצהו ואכבדהו. פי' מי שהוא מצטער על גלות השכינה ומשתתף עמה בצרה שזהו עמו אנכי בצרה. לצדיק כזה אחלצהו ואכבדהו אורך ימים אשביעהו ואראהו בישועתי. פי' מיד אראהו בישועה העתידה. וכן מצינו אצל נח זה ינחמנו כאשר בארנו במ\\\"א באריכות. והנה זה שהי' אצל א\\\"א ע\\\"ה שהי' מצטער מאד על זה שראה כולם עובדי ע\\\"ג ואין מזכיר שם כבודו ית\\\"ש בעולם כולם עוברי רצונו והשכינה בגלות ביניהם. לכך אמר לו הש\\\"י ב\\\"ה לך לך מארצך כו' אל הארץ אשר אראך. פי' אראך הישועות והנחמות העתידים כי אז יהי' ה' למלך על כל הארץ. והאלילים כרות יכרתון. ונשגב ה' לבדו ביום ההוא. וזהו אשר אראך. לכך בנה שם מזבח לה' על שראה הישועה הזאת. והנה כן הראה הש\\\"י כל זה לכל האבות הקדושים אשר מעולם דור ודור ודורשיו דור ודור ושופטיו עד היום האחרון של ביאת המשיח. והם נצטערו מאד על גלות השכינה ואורך הגלות והתפללו ע\\\"ז לכך הראה להם הש\\\"י שוב הישועות ונחמות של הגאולה כנ\\\"ל. וזש\\\"נ והי' עקב תשמעון את המשפטים האלה. והי' לשון שמחה עקב הוא סוף ואמה\\\"כ השמחה שיהי' לבסוף באחרית הימים בהגאולה תשמעון עתה בהגלות את המשפטים האלה עם המשפטים והיסורין שיש לכם בהצער של גלות השכינה תזכו עי\\\"ז לשמוע מיד שמחות והישועות העתידין כנ\\\"ל. הנה ע\\\"ז שאמה\\\"כ הביעו אל אברהם אביכם כו\\\" כי אחד קראתיו כשהי' הוא אחד עובד ה' בעולם קראתיו ואברכהו וארבהו כי הוא הי' מצטער מאד על גלות השכינה בעולם שלא היו עובדי השם לכן גרם לעורר הגאולה העתידה כי נחם ה' ציון ניחם כל חורבותי' כמ\\\"ש. והנה זה שאמה\\\"כ לא בצדקתך וביושר לבבך אתה בא לרשת את ארצם. הרמז בזה הוא על הגאולה וירושת הארץ לעולם בביאת משיחנו ב\\\"ב שהוא אך לקיים את הדבר אשר נשבע לאבותינו שהם הצטערו והתפללו על אורך גלות ישראל וגלות השכינה. ולכך הם גרמו להביא אותנו אל הארץ בביאת משיחנו במהרה. והוא שסדרו אנשי כנה\\\"ג וזוכר חסדי אבות ומביא גואל לבני בניהם בא\\\"י מגן אברהם כי א\\\"א ע\\\"ה גרם בחסדו להביא הגואל. וברכת מחי' מתים הוא נגד יצחק שבזכות יצחק יהי' תחיית המתים לעתיד. וברכת אתה קדוש הוא נגד יעקב אבינו שבזכות יעקב יהי' סוף ותכלית הכל הוא אחר הגאולה להודות ולהלל לשמו הגדול כל הימים וזהו וקדושים בכל יום יהללוך סלה שזה מוסב לעתיד כנ\\\"ל. וז\\\"ש יהי' כבוד ה' לעולם ישמח ה' במעשיו. הנה מעשיו הם הצדיקי' כמ\\\"ש ועמך כולם צדיקים וכו' כו' מעשי ידי להתפאר ואמה\\\"כ במה שיהי' כבוד ה' לעולם בהגאולה בזה ישמח ה' משמח את הצדיקי' שהם מעשיו כנ\\\"ל שהוא מראה להם עתה הגאולה העתידה וזהו אשר נשבע לאבותיך לשון שובע שמחות שהשביעם בנחמות העתידין להיות לישראל בב\\\"א:",
            "english_translation": "Not by your righteousness and uprightness of heart are you coming to inherit etc. and in order to establish the matter which the Lord swore to your fathers, to Abraham, to Isaac, and to Jacob. Look to Abraham your father and to Sarah who bore you, for when he was one I called him etc. for the Lord has comforted Zion, comforted all her ruins etc. Whoever mourns for Jerusalem merits and sees in its joy. The meaning is that one immediately merits to see in this world the future consolations, for through the righteous one's pain and mourning over Jerusalem's destruction, he awakens the redemption, therefore they show him immediately the future consolations as Isaiah the prophet saw all the future salvations, and this is what is meant by \"you will see your world in your lifetime.\" And this is what is meant by \"I am with him in distress, I will rescue him and honor him.\" The explanation is that one who suffers over the exile of the Divine Presence and shares in its distress, this is \"I am with him in distress.\" For such a righteous one \"I will rescue him and honor him, with long life I will satisfy him and show him My salvation.\" The meaning is I will immediately show him the future salvation. And so we find with Noah \"this one will comfort us\" as we explained elsewhere at length. And this was with Abraham our father peace be upon him who suffered greatly over seeing everyone serving idols with none mentioning His blessed name in the world, all transgressing His will and the Divine Presence in exile among them. Therefore the Holy One blessed be He said to him \"Go forth from your land etc. to the land that I will show you.\" The meaning of \"I will show you\" is the future salvations and consolations when the Lord will be King over all the earth and the idols will be utterly cut off and the Lord alone will be exalted on that day. And this is \"that I will show you.\" Therefore he built there an altar to the Lord because he saw this salvation.",
            "average_score": 9.0,
            "reference": "Tiferet Shlomo, on Torah, Eikev 11"
        },
        {
            "section": "Torah",
            "topic": "Yitro",
            "number": "7",
            "passage": "ויבא משה ויקרא לזקני העם וכו' ויענו כל העם יחדו כל אשר דבר ה' נעשה. יל\\\"ד הלא משרע\\\"ה קרא רק לזקני העם וישם לפניהם את כל הדברים האלה אשר צוהו ה' ואיך ענו אותו כל העם לאמר כל אשר דבר ה' נעשה הלא לא להם קרא ולא היו בזה. גם באמת יש להבין למה לא קרא משרע\\\"ה לכל ישראל מיד לומר להם כל אשר צוה ה' כאשר כן נצטווה כה תאמר לבית יעקב ותגיד לבני ישראל. ולמה קרא רק לזקני העם. אכן הנה זקני העם הוא מורה על האבות שנקראים זקנים כמ\\\"ש ואברהם זקן. ביצחק ויהי כי זקן יצחק. ביעקב ועיני ישראל כבדו מזוקן. והוא שכ' מזקנים אתבונן.כי הנה כן ענין קבלת התורה היא באה ע\\\"י כחות האבות הקדושים כי משנולד אברהם אבינו התחיל שני אלפים תורה והוא שכתוב בו ואת הנפש אשר עשו בחרן ומתרגם דשעבידו לאורייתא כי ממנו התחיל שיעבודא דאוריי' והוא היה כלול כל ס' רבוא נשמות ישראל ושיעבדום לאורייתא כולם כאחד בקרבו כמ\\\"ש בו וישמר משמרתי מצותי חקותי ותורותי. וכן היה ביצחק ויעקב והוא שכתוב במתן תורה ותחת כי אהב את אבותיך ויבחר בזרעם אחריהם כי כל האבות היו בשעת קבלת התורה וכן כל הקדושות וכל הישועות של ישראל כולם עוברים דרך מערת המכפלה כמבואר בזוה\\\"ק. והוא שכ' וארא אל האבות תחלה ואח\\\"כ אמור לבני ישראל והוצאתי והצלתי וגאלתי ולקחתי כי על ידי האבות עוברים כל הישועות וכמש\\\"א בעבור אבותינו שבטחו בך ותלמדם חוקי חיים כן תחננו ותלמדנו. פי' בעבור אבותינו שעברו ע\\\"י אבותינו כנ\\\"ל. והוא שאנו אומרי' על אבותינו ועלינו על בנינו ועל דורותינו על אבותינו באה תחלה הקדושה של דבריו חיים וקיימים ומהם בא עלינו ועל בנינו. וזה אלהי אברהם אלהי יצחק ואלהי יעקב וכו' וזוכר חסדי אבות ומביא גואל לבני בניהם כל הגאולה וישועה מן האבות בא לבני בניהם. וז\\\"ש וארא אל האבות באל שדי א\\\"ל שד\\\"י גימ' מש\\\"ה כי כן הראה הש\\\"י להאבות שיהיה משה הגואל אותם לכן בע\\\"כ אמר לו הש\\\"י בסנה לילך ולגאול אותם כמו שכן הראה לאבות. והנה כאשר כל התורה התחילה מא\\\"א ע\\\"ה כמ\\\"ש לכך אמר לו הש\\\"י הנה אנכי בא אליך בע\\\"ב הענ\\\"ן ע\\\"ב הוא שם ע\\\"ב שבחסד אברהה הענ\\\"ן גימ' קע\\\"ה מנין שנותיו של אאע\\\"ה כי אברהם זקן בא בימים עם כל הימים בא בתורה למעלה וזהו ויאסף אל עמיו כל הקדושה שלו נאסף לישראל. הנה לכך גם משרע\\\"ה תחלה קרא והתעורר לזקני העם הם האבות למתן תורה אז על ידי כן התעוררו כל ישראל וזהו ויענו כל העם אשר דבר ה' נעשה: (עוד בפסוק הזה כבר נדפס בחלק א' ):",
            "english_translation": "And Moses came and called for the elders of the people and all the people answered together all that the Lord has spoken we will do. And it should be understood that Moses only called the elders of the people and placed before them all these things that the Lord commanded him and how did all the people answer him saying all that the Lord has spoken we will do when he did not call them and they were not there. And truly it should be understood why Moses did not call all Israel immediately to tell them all that the Lord commanded as he was commanded thus shall you say to the house of Jacob and tell the children of Israel. And why did he call only the elders of the people. Indeed the elders of the people refers to the fathers who are called elders as it is written and Abraham was old. Of Isaac it says and it came to pass when Isaac was old. Of Jacob the eyes of Israel were heavy from age. And it is written from elders I will gain understanding.",
            "average_score": 9.0,
            "reference": "Tiferet Shlomo, on Torah, Yitro 7"
        },
        {
            "section": "Torah",
            "topic": "Toldot",
            "number": "4",
            "passage": "א\\\"י ואלה תולדות יצחק בן אברהם אברהם הוליד את יצחק. לכאורה הם כפולות הדברים הלא כבר כתיב יצחק בן אברהם. אכן הנ\\\"ל עפ\\\"י מ\\\"ש כי זכר את דבר קדשו את אברהם עבדו. להראות גודל מעלת א\\\"א ע\\\"ה אשר הוא היה הראשון לעשות היחוד בעולמות העליונים כמ\\\"ש עד אברהם לא היה זקנה כנ\\\"ל. וזה כי זכר את דבר קדשו בחינת זכר הוא המשפיע דכר הוא היחוד כמ\\\"ש ראוה מדברת כו' לכן בכח גודל קדושתו שהתחיל לעשות היחוד זה העומד לעזר ולסייע לכל הדורות הבאים אחריו. כמ\\\"ש (תהילים ע״ח:ה׳) ויקם עדות ביעקב ותורה שם בישראל אשר צוה את אבותינו להודיעם לבניהם לשון צוותא והתחברות עם כל הדורות אשר יבואו אחריו להיות מסייע לכל הבא לטהר ולעמוד לשרת לפניו ית\\\"ש. כמ\\\"ש בגמ' כל הקובע מקום לתפלתו אלהי אברהם בעזרו. יכול להמשיך עליו הקדושה והעבדות של א\\\"א ע\\\"ה. אלהי אברהם היינו האלקות שהמשיך אברהם על העולם כי הוא היה הראשון שהכיר הבורא ב\\\"ה והוא העומד לנו לעזר. וז\\\"ש בכל יום עזרת אבותינו אתה הוא מעולם כו' אשרי האיש שישמע למצותיך וכו'. פי' עיקר העזר הוא מאבותינו הקדושים אברהם אך אשרי האיש שישמע למצותיך ועודנו בחיים חיותו לעורר בעבודתו עזרת האבות כמ\\\"ש הארון נושא את נושאיו. וזה הנוהג בכל יום בעמדו בתפלה כמ\\\"ש בזוה\\\"ק בהקדמה דף י\\\"א ע\\\"א וז\\\"ל. ובצפרא קם מערסי' בעי לברכא למאריה ולמיעל לביתיה ולמסגד קמי היכליה בדחילו סגיא ובתר כן יצלי צלותי' ויסב עיטא מאינון אבהן קדישין דכתיב ואני ברב חסדך אבא ביתך כו' הכי אוקמוה לא לבעי לי' לבר נש לאעלא בי כנישתא אלא אי אמליך בקדמיתא באברהם יצחק ויעקב. וז\\\"ש בהודו אשר כרת את אברהם ושבועתו ליצחק ויעמידה ליעקב כו':",
            "english_translation": "And these are the generations of Isaac son of Abraham, Abraham begot Isaac. And these matters appear to be doubled, for it was already written Isaac son of Abraham. Indeed this is according to what is written that he remembered his holy word with Abraham his servant, to show the greatness of Abraham our father peace be upon him who was the first to make unity in the upper worlds as it is written until Abraham there was no old age as mentioned above. And this is that he remembered his holy word the aspect of male which is the influencer male is the unity as it is written they saw her speaking therefore through the power of his great holiness that he began to make this unity which stands to help and assist all generations that come after him. As it is written and he established testimony in Jacob and set Torah in Israel which he commanded our fathers to make known to their children the language of connection and joining with all generations that would come after him to assist all who come to purify and stand to serve before him blessed be his name. As it is written in the Gemara whoever establishes a fixed place for prayer the God of Abraham helps him. He can draw upon himself the holiness and service of Abraham our father peace be upon him. The God of Abraham meaning the divinity that Abraham drew into the world for he was the first to recognize the Creator blessed be he and he stands to help us. And this is what is said each day the help of our fathers you have been forever etc happy is the man who listens to your commandments etc. The meaning is that the main help is from our holy fathers Abraham but happy is the man who listens to your commandments while still alive to awaken through his service the help of the fathers as it is written the ark carried its carriers. And this applies every day when standing in prayer as written in the holy Zohar in the introduction page 11a and these are the words: And in the morning when rising from bed one must bless his Master and enter his house and bow before his sanctuary with great awe and afterward pray his prayer and take counsel from those holy fathers as it is written and I through your great kindness enter your house etc thus they established that a person should not enter the synagogue unless he first consults with Abraham Isaac and Jacob. And this is what is said in Hodu which he cut with Abraham and his oath to Isaac and established it for Jacob etc.",
            "average_score": 9.0,
            "reference": "Tiferet Shlomo, on Torah, Toldot 4"
        },
        {
            "section": "Torah",
            "topic": "Toldot",
            "number": "1",
            "passage": "אלה תולדות יצחק בן אברהם אברהם הוליד את יצחק. הנ\\\"ל דהנה כתיב אלה תולדות השמים והארץ בהברא\\\"ם באברהם. והנה שמים וארץ הם בבחי' דכר ונוקבא. ואמר הכתוב כי כל תולדות זו\\\"נ ויחודם וזיווגם תחלה היה רק באברהם הוא היחוד דאזיל עם כולהו יומין. ולכך גם אח\\\"כ כל יחודי העולמות וקיומם ומה שמתחדשים בכל יום תמיד הוא רק באברהם. ובזכותו הוא מקיים כל העולמות מאז ועד עולם. והנה כשנסתלק א\\\"א ע\\\"ה והשאיר את יצחק בנו לבדו בעולם. היה הוא ירא מי יקיים העולמות ויעשה יחודים מעתה עוד כאשר ידע כי כל קיום העולמות רק באברהם ומי כמוהו הלא כל העולם אך חסד יבנה בבחי' חסד יבנה ויעשה היחוד. לכן הנה יצחק תיקן ברכת מחיה מתים להחיות זכותו של א\\\"א ע\\\"ה גם אח\\\"כ להתקיים כל העולמות בשבילו. וכל ימיו של יצחק אך בזה היה מכוון ומתהלך להיות כל היחודים בזכותו וכחו של אברהם נעשים כנ\\\"ל. וזש\\\"א אלה תולדות יצחק בן אברהם. פי' הנה תולדות יצחק. מה שהוליד והמשיך חיות להעולמות כולם היה הוא מכוון רק להיותו בן אברהם. ולכך נחמו הקב\\\"ה אח\\\"כ גם כן אל תירא כי אע\\\"פ שמת אברהם הנה זכותו וכחו קיים לעד כל ימי עולם עקב אשר שמע אברהם בקולי ולעולם יקרא זרע אברהם עבדי. וז\\\"ש אח\\\"כ אברהם הוליד את יצחק כי באמת כן היה כי בחי' אברהם פעל הלידה ביצחק כי ביצחק יקרא לך זרע. מה שהוליד יצחק הנה יקרא לך זרע ההוא. ואברהם הוליד את יצחק גם אחר שנסתלק הנה אך בזכות אברהם נעשה הכל כל ימי עולם. וזה תחיית המתים מן התורה. מכלכל חיים בחסד מחיה מתים כו' פי' מה שמכלכל חיים בחסד בחי' אברהם. אע\\\"פ שנסתלק כו'. כי הנה מחיה מתים ברחמים רבים ר\\\"ל מחיה בכל עת בחי' חסד אברהם גם אחרי שמת ונסתלק מעוה\\\"ז. ובזה סומך נופלים ורופא חולים מצמיח ישועה:",
            "english_translation": "These are the generations of Isaac son of Abraham, Abraham begot Isaac. The aforementioned, behold it is written these are the generations of heaven and earth when they were created, through Abraham. And behold heaven and earth are in the aspect of male and female. And scripture says that all generations of male and female and their unification and coupling first was only through Abraham, which is the unification that goes with all days. And therefore also afterward all unifications of the worlds and their existence and what is renewed every day always is only through Abraham. And through his merit he sustains all worlds from then until forever. And behold when Abraham our father peace be upon him passed away and left Isaac his son alone in the world, he was afraid who would sustain the worlds and make unifications from now on as he knew that all existence of worlds is only through Abraham and who is like him for the whole world is built with kindness in the aspect of kindness will build and make the unification. Therefore behold Isaac established the blessing of reviving the dead to revive the merit of Abraham our father peace be upon him even afterward to sustain all worlds for his sake. And all Isaac's days were only focused and directed on having all unifications done through Abraham's merit and power as mentioned. And this is what it means these are the generations of Isaac son of Abraham, meaning behold Isaac's generations, what he generated and drew forth life to all the worlds was only intended through his being son of Abraham. And therefore the Holy One Blessed be He comforted him afterward also do not fear for even though Abraham died behold his merit and power endures forever all days of the world because Abraham listened to My voice and forever his seed will be called Abraham My servant. And this is what it says afterward Abraham begot Isaac for truly so it was for the aspect of Abraham effected the birth in Isaac for in Isaac will your seed be called, what Isaac begot behold that seed will be called yours. And Abraham begot Isaac even after he passed away behold only through Abraham's merit everything was done all days of the world. And this is resurrection of the dead from the Torah, sustaining the living with kindness reviving the dead etc meaning that what sustains the living with kindness the aspect of Abraham, even though he passed away etc. For behold He revives the dead with great mercy meaning He revives at all times the aspect of Abraham's kindness even after he died and departed from this world. And through this He supports the fallen and heals the sick and makes salvation flourish.",
            "average_score": 9.0,
            "reference": "Tiferet Shlomo, on Torah, Toldot 1"
        },
        {
            "section": "Festivals",
            "topic": "Introduction",
            "number": "4",
            "passage": "וז\\\"פ הפ' והיתה נפש אדוני צרורה בצרור החיים כו'. דהנה כבר נתבאר בזוהר הקדוש סוד השארת הנפש של הצדיקים בעולם הזה ורוחם ונשמתם עולה למעלה וזהו לטובת החיים בעולם הזה כדי שיהיה להם התקשרות מה עם החיים בעולם הזה לדעת כל אשר יעשון ולהרגיש בצערם ולהתפלל עליהם כי עיקר קיום החיים בעולם הזה הוא רק ע\\\"י הזכות והתפלות של אבותינו הראשונים והקדושים אשר מעולם שהם מקושרים עם ישראל בכל מקומות מושבותם וכשישראל הם בטובה האבות שמחים עמהם כמבו' ברש\\\"י ויוציאך בפניו בפני האבות. ובזוהר הקדוש וירא ישראל ישראל סבא וכן כתיב יגל יעקב ישמח ישראל. וכדאי' במד\\\"ר שאמר הקב\\\"ה למשה לך ובשר להאבות שאני מנחיל לישראל את הארץ. וז\\\"פ מכלכל חיים בחסד מחיה מתים. פי' כאשר הש\\\"י ב\\\"ה מכלכל החיים בזה מחיה מתים שיש להם נחת רוח וחיות ע\\\"י הטובה שבאה לישראל וכן ע\\\"י שסומך נופלים ורופא חולים ומתיר אסורים בזה מקיים אמונתו לישיני עפר ששמחים באמונתם כי נתקבלה תפלתם. וז\\\"פ מלך ממית ומחיה ומצמיח ישועה אע\\\"פ שממית מ\\\"מ מחיה אותם ע\\\"י שמצמיח ישועה להחיים. אמנם עוד יש דרך וענין אחר כמו שמבואר למעלה כי השארת הנפש בין החיים הוא להתדבק עמהם להורותם וללמדם שהם מתעוררים בסוד היחוד נר\\\"נ והם שבים ובאים להתלמידים אחריהם לגלות להם סודות ורזין דאורייתא מעולמות העליונים כנ\\\"ל וז\\\"פ והיתה נפש אדוני צרורה בצרור החיים בעולם הזה בין החיים כנ\\\"ל. וזה הענין דאמרינן בכתובות פרק הנושא דף ק\\\"ג אצל פטירת רבינו הקדוש שאמרו כל מאן דאמר נח נפשיה דרבי ידקר בחרב. והוא קשה להבין מה בכך אם לא יאמר סוף הדבר להתגלות. אכן כדברינו ניחא כי אמנם כבר נודע כי הצדיקים אין להם מנוחה גם בעה\\\"ב כי תמיד הם שבים ללכת לבא אל התלמידים אשר בעולם הזה ללמדם דרכי השם וכאשר באמת נראה הדבר אצל רבי כי כל בי שמשי הוה אתי לביתי' מעולם העליון ולכך כל מאן דאמר נח נפשי' דרבי ר\\\"ל שהוא במנוחתו בעוה\\\"ב הנה זהו מורה על פחיתת מדריגתו כי לא בא לעולם הזה כנ\\\"ל לכן ידקר כו'. וזהו ג\\\"כ הענין בגמ' ברכות דף מ\\\"ג כי נח נפשיה דרב אזלו תלמידיו בתריה כי הדרו יתבי וקאכלי קא מבעי' להו הסבו מאי כו' לא הוה בידיהו קם ר' אדא בר אהבה אהדר קרעי' לאחורי' וקרע קריעה אחרת אמר נח נפשי' דרב וברכת מזונא לא גמרינן. ויש להבין למה קרע קריעה אחרת הזאת. אך הכוונה כנ\\\"ל כי בתחילה כאשר נסתלק רב מהם סברו כי עוד ישוב אליהם להורותם כנ\\\"ל אך כאשר ראו כי לא ידעו ההלכה הבינו כי נח נפשי' דרב ר\\\"ל בא אל מקום מנוחתו כבוד ולא ישוב אליהם כי נעלמה ההלכה מהם ואינו מזכירם לכך אז קרע קריעה אחרת כי בשעה הזאת נצטערו עד מאד אשר לא הגיעו למדריגה הזאת שיבא אליהם רבם הגדול כנ\\\"ל:",
            "english_translation": "And this is the explanation of the verse \"May my master's soul be bound in the bundle of life.\" For it has already been explained in the holy Zohar the secret of the remaining of the righteous ones' soul in this world while their spirit and higher soul ascend above, and this is for the benefit of the living in this world so they may have some connection with the living in this world to know all that they do and feel their pain and pray for them, for the main existence of life in this world is only through the merit and prayers of our first fathers and the holy ones who from ancient times are connected with Israel in all their dwelling places, and when Israel is well the fathers rejoice with them as explained in Rashi \"and He brought you out before Him\" before the fathers, and in the holy Zohar \"Israel saw\" refers to elder Israel, and so it is written \"Jacob will rejoice, Israel will be glad, \" and as it says in Midrash Rabbah that the Holy One Blessed be He said to Moses go and inform the fathers that I am giving the land to Israel as inheritance.",
            "average_score": 9.0,
            "reference": "Tiferet Shlomo, on Festivals, Introduction 4"
        },
        {
            "section": "Torah",
            "topic": "Toldot",
            "number": "15",
            "passage": "וירא אליו ה' בלילה ההוא ויאמר אנכי אלהי אברהם אביך אל תירא כי אתך אנכי וברכתיך כו' בעבור אברהם עבדי. הנראה לבאר עפ\\\"י מ\\\"ש בענין ג' ברכות הראשונות מגן אברהם הוא כנגד א\\\"א. מחיה מתים נגד יצחק. אתה קדוש נגד יעקב אבינו ע\\\"ה. והנה בברכה השניה יש בו ערבובי דברים פעם אחת מדבר נגד החיים ופעם נגד המתים מכלכל חיים כו' מחיה מתים. ומקיים אמונתו לישיני עפר. ומסיים מחיה מתים. הענין כאשר בארנו במ\\\"א במעלת הצדיקים אשר גם אחר סילוקם מעול' הזה נשאר רושם הקדושה בעוה\\\"ז להגן עלינו ומפיהם אנו חיים כמ\\\"ש בא\\\"א ויגוע ויאסף אל עמיו. וזה שאמרו כל המכבד את התורה גופו מכובד על הבריות להשפיע טובות וברכות לבריות אשר חיים עודנה כמ\\\"ש בכיבוד אב מאכילהו ומשקהו. וזש\\\"א וגנותי על העיר הזאת להושיעה למעני ולמען דוד עבדי. וז\\\"ש בזוה\\\"ק דומה דודי לצבי. מה הצבי מחזיר ראשו לאחוריו. פי הצדיקים בגן עדן עודם עיניהם פקוחות להשפיע כ\\\"ט לעוה\\\"ז. וז\\\"ש לו הש\\\"י אל תירא כו' בעבור אברהם עבדי. כי כל ההשפעות עודם יורדים בזכות אברהם. ולזה פתח ואמר בברכת מחיה מתים. כי הענין הזה התחיל בראשונה אצל יצחק שהיה לו עזר וסעד מאביו. הראשון היה א\\\"א ע\\\"ה בדבר זה:",
            "english_translation": "And the Lord appeared to him that night and said I am the God of Abraham your father fear not for I am with you and I will bless you for the sake of Abraham my servant. It appears to explain according to what is written regarding the three first blessings Shield of Abraham corresponds to Abraham our father. Reviver of the dead corresponds to Isaac. You are holy corresponds to Jacob our father peace be upon him. And in the second blessing there is a mixture of matters sometimes speaking of the living and sometimes of the dead sustaining the living reviving the dead and keeping faith with those who sleep in the dust and concluding with reviving the dead. The matter as we explained elsewhere regarding the virtue of the righteous that even after their departure from this world their holy impression remains in this world to protect us and from their mouths we live as it is written about Abraham our father that he expired and was gathered to his people. And this is what they said whoever honors the Torah his body is honored by the creatures to bestow goodness and blessings upon creatures who are still alive as it is written regarding honoring father feeding him and giving him drink. And this is what is said I will protect this city to save it for my sake and for the sake of David my servant. And this is what is said in the holy Zohar my beloved is like a gazelle just as a gazelle turns its head backward so the righteous in paradise still have their eyes open to bestow all good upon this world. And this is what God said to him fear not for the sake of Abraham my servant for all influences still descend in the merit of Abraham. And therefore he opened and said in the blessing of reviving the dead for this matter first began with Isaac who had help and support from his father. The first was Abraham our father peace be upon him in this matter.",
            "average_score": 9.0,
            "reference": "Tiferet Shlomo, on Torah, Toldot 15"
        },
        {
            "section": "Torah",
            "topic": "Eikev",
            "number": "5",
            "passage": "(מכי\\\"ק)א\\\"י והי' עקב תשמעון כו' אשר נשבע לאבותיך. הנ\\\"ל דהנה כתיב מכלכל חיים בחסד מחיה מתים ברחמים רבים. והוא ע\\\"ד המבואר בזוה\\\"ק שלולי תפלת האבות והמתים שהם מתפללים על החיים לא הי' העולם קיים. וכן ידוע שע\\\"י הצדיקים החיים בעוה\\\"ז שמתפללים על העולם הם מקיימין את העולם וזה הפי' שיתף עמו מדה\\\"ר היינו תפלת הצדיקים שני אלפים שנה הי' העולם קיים בשביל אברהם אבינו שיהי' בעולם כמ\\\"ש קבל שכר כנגד כולם. וז\\\"ש אשר עשה אתך את הגדולות והנוראות האלה פי' אתך רק על ידך עשה כל זאת וכן אשר אני עושה עמך על ידך ועמך בשיתוף אני עושה הכל כי הכל עבור הצדיקים ברוך מרחם על הבריות ברוך משלם שכר טוב ליראיו. פי' החסד שעושה הקב\\\"ה עם העולם ומרחם על הבריות הנה הוא תולה הכל ביראיו כדי לשלם להם שכר טוב שהם מקיימין את העולם כנ\\\"ל. וכן המתים ששוב אינם עושים מצות ובמה יתרבה להם שכר טוב בעוה\\\"ב. הוא בעבור שהם מקיימין את העולם לאחר מותם. וזה הפי' מכלכל חיים בחסד היינו החסדים שבאים לעולם תולה אותם בצדיקים החיים ונותן להם שכר. מחי' מתים ברחמים רבים. פי' וגם המתים מחי'אותם ומשפיע להם שכר טוב ברחמים רבים היינו ברחמים רבים הבאים לעוה\\\"ז עבורם בזה מחיה המתים לעוה\\\"ב וכמו שמצינו במשרע\\\"ה זכור לעבדיך לאברהם ליצחק וליעקב ונתרצה הקב\\\"ה בזכותם. ובזה נתרבה שכרם לעוה\\\"ב. וזהו המתים להחיות פי' להחיות העולם ובזה מקיים אמונתו לישיני עפר. וזהו הברכה מחיה המתים בעבור שהם מתפללים על החיים. וז\\\"ש בחייהם ובמותם לא נפרדו לעשות רצון קונם. פי' שבחייהם ובמותם לא נפרדו מלהתפלל על העולם וזהו הוא רצון קונם. וזהו הפי' והי' עקב תשמעון כו' ושמר ה' אלהיך לך את הברית. פי' ישמר לך לטובה ולברית שלום את החסד שעושה וגם אשר נשבע לאבותיך גם להם יהי' שכר טוב בעוה\\\"ב עבור זה שמתפללים כל הימים עליכם לטובה:",
            "english_translation": "And it will be if you listen etc. that which He swore to your fathers. Behold it is written He sustains the living with kindness and revives the dead with great mercy. And it is as explained in the holy Zohar that if not for the prayers of the fathers and the dead who pray for the living, the world would not exist. And it is known that through the righteous who live in this world who pray for the world, they sustain the world and this is the meaning of partnering with Him the attribute of mercy namely the prayers of the righteous two thousand years the world existed for Abraham our father who would be in the world as it is written he received reward against them all. And this is what it means that which He did with you these great and awesome things meaning with you only through you He did all this and so too that which I do with you through you and with you in partnership I do everything for all is for the righteous blessed is He who has mercy on the creatures blessed is He who gives good reward to those who fear Him.",
            "average_score": 9.0,
            "reference": "Tiferet Shlomo, on Torah, Eikev 5"
        },
        {
            "section": "Torah",
            "topic": "Toldot",
            "number": "2",
            "passage": "א\\\"י ואלה תולדות יצחק בן אברהם אברהם הוליד את יצחק. הנ\\\"ל דהנה ברכת מחיה מתים הוא כנגד יצחק כנודע. והענין הוא כי כן כתיב אצל יצחק והקמותי את השבועה אשר נשבעתי לאברהם אביך והרביתי את זרעך כו' והתברכו בזרעך כל גויי הארץ עקב אשר שמע אברהם בקולי כו'. שמהדבור הזה שמע יצחק כמה גדול כחם של הצדיקים שאף אם נסתלקו מעוה\\\"ז והלכו לעולמם הנה הקב\\\"ה זוכר צדקותם כאלו הם חיים בעוה\\\"ז להשפיע כ\\\"ט לבניה' אחריהם כמ\\\"ש ליצחק כי הכל עושה בזכות אברהם עקב אשר שמע אברהם בקולי כי הצדיקים במיתתם קרוים חיים והוא שכתוב אני אמית ואחיה. אף לאחר המיתה אני אחיה אותם בטוב מעשיהם. ולכך תיקן יצחק ע\\\"ז ברכת מחיה מתים. וכמ\\\"ש מכלכל חיים בחסד הוא בזכות שהוא מחיה מתים ברחמים רבים ומקיים אמונתו לישיני עפר ומביא גואל לבני בניהם כי כל זה שמע יצחק מפי הקב\\\"ה בדבור הזה. וזהו עיקר תולדותיהן של צדיקים מעשים טובים. שבכח של מעשיהם הטובים הם משפיעים כ\\\"ט לתולדותיה' להחיותם ולקיימם בעוה\\\"ז. וזהו העיקר לתולדות כנודע. והוא הרמוז בלשון תולדותיהן של צדיקים הם ההשפעות שבא ע\\\"י היחוד למעלה שנעשה ע\\\"י הצדיקים וזהו מעשיהם הטובים טו\\\"ב יסו'ד מלכו\\\"ת. וזהו ואלה תולדות יצחק בן אברהם פי' מה שיצחק היה מוליד ומשפיע חסדים בחי' אברהם ולא הגבורות ח\\\"ו אמר הכתוב כי אברהם הוליד את יצחק כי בחי' ההשפעה של יצחק היא באה מבחי' אברהם והוא הוליד ומוליד חסדים תמיד אל יצחק להשפיע לעוה\\\"ז. והוא שכתוב וזכרתי את בריתי אברהם ואת בריתי יצחק כו' כי ההשפעות של יצחק הם מבחי' אברהם כמ\\\"ש עקב אשר שמע אברהם בקולי כו':",
            "english_translation": "And these are the generations of Isaac son of Abraham, Abraham begot Isaac. Behold, the blessing of reviving the dead corresponds to Isaac as is known. And the matter is that it is written regarding Isaac \"And I will establish the oath which I swore to Abraham your father and I will multiply your seed and all nations of the earth shall be blessed through your seed because Abraham hearkened to My voice.\" From this utterance Isaac heard how great is the power of the righteous that even if they depart from this world and go to their eternal rest, the Holy One Blessed be He remembers their righteousness as if they are alive in this world to bestow all good upon their children after them as was said to Isaac that everything is done in the merit of Abraham because Abraham hearkened to His voice for the righteous are called living even in their death and this is what is written \"I cause death and give life.\" Even after death I give them life through their good deeds. Therefore Isaac established the blessing of reviving the dead regarding this. And as it is written \"He sustains the living with kindness\" it is in the merit that He revives the dead with great mercy and maintains His faithfulness to those who sleep in the dust and brings a redeemer to their children's children for all this Isaac heard from the Holy One Blessed be He in this utterance. And this is the main offspring of the righteous - good deeds, for through the power of their good deeds they bestow all good upon their offspring to give them life and sustain them in this world.",
            "average_score": 9.0,
            "reference": "Tiferet Shlomo, on Torah, Toldot 2"
        },
        {
            "section": "Festivals",
            "topic": "Pesach",
            "number": "59",
            "passage": "מה תצעק אלי דבר אל בני ישראל ויסעו. ויש להבין מה שאמר לו הקב\\\"ה מה תצעק אלי וכי מה הי' יכול משה רבינו עליו השלום לעשות בעת הצרה הזאת רק לצעוק אל ד' כי ראה כי אין מנוס לישראל כי הים לפניהם והמצרים מאחריהם. אכן הנה כתי' וישאו בנ\\\"י את עיניהם והנה מצרים נוסע אחריהם ויצעקו בנ\\\"י אל ד' וכפרש\\\"י תפסו אומנות אבותם באברהם הוא אומר אל המקום אשר עמד שם וביצחק כנ\\\"ל ע\\\"ש. ויש לשום לב לדברי רש\\\"י ז\\\"ל בזה שתפסו אומנות אבותם וכי בלא זה לא יכלו לצעוק אל ד' הלא גם בהיותם במצרים כתי' ויזעקו ותעל שועתם אל האלהים ולמה לא פרש\\\"י שם כי תפסו אומנות אבותם. אמנם הנה כבר נודע כי מאז ברא ד' את העולם ומלואו הנה בחסדו הגדול מסר את כל חוקי ההנהגה וטבעי העולם הזה וכל כחות צבאי השמים ממעל להיותם כולם נשמעים אל הצדיקים אשר בעולם הזה וביד עבדיו הצדיקים לשנות את מנהגם ולעשות מופתים בשמים ובארץ בעת הוצרך אליהם וזהו הוא אחרי כי כל העולם ומלואו נברא בשביל הצדיקים ועליהם הוא מתקיים. לכך הם המושלים בקרב תבל. ולא יעשה ד' אלהים דבר כי אם גלה סודו אל עבדיו הנביאים. והנה מאז הבריאה היו נשמעים אליהם. ומשתנים על פיהם בעת הצורך להם כמבואר בכתוב להמעיין בכל הניסים שנעשו להם בכל עת ובכל שעה. אולם גם אחרי שנסתלקו האבות הנה זה כחם לבניהם אחריהם בכל דור ודור והנה הצדיקים הם המושלים בקרב תבל בכל הנהגת העולם כמבו' זה במד\\\"ר על פסוק ולמשול ביום ובלילה ע\\\"ש והנה בצאת ישראל ממצרים הנה המה היו כולם צדיקים כולם קדושים והיתה כח הממשלה של העולם בידם הנ\\\"ל. וכמו שאמר הכתוב בצאת ישראל ממצרים היתה יהודה לקדשו ישראל ממשלותיו. פי' היתה יהודה לקדשו למסירות נפש כי שורש הקדושה הוא מסירות נפש וכמבו' במד\\\"ר שקפצו תחלה לתוך הים. וזהו ישראל ממשלותיו כמ\\\"ש צדיק מושל ביראת אלהים והיו הם המושלים בקרב תבל כנ\\\"ל. והנה זהו שפרש\\\"י ז\\\"ל שתפסו אומנות אבותם. ר\\\"ל כי פי' אומנות הוא כמו האומן העושה בהכלי כרצונו לפי פעלו ברצותו מרחיב וברצותו מקצר כאשר נראה לו. כן כל הנהגת העולם הי' ביד אומנות אבותינו לפעול בהם כרצונם. הן בדרך טבעי הן לפעול ניסים. ועד\\\"ז אמרו חכז\\\"ל שהתורה היתה כלי אומנות של הקב\\\"ה ר\\\"ל שעל ידי התורה מנהיג את העולם ברצונו. ולכך הנה בצאת ישראל ממצרים באותות ומופתים והוצרכו לילך אל המדבר אל מקום תוהו ומה גם לעבור דרך הים ביבשה. הנה הצדיקים האלה תפסו אומנת הזאת של אבותם בהנהגת העולם על פיהם לעשות להם ניסים ונפלאות בים ובמדבר וע\\\"ז הוא ויצעקו בנ\\\"י אל ד' לכן פרש\\\"י באברהם הוא אומר וכו' וכן ביצחק וכן ביעקב. כי באמת כן מתעורר עמהם כח שלשת האבות בקריעת י\\\"ס כמו שרמוז להמעיין ויהי באשמורת הבקר זה בקר של אברהם ויבקע\\\"ו המים אותיות יעקב בתוכו. וכן הים ראה וינס בכח יוסף וכן כולם ע\\\"ש. והנה כאשר מאז החזיקו בנ\\\"י באומנת אבותם הלא בלי ספק אין להם לירא כלל מפחד מצרים ומהים ולכך הוא שאמר הקב\\\"ה למשה מה תצעק אלי הלא כבר נמסר הכל בידם ואין הים עומד בפניהם דבר אל בנ\\\"י ויסעו כדאי הם לקרוע להם את הים כנ\\\"ל:",
            "english_translation": "Why do you cry out to Me? Speak to the children of Israel and let them journey forward. And one must understand what the Holy One Blessed be He said to him 'Why do you cry out to Me' for what could Moses our teacher peace be upon him do in this time of distress except cry out to God as he saw there was no escape for Israel with the sea before them and the Egyptians behind them. Indeed it is written that the children of Israel lifted their eyes and behold Egypt was traveling after them and the children of Israel cried out to God and as Rashi explains they seized the craft of their fathers as it says of Abraham to the place where he stood there and of Isaac as mentioned above see there. And one must pay attention to Rashi's words about seizing their fathers' craft for without this could they not cry out to God behold even when they were in Egypt it is written they cried out and their plea rose up to God and why did Rashi not explain there that they seized their fathers' craft. Indeed it is already known that since God created the world and its fullness in His great kindness He delivered all the laws of governance and nature of this world and all the powers of the heavenly hosts above to be obedient to the righteous who are in this world and in the hands of His righteous servants to change their course and perform wonders in heaven and earth when needed and this is after all the world and its fullness was created for the righteous and through them it exists.",
            "average_score": 9.0,
            "reference": "Tiferet Shlomo, on Festivals, Pesach 59"
        },
        {
            "section": "Festivals",
            "topic": "Shaar Tefillah",
            "number": "23",
            "passage": "הודו לד' כי טוב כי לעולם חסדו. הנה עיקר ההודאה והשבח הוא בשביל כללות ישראל. כי אם האדם נותן הודאה על עצמו. חוץ דהוא גריעות בנפש שאינו שמח בישועת בנ\\י אך הוא ג\\\"כ גרעון בהודאה עצמה. למשל בשנה זו שהקב\\\"ה נתן מטר על הארץ והארץ נתנה יבולה. אם האדם יתן הודאה על עצמו לבד אין ההודאה גדולה כל כך אך אם האדם נותן הודאה על כל העולם שריחם על נפשות האומללים והרעבים אזי נותן האדם הודאה עצומה. ובפרט מי שיש לו קצת עושר אזי בשביל עצמו אינה נחשבת לו כ\\\"כ הטובה הזאת. אבל אם מסתכל על כל העולם כולו אזי רואה גודל החסד שעשה הקב\\\"ה בשנה זאת. וז\\\"פ הכ' הודו לד' כי טוב כי לעולם חסדו. לא תהללו בשביל עצמיכם רק כל אחד יהלל לד' עבור כל העולם שנעשה עמהם חסד. וז\\\"פ הכ' גם את העולם נתן בלבם. כדי להודות ולהלל להקב\\\"ה על כל הטובות ולהתפלל עליהם. וז\\\"פ הכ' ופדויי ד' ישובון ובאו ציון ברנה ושמחת עולם על ראשם שהשמחה לא תהי' על כל אחד לעצמו רק כ\\\"א יהי' שמח בשמחת חבירו ובשמחת כל העולם. ובזה תגדל השמחה על כל העולם ועל הצדיקים עד מאד. ובזה יהי' ששון ושמחה ישיגו. אך לזה צריך להיות לו טהרת הנשמה והנפש לקיים ואהבת לרעך כמוך. וז\\\"פ בידיד נפש כו' בהראות לה נועם זיווך אז תתחזק ותתרפא והיתה לה שמחת עולם. עיקר הרפואה הוא לאדם אם יש לו שמחת עולם מכלל ישראל לראות בישועתם וגדולתם. וכבר אמרתי לפרש בזה דברי הש\\\"ס גדול העונה אמן יותר מן המברך כו' מה טעם לזה. אך הפי' בזה דמצינו תפלות בלשון יחיד דהיינו ברכת השחר שלא עשני עכו\\\"ם וכן כל הברכות כולם הולכים כל אחד ואחד לעצמו. פוקח עורים מלביש ערומים כמבואר במס' ברכות א\\\"כ אם אדם עונה אמן על ברכת חבירו ונותן הודאה לשמים על שחבירו נברא יהודי ורואה בעינים ויש לו מלבושים ושאר ענינים אזי גדול העונה אמן יותר מן המברך. כי זה מברך על עצמו וזה מברך על חבירו. וזה הי' מעלת יתרו ששמח על הטובה אשר עשה ד' לישראל. ויאמר ברוך ד' אשר הציל אתכם מיד מצרים שהוא לא הי' במצרים בכלל השיעבוד ונתן הודאה על ישראל. וזה כוונת המד\\\"ר שזהו הי' גנאי לישראל שלא ברכו להקב\\\"ה עד שבא יתרו ונתן הודאה. והרי ישראל אמרו שירה מקודם. אך הם נתנו הודאה על עצמם וזה אין כל כך חשיבות. אבל יתרו נתן הודאה על אחרים והוא דבר גדול ודו\\\"ק. וז\\\"פ רבים אומרים לנפשי מי יראנו טוב נסה עלינו אור פניך כו' היינו שהם מבקשים עבור עצמם. אבל אני איני כן. נתת שמחה בלבי מעת דגנם ותירושם רבו. וז\\\"פ צדקתך לא כסיתי בתוך לבי היינו בעת שהתפללתי והי' עת רצון לא המשכתי את הישועה לעצמי רק נחלק בשוה עם כל העולם. וזהו לא כחדתי חסדך ואמתך לקהל רב ובזה אתה ד' לא תכלא רחמיך ממני. היינו כל המבקש על חבירו והוא צריך לאותו דבר הוא נענה תחלה דהיינו אם אחד יש לו פרנסה ממסחר התבואה ומתפלל על הגשמים ובשעת הזול אין לו פרנסה. וז\\\"פ והוא צריך לאותו הדבר שיהי' ח\\\"ו יוקר. אז הוא נענה תחלה. כי לא על הלחם לבדו יחי' האדם כו'. וז\\\"פ בגמ' תבוא מארה למי שאשתו ובניו מברכים לו. למה דוקא ברכת המזון. אך הפי' שהוא נותן הודאה רק על מה שאשתו ובניו יש להם פרנסתם. רק ההודאה צריך להיות על כלל העולם. וז\\\"פ הגמ' אצל בועז דכתי' וייטב לבו שהי' מברך ברכת המזון. פי' בשעה שהי' בגורן וראה הברכה בתבואות הי' מברך להקב\\\"ה על הכלל ישראל. וז\\\"פ כי פקד ד' את עמו לתת להם לחם. להם דייקא. משום הכי כתי' כי שמעה. הא כולם שמעו. אלא פי' שמעה לשון שמחה מכלל ישראל ולא השגיחה על עצמה כלל. וז\\\"ש בישעי' ס\\\"ג חסדי ד' אזכיר כעל כל אשר גמלנו ד' ורב טוב לבית ישראל אשר גמלם כרחמיו וכרוב חסדיו ודו\\\"ק. וז\\\"פ הפ' כהניה בעיר גוועו כי בקשו אוכל למו וישיבו את נפשם היינו שהפרנסה אשר בקשו לא הי' רק עבור עצמם. וכן תשובה עבור עצמם. לפי שגם התשובה וכפרת עוונות צריך האדם להתפלל עבור כלל ישראל. וז\\\"פ על זאת יתפלל כל חסיד אליך לעת מצוא רק לשטף מים רבים אליו לא יגיעו. מים הם החסדים. והוא מתפלל רק עבור כלל ישראל לטובתם. אפי' אם הוא אינו נהנה כלל מן החסדים. וזה כל העולם ניזון בשביל חנינא בני כו'. וזהו נפתלי אילה שלוחה הנותן אמרי שפר. אילה היא החסידה שבחיות. והתפלה הזאת בוקעת כל הרקיעים. וז\\\"ש אם שגורה תפלתי בפי. היינו שהוא מתפלל עבור הכלל. התפלה זאת מקובלת ברצון. וז\\\"ש בש\\\"ס אין הקב\\\"ה מואס בתפלתם של רבים שנאמר הן אל כביר לא ימאס. ואמאי אין נשמע עדיין. אך הפי' אם כל אחד מתפלל על חבירו וצרכי רבים אזי תפלתו נשמעת. ובזה י\\\"ל העוסק בתורה ובגמ\\\"ח ומתפלל עם הצבור מעלה אני עליו כאלו פדאני לי ולבני מן הגלות. ג\\\"כ הפי' כן בכל מה שעוסק בתורה הוא עושה עם הצבור דהתורה מגינה ומציל כוונתו בלימודו שכל הצבור יהיו ניצולים מעבירות שבידם. ובגמילות חסדים כוונתו עם הצבור שהשכר של גמ\\\"ח יהי' ג\\\"כ עם הצבור. וכן מתפלל עם הצבור לטובת כלל ישראל",
            "english_translation": "Give thanks to the Lord for He is good, for His kindness endures forever. The main thanksgiving and praise is for the entirety of Israel. For if a person gives thanks only for himself, besides being a deficiency in the soul for not rejoicing in the salvation of others, it is also a deficiency in the thanksgiving itself. For example, in this year when the Holy One Blessed be He gave rain upon the earth and the earth yielded its produce, if a person gives thanks only for himself the thanksgiving is not so great, but if a person gives thanks for the whole world that He had mercy on the souls of the wretched and hungry, then the person gives tremendous thanks. And especially one who has some wealth, for himself this goodness is not considered so significant. But if he looks at the whole world, then he sees the greatness of the kindness that the Holy One Blessed be He did this year. And this explains the verse \"Give thanks to the Lord for He is good, for His kindness endures forever\" - do not praise for yourselves alone, rather each one should praise the Lord for the whole world with whom kindness was done. And this explains the verse \"Also the world He placed in their hearts\" - in order to give thanks and praise to the Holy One Blessed be He for all the good and to pray for them. And this explains the verse \"And the redeemed of the Lord shall return and come to Zion with song and eternal joy upon their heads\" - that the joy will not be for each one alone, rather each one will rejoice in his fellow's joy and in the joy of the whole world. And through this the joy will greatly increase for the whole world and for the righteous. And through this \"they will achieve gladness and joy.\" But for this one needs purity of soul and spirit to fulfill \"love your neighbor as yourself.\"",
            "average_score": 9.0,
            "reference": "Tiferet Shlomo, on Festivals, Shaar Tefillah 23"
        },
        {
            "section": "Torah",
            "topic": "Lech Lecha",
            "number": "16",
            "passage": "דורשי ה' זרע אברהם אוהבו. הנ\\\"ל דהנה כל עיקר הכח של העבדות בנ\\\"י במצות ומעש\\\"ט באה להם מן האבות הקדושים אשר הם בעבודתם הגדולה ישרו לנו בערבה מסלה לאלהינו וע\\\"י קדושתם הנחילו לבניהם אחריהם קדושה לעתיד להיותם עובדים הש\\\"י באהבה ויראה באמת ותמים. ולולי הם לא היינו יכולים לעשות דבר ולא זכינו לכל הגדולה והמעלה של התורה הזאת. והוא שאמה\\\"כ רק באבותיך חשק ה' לאהבה אותם ויבחר בזרעם אחריהם בכם מכל העמים. ר\\\"ל כי גם ענין הבחירה הזאת אשר בחר בנו מכל העמים ונתן לנו את תורתו גם היא מורשה לנו מכח אהבת אבותינו הקדושים ורק בזכותם בחר בנו מכל העמים ועל ידיהם נתן לנו התורה הזאת. וכן הוא אומר ותחת כי אהב את אבותיך ויבחר בזרעו אחריו. ולכך אנו מבקשים וזכר לנו ה' אלהינו אהבת הקדמונים פי' להשפיע לנו אהבת הקדמונים אשר הטביעו בנו לאהוב את ה' ית\\\"ש למען נשלים כוונתינו אליו. וז\\\"ש ה' אלהי ישראל אהבת תמים ה' אלהי ישראל תשועת עולמים \\\"ה' אלה\\\"י ישרא\\\"ל גימט' תרי\\\"ג ר\\\"ל כל התרי\\\"ג מצות הם באו לנו ע\\\"י אהבת תמים פי' אהבת א\\\"א שנאמר בו התהלך לפני והיה תמים וע\\\"י כן הוא תשועת עולמים. הנה כי כן מהראוי לנו להחזיק טובה לאבותינו הקדושים שאלמלא הם לא היינו נחשבים כלל לכן בכל הברכות אנו אומרים אלהינו ואלהי אבותינו ר\\\"ל מה שהוא עתה אלהינו הוא ע\\\"י שהיה אלהי אבותינו תחלה. וזה האמור כאן דורשי ה' זרע אברהם אוהבו. ר\\\"ל אלה דורשי ה' הם באים רק מכח כי הם זרע אברהם אוהבו והוא אשר הנחיל אהבתו להם כל הימים כמ\\\"ש כי ידעתיו למען אשר יצוה את בניו ואת ביתו אחריו ושמרו דרך ה' כו':",
            "english_translation": "Those who seek the Lord are the seed of Abraham His beloved. Indeed, the entire power of the service of the Children of Israel in commandments and good deeds comes to them from the holy forefathers who through their great service paved for us in the wilderness a highway for our God and through their holiness bequeathed to their children after them holiness for the future to be servants of God with love and fear in truth and perfection. And without them we could not do anything and would not have merited all the greatness and virtue of this Torah. And this is what the verse says: Only in your fathers did God delight to love them and He chose their seed after them, you from all peoples. Meaning that even this matter of choosing us from all peoples and giving us His Torah is also our inheritance from the power of love of our holy fathers and only in their merit did He choose us from all peoples and through them gave us this Torah. And so it says: And because He loved your fathers He chose his seed after him. Therefore we request 'Remember for us Lord our God the love of the ancients' meaning to bestow upon us the love of the ancients which they instilled in us to love God blessed be He so that we may fulfill our intention to Him. And this is what is said 'Lord God of Israel love of the perfect one Lord God of Israel eternal salvation' 'Lord God of Israel' equals 613 meaning all 613 commandments came to us through love of the perfect one meaning the love of Abraham our father about whom it was said 'Walk before me and be perfect' and through this it is eternal salvation. Thus it is proper for us to be grateful to our holy fathers for if not for them we would not be considered at all therefore in all blessings we say 'Our God and God of our fathers' meaning that He is now our God through having first been the God of our fathers. And this is what is said here 'Those who seek the Lord are the seed of Abraham His beloved' meaning these seekers of the Lord come only from the power of being the seed of Abraham His beloved and he is the one who bequeathed his love to them for all days as it is written 'For I have known him to the end that he may command his children and his household after him that they may keep the way of the Lord.'",
            "average_score": 8.5,
            "reference": "Tiferet Shlomo, on Torah, Lech Lecha 16"
        },
        {
            "section": "Torah",
            "topic": "Noach",
            "number": "12",
            "passage": "ויבא נח ואשתו וכו'. ופרש\\\"י אף נח מקטני אמנה היה כו'. לכאורה יפלא לומר כן כאשר מ\\\"מ דבר ה' עמו פעם בפעם ואיך יהיה מקטני אמנה. אך הנה נודע כי שגגה גדולה היתה לו שלא התפלל על הדור אולי הועיל להציל אותם משחת והחסרון היה לו שהיה בדעתו שהוא קטן בעיני הש\\\"י ולא עלה על לבו שיהיה הקב\\\"ה חפץ בתפלתו ולא האמין זאת שהש\\\"י ישמע אליו ויעתר לו אחרי שכבר נגזרה הגזירה. אבל חשב בלבבו שזה יהיה נגד רצון הש\\\"י לבטל גזירתו. והאמת הוא להיפך כי זה חפץ ה' וזהו רצונו שיהיה הצדיק מבטל כל הגזירות וכמו שעמד א\\\"א ע\\\"ה ואמר חלילה לך מעשות כדבר הזה. וכן משה רבינו אמר למה יאמרו מצרים. וכן הוא המדה מתחלת בריאת העולם כמאמרם ז\\\"ל בתתלה עלה במחשבה לבראו במדה\\\"ד וכו' ושתפו מדה\\\"ר למה\\\"ד. הכוונה בזה ע\\\"ד שאמרו כי הצדיק נקרא שותף במע\\\"ב כמו הדן דין אמת לאמיתו כאלו נעשה שותף וכיוצא בזה. והטעם הוא כי הצדיקים מקיימין את העולם כי הם מעוררים רחמים וחסדים תמיד ולבטל כל הגזירות קשות ובזה הוא שותף במע\\\"ב. וזה היה כוונת הבריאה מתחלה כאשר בכל מע\\\"ב לא נזכר רק שם אלהים רק אחר שנאמר בהברא\\\"ם אותיות באברהם מיד נאמר ביום עשות ה' אלהים מדה\\\"ר עמו כי כן על הצדיקים שם הוי' על פניהם תמיד כמ\\\"ש וראו כל בשר יחדיו כי ה' נק' עליך. וז\\\"ש שתפו מדה\\\"ר הם הצדיקים העומדים בפרץ להשיב חמתו מהשחית העולם. וז\\\"פ נח מקטני אמנה היה ולא האמין בעצמו כי יועיל בתפלתו. ובמד\\\"ר איתא נח מחוסר אמנה היה כי אמונה שלימה הוא אמן ו\\\"ה יחוד הוי' אדנ\\\"י ו\\\"ה מראש ועד סוף כי וא\\\"ו רומז לצדיק כמו יעקב ויוסף תרין ווין בווין תתקטר וכן הוא אומר באברהם והאמין בה' ויחשבה לו צדקה והאמין אמן ו\\\"ה הוא אמונה שלימה אבל נח היה מחוסר אמנה חסר וא\\\"ו מן האמונה. לכן כתיב את האלהים התהלך נח עמו יחד כמובן. אבל באברהם כתיב התהלך לפני להיות בבחי' ותגזר אומר ויקם. והבן:",
            "english_translation": "And Noah came and his wife and God spoke with him time after time and how could he be of little faith but it is known that it was a great error that he did not pray for the generation perhaps to help save them from destruction and the deficiency was that he thought he was small in God's eyes and it did not occur to him that the Holy One would desire his prayer and he did not believe that God would listen to him and answer him after the decree had already been made but he thought in his heart that this would be against God's will to cancel his decree and the truth is the opposite because this is God's desire and this is his will that the righteous should cancel all decrees and as Abraham stood and said far be it from you to do such a thing and so Moses said why should Egypt say and so is the measure from the beginning of creation as they said at first it arose in thought to create it with the attribute of justice and they partnered the attribute of mercy with justice.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Torah, Noach 12"
        },
        {
            "section": "Festivals",
            "topic": "Shaar Keriat Shema",
            "number": "11",
            "passage": "והיו הדברים האלה כו' על לבבך ושננתם לבניך ודברת בם וקשרתם לאות על ידך וכו' וכתבתם על מזוזות ביתך ובשעריך. הנה כאשר נשים לב להתבונן על סדר ענין הפרשה הזאת. הנה מנה הכתוב בזה סדר קיום המצות על ארבעה פנים. א' לקיים הדברים בלב. ב' לקיימם בדבור בפה. ג' לקשרם עליו בבחי' לבוש של תפילין. ד' לכתבם על מזוזות הבית משכן לו. הנראה לרמז בזה עפ\\\"י המבואר בע\\\"ח כי אצילות הנאצל הזה של האדם בכללו עם כל הצריך לקיומו הוא בציור דוגמת ד' בחי' אורות העליונים ובמצב ד' בחי' עולמות אבי\\\"ע שהם ד' אותיות הוי' ב\\\"ה. כי כן הפנימיות של האדם יש בו ד' בחי' נר\\\"נ ונשמה לנשמה. והאדם עצמו יש בו ד' בחינות. א' הנשמה אשר באפו. ב' הוא הגוף על הנשמה. ג' הלבושים על הגוף. ד' הבית שיושב בו היכל לכולם ע\\\"ש והבן. ועתה כאשר תבנית האדם בתחתונים הוא על מצב ארבע בחינות העליונים. הנה לכך גם התורה והמצות שהם עיקר החיות והקיום של האדם והן הנה אורות העליוני' היוצאות מפי הש\\\"י ב\\\"ה. ג\\\"כ ארבע פנים להנה. כדי להחיות ד' בחי' האדם. כמוהם על ארבעת רבעיהם ילכו. והנה זהו הוא סדר ד' בחי' של קיום המצות שבפרשה הזאת. כאשר יקבל עליו עול מלכות שמים בהיחוד של שמע ואהבת הנה נאמר תחלה והיו הדברים האלה על לבבך. כי הלב היא עיקר החיות של האדם בגשמי ודוגמתו ברוחניות הוא ראשית כל פועל או מעשה אשר יעשה האדם והלב הוא תחלת כל מחשבה או התעוררות לאהבה או ליראה ושם משכן כל רצונות טובות של האדם. אך משם יפרד והיה לארבעה ראשים. יש מהן מצות התלויות בלב שגם תכלית קיומם ועבודתם הוא נשאר רק בהלב כמו מצות אהבה ויראה הפנימית ומצות קבלת היחוד של שמע וכדומה. ויש מצות אשר יוצאות מן הלב להתגלות מעט על תנועת האיברים כמו מצות תלמוד תורה של ודברת בם וכדומה שהם מפעלות הגוף. ויש מצות אשר יוצאות להתגלות יותר על האדם ללבוש בהם כמו מצות וקשרתם לאות על ידך ומצות ציצית וכדומה. ויש מצות אשר יוצאות להתגלות יותר נגלה בקיומם כמו וכתבתם על מזוזות ביתך ובשעריך. והוא הדבר אשר דברנו כי קיום המצות בתחתונים הם מיוסדים על ארבעה פנים של האורות העליונים שהם עיקר החיות וקיום של האדם כנ\\\"ל. אמנם עוד צריך לדעת כי אף אם כל המצות הם יוצאים מן מחשבת הלב לפועל הנה גם אחרי צאתם עוד רושם הקדושה של התעוררות המצוה לעשותה נשאר תמיד במקורו בהלב ששם הוא אור היוצא בתחלה ממנו אל האיברים להתגלות הפעולה. ובכן כל ענין המצוה אשר יעשה האדם בגופו ותנועת אבריו בפועל. או גם במקום אשר יבחר האדם לעשות בו איזה מצוה. הנה תמיד יהי' נשאר רושם הקדושה של המצוה שעשה על אבר שעשה בו המצוה ועל המקום הנעשה בו כי בעשיית המצוה נעשה האבר הפועל והמקום הנפעל בו מרכבה להקדושה ולא תסור ממנה לעולם. הלא כבר אמרו חכז\\\"ל בגמ' בענין עבירות עוונותיו חקוקים על עצמותיו וקורות ביתו מעידים עליו וכדומה. עאכ\\\"ו במדה טובה שהיא מרובה וכמבואר זה ליודעים. וכן הוא מפורש בזוהר הקדוש פ' פנחס (דף ר\\\"כ ע\\\"א) וז\\\"ל. דתנינן דכל אתר דצדיקיא אתחדש בי' מילי דאוריי' כד איהי בהאי עלמא פקיד להאי אתר ואתי לי' לגבייהו וכש\\\"כ כד שריאן בגוויה צדיקיא אחרינן לחדתא בההוא אתר דאמרין מילא דאורייתא וכו' ע\\\"ש. וכן בקדושת אבר העושה מצוה כבר נודע כי הוא כלי שרת קודש לד'. אך בהלב שם משכן מקור הקדושה של כל האיברים כי כל המצות יוצאות ממחשבת הלב וממנו תוצאות חיים לכולם כי הכוונה היא נשמה אל המעשה ואחר כוונת הלב מן הדברים. נמצא כי בלב הוא התחלת כל המצות אף של מצות מעשיות והלב עם כל המצות תמיד נשמה להחיותם כנ\\\"ל. הנה לכך אמרו חכז\\\"ל דברים היוצאים מן הלב נכנסים אל הלב כי אחרי כי בלב שם צרורות המצות כולם כאחד הנה בהנשא המצוה האחת ינשאו לעומתם גם האחרים וישלימו ויסייעו להדבור לצאת בקדושה כי כן כל המצות מחוברים כאחד כמו הרמ\\\"ח איברים של האדם. וזהו שנאמר כאן והיו הדברים האלה על לבבך ואח\\\"כ ושננתם לבניך כמ\\\"ש בכל המצות כתבם על לוח לבך ואח\\\"כ ושננתם לבניך ודברת בם כי כן כאשר ילמוד האב לבנו יתכוון להכניס בקרבו את כל מחשבות לבו להבינהו לנכון. וזהו הציווי של ושננתם לבניך אחרי והיו הדברים האלה על לבבך ר\\\"ל ללמוד לבנו הוא תלמידו בקדושה ולהכניס בקרבו דברים היוצאים מן הלב אוצר הקדושה כנ\\\"ל. וזהו שנאמר אלה הדברים אשר דבר משה וכו' ככל אשר צוה ד' אותו אליהם. פי' כי אלה הדברים אשר דבר משה אל ישראל הי' בכל לבו שיצאו הדברים מאוצר הקדושה של לבו של משה רבינו עליו השלום כי אחר כוונת הלב הן הדברים. וזהו ככל אשר צוה ד' אותו אליהם ולא השאיר לעצמו דבר כי זהו הי' שבח רעיא מהימנא שהי' רק כמו צנור המשפיע לישראל. נחזור לענינינו. הנה גם בכל פעולה מעשיות אשר יעשה האדם איזה מצוה בכוונה. הנה נשאר הקדושה במקום הזה לעולם. הנה זה שנאמר מיד בפ' הזאת וקשרתם לאות כי בהמצות הנחת תפילין בכוונת הלב יתעורר עם המצוה הזאת בפעם ההיא כל המצות שעשה מימיו שנשאר רושם קדושתם במקום ההוא מכבר כנ\\\"ל. וזהו ודברת בם בשבתך בביתך ובלכתך בדרך כו'. פי' שיהיו המצות הולכים תמיד עמך בכל מקום וכו'. וזה שאמרו חכז\\\"ל בגמ' וראו כל עמי הארץ כי שם ד' נקרא עליך אלו תפילין שבראש. ר\\\"ל כי ע\\\"י התפילין מתעוררין גם כל המצות עמה שעשה כבר וזה שאנו אומרים ותרי\\\"ג מצות התלוים בה. וזה שאנו אומרי' בכל מצוה אשר קדשנו במצותיו לשון רבים כי ע\\\"י מצוה אחת מעורר עמה מצות רבות שעשה. וזהו מצוה גוררת מצוה. וז\\\"ש נאמנים כל פקודיו סמוכים לעד לעולם עשוים באמת וישר. הנה פי' נאמן הוא הנותן לזולתו. וזהו הפי' הפקודים הם המצות עצמם נאמנים ועומדים עם האדם להתעורר כשיעשה איזה מצוה מחדש יתעוררו עמו לסייעו. וזהו סמוכים לעד לעולם. פי' הם סמוכים מיד להאדם לעוזרו לעתיד לעשות המצות באמת וישר. וזהו את משפטי תעשו ואת חוקותי תשמרו ללכת בהם. פי' ללכת בהם לעשות עוד מצות רבות. וזהו מיד ושמרתם את משפטי כו' כי ע\\\"י ללכת בהם ושמרתם וכו' כי המצות הולכים תמיד עם האדם והם המסייעים לו לעשות עוד. וזהו אם בחקותי תלכו. פי' לעשות עוד מצות עמהם. וזהו וזכרתם את כל מצותי לשון זכרות והשפעה לעתיד לעשות כנ\\\"ל והבן. אולם יש עוד בחי' גבוה' מזו כי הצדיק העושה המצוה לא לבד שמתעורר כל מעשי עצמו כנ\\\"ל. כי גם מעורר עמו מעשי אבותיו והם עצמם באים עמו לסייעו בסוד העבור כידוע וזה הבא לטהר מסייעין אותו וזה מתי יגיעו מעשי למעשי אבותי לעוררם כנ\\\"ל. אמנם גדול מזה הי' כח אבותינו הקדושים שבכח מצותיהם שעשו היו משפיעים קדושה לבניהם אחריהם לעשות בקדושה כמוהם. וזהו כי ידעתיו למען אשר יצוה את בניו ושמרו וכו' וזהו אצל העקידה אנו אומרים וזכר לנו אהבת הקדמוני' פי' להשפיע לנו מאהבת הקדמונים. והבן:",
            "english_translation": "And these words shall be upon your heart and you shall teach them diligently to your children and speak of them and bind them as a sign upon your hand and write them upon the doorposts of your house and upon your gates. When we pay attention to understand the order of this passage, behold the text enumerated here the order of fulfilling the commandments in four aspects: First to fulfill the words in the heart, second to fulfill them in speech with the mouth, third to bind them upon oneself in the aspect of the garment of tefillin, fourth to write them on the doorposts of the house as a dwelling place. This appears to hint according to what is explained in Etz Chaim that the emanation of man in his entirety with all that is needed for his existence is in the pattern of four aspects of the supernal lights and in the state of the four worlds of ABYA which are the four letters of God's name blessed be He. For so too man's inner essence has four aspects - Nefesh Ruach Neshama and Neshama of Neshama. And man himself has four aspects: First the soul in his nostrils, second is the body over the soul, third the garments over the body, fourth the house he dwells in as a temple for all of them.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Festivals, Shaar Keriat Shema 11"
        },
        {
            "section": "Festivals",
            "topic": "Shaar Keriat Shema",
            "number": "29",
            "passage": "מכלכל חיים בחסד מחי' מתים ברחמים רבים. הנ\\\"ל לפרש דהנה אמנם גם הצדיקים שכבר מתו ונסתלקו לעולם העליון הנה גם שמה עיקר חיותם ושפעם בא ע\\\"י התעוררת התחתונים מה שבעולם הזה מסגלים על ידיהם תורה ומצות ע\\\"י קדושתם שהשאירו אחריהם בעולם הזה. והנה ע\\\"י מעשי התחתוני' בעולם הזה ממשיכין שפע וחיות האלקות לנשמות הקדושות אשר בג\\\"ע. וז\\\"ש עזרת אבותינו אתה הוא מעולם פי' עזרת אבותינו בג\\\"ע העליון אתה הוא מעולם הזה להריק להם שפע. אך עי\\\"כ אח\\\"כ מגן ומושיע לבניהם אחריהם בכל דור ודור כי כל ההשפעות טובות עוברות ע\\\"י האבות כמ\\\"ש בעבור אבותינו שבטחו בך לשון העברה ע\\\"י האבות הקדושים כנ\\\"ל. וז\\\"פ מכלכל חיים בחסד עי\\\"ז מחי' מתים שיש להם נחת רוח וחיות בג\\\"ע כשישראל הם בטובה. וזה ע\\\"י המצות ומעש\\\"ט הוא מחי' מתים וכו' וסומך נופלים וכו' ומקיים אמונתו לישיני עפר כי יש מעלה נפלאה וסוד עמוק בענין מיתת הצדיקים שחוזרים לעפרם הוא כדי שיהיו נקשרים עוד בעולם הזה שהוא לטובתם ולטובת בנ\\\"י בכלל. וזהו ומקיים אמונתו לישיני עפר כי לכך נשארו בעולם הזה כדי להתוסף להם חיות ע\\\"י המעש\\\"ט של התחתונים כמ\\\"ש חכז\\\"ל שפתותיו דובבות בקבר וכמו שעשו הקדושים מעולם ע\\\"י יחודם בנשמות הקדושים הצדיקים בהתדבקות רוחא ברוחא שיהי' עי\\\"ז טוב להם בג\\\"ע ולישראל ג\\\"כ בעולם הזה. וזה מלך ממית ומחי' ומצמיח ישועה ע\\\"י מעשה התחתוני' הטוב והישר כנ\\\"ל:",
            "english_translation": "He sustains the living with kindness, revives the dead with great mercy. Even the righteous who have died and ascended to the upper world, their main vitality and abundance comes through the awakening of those below, as in this world they acquire through them Torah and commandments through their holiness that they left behind in this world. And through the actions of those below in this world, they draw divine abundance and vitality to the holy souls in the Garden of Eden. This is what is meant by \"Help of our fathers, You have been from eternity\" - meaning help for our fathers in the upper Garden of Eden comes from this world to pour abundance to them. But through this afterwards He protects and saves their children after them in every generation, for all good influences pass through the fathers as it is written \"for the sake of our fathers who trusted in You\" meaning passing through the holy fathers as mentioned. This explains \"sustains the living with kindness\" through this \"revives the dead\" who have satisfaction and vitality in the Garden of Eden when Israel is doing well. And this is through commandments and good deeds that revive the dead and support the fallen and maintain His faithfulness to those who sleep in the dust, for there is wonderful virtue and deep secret in the matter of the death of the righteous who return to their dust in order to remain connected to this world for their benefit and the benefit of the children of Israel in general.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Festivals, Shaar Keriat Shema 29"
        }
    ],
    "timestamp": "2024-12-24T08:34:49.093740",
    "metadata": {
        "total_passages_processed": 133,
        "selection_criteria": "Passages with average score above 7.0",
        "scoring_version": "3.0"
    }
}