{
    "question_id": "e2a1a524-f6b2-4969-9b01-cb8fbb8688bc",
    "question": "מה המוסר השכל של מכירת יוסף",
    "selected_passages": [
        {
            "section": "Torah",
            "topic": "Vayeshev",
            "number": "7",
            "passage": "וילכו אחיו לרעות את צאן אביהם בשכם. פרש\\\"י שלא הלכו אלא לרעות את עצמן. הענין בזה יבואר עפ\\\"י הידוע גודל מעלת י\\\"ב שבטי י\\\"ה שהם נגד י\\\"ב צרופי הוי' ב\\\"ה ולכל אחד מהם הי' לו עבדות לכבוד שמים לפי דרכו והלוכו בקודש כמ\\\"ש הלא אחיך רועים בשכ\\\"ם ר\\\"ת \\\"ברוך \\\"שם \\\"כבוד \\\"מלכותו. ובזה יש להבין טעות השבטים שהי' עולה בדעתם לרעות את עצמן פי' שהם רועים בעצמן ואינם צריכין לרב ומנהיג כי כולם קדושים ועובדים הבורא ב\\\"ה בכל לבבם. וזה הרמז בחלומו של יוסף והנה אנחנו מאלמים אלומים בתוך השדה והנה קמה אלומתי וכו' ותשתחוין לאלומתי. שהי' מרמז להם אף כי המה כולם קדושים אעפ\\\"כ הם צריכים לו להיות להם לראש ולמנהיג כי הוא צנור כל ההשפעות בחי' צי\\\"ע. כי כן הי' כוונת הבריאה שיהי' בכל דור צי\\\"ע אור זרוע לצדיק ולישרי לב שמחה כי ע\\\"י הצדיק הולכים כל ההשפעות. ודבר זה גלה לנו הבעש\\\"ט זי\\\"ע שהפיץ אורו על פני תבל כי בלתי דיבוק חכמים שבדור איננו באפשרי להיות קיום לעולם. וזה שהי' כוונת יוסף לטובתם ולא מפני התנשאות עליהם חלילה רק למען החיש טובתם. ולו שמעו ויחלו לקבל עול מלכותו אז יכול להיות גאולה שלימה. כמ\\\"ש ויוסף בן שבע עשרה שנה. עולה בגימ' טו\\\"ב אמרו לצדיק כי טוב. אך מפני כי הלכו לרעות את עצמן כאשר זה הי' ג\\\"כ טעות קרח שאמר כל העדה כולם קדושים ומדוע תתנשאו כו'. ובאמת לא כן הי' רצונו ית\\\"ש אף אמנם כולם קדושים אדרבא לזה הם צריכים למשה רבינו שיהי' המנהיג כדי שילכו ההשפעות על ידו כמ\\\"ש אצל רשב\\\"י באדרא רבא שהי' יושב עמהם ומצוה לתלמידיו שיאמרו כ\\\"א ד\\\"ת לפניו כמ\\\"ש פתח ר' אבא וכדומה לכן תלמידיו של ר\\\"ע אמרו כל הפורש ממך כפורש מן החיים כי כל החיים שלהם הי' על ידו הן השפעות החכמה ועניני עוה\\\"ז ג\\\"כ. וזה הי' ענין יוסף שהוא הי' צדיק הדור כמ\\\"ש לאסור שריו בנפשו וזקניו יחכם. כמ\\\"ש כי בן זקונים הוא לו ותרגומו כי בר חכים הוא לי'. פי' שהי' מעורר עולם החכמה עולם הזקנה. ולזה אחר מכירתו של יוסף כתיב וירד יהודה מאת אחיו. פי' שהי' ירידה במלכות בית דוד. וסוף דבר פוק חזי מה עלתה בם כי גם לחם לא הי' להם עד שירדו למצרים. וזה הענין הי' גם במשרע\\\"ה שאמר יוסף ה' עליכם כו'. פי' בחי' יוסף הוא צדיק הדור יהי' עמכם. ועי\\\"ז יברך אתכם כאשר דבר לכם בשעת מ\\\"ת:",
            "english_translation": "And his brothers went to feed their father's flock in Shechem but they went only to feed themselves and this matter will be explained according to the known greatness of the twelve tribes of God which correspond to the twelve combinations of God's name and each one had their own divine service according to their way and holy path as it is written \"Are not your brothers feeding in Shechem\" which are the initials of \"Blessed be the name of His glorious kingdom\" and in this we can understand the tribes' error in thinking they could shepherd themselves meaning they were their own shepherds and needed no rabbi or leader since they were all holy and served the Creator with all their hearts and this is hinted at in Joseph's dream \"behold we were binding sheaves in the field and behold my sheaf arose\" indicating that although they were all holy they still needed him as their head and leader for he was the channel of all divine influence and this was the intention of creation that in every generation there should be a righteous one a light sown for the righteous and joy for the upright in heart for through the righteous one all influences flow and this matter the Baal Shem Tov revealed to us spreading his light throughout the world that without connection to the sages of each generation the world cannot exist.",
            "average_score": 9.0,
            "reference": "Tiferet Shlomo, on Torah, Vayeshev 7"
        },
        {
            "section": "Torah",
            "topic": "Vayeshev",
            "number": "10",
            "passage": "לר נא ראה את שלום אחיך ואת שלום הצאן והשיבני דבר. הנ\\\"ל לרמז בזה עד כמה האדם צריך לשמור את עצמו לבל ישים עוול ודבה על חבירו רק יסתכל במעלת חבירו ויעלים עינו מחסרונו. וז\\\"ש בתהלים ל\\\"ד. מי האיש החפץ חיים אוהב ימים לראות טוב. פי' יסתכל רק הטוב אשר בחבירו. נצור לשונך מרע. סור מרע ועשה טוב. כי כאשר האדם מוציא דבה על חבירו אזי הוא גורם רעה לעצמו להיות נופל ח\\\"ו ברשת היצר. כמו שמצינו ג\\\"כ במלאכים שקטרגו בשעת בריאת עולם מה אנוש כי תזכרנו. אף שהיו אז במעלה גדולה מאד אח\\\"כ נפלו למטה כמ\\\"ש ויראו את בנות האדם כו'. גם בירבעם שהוכיח לשלמה המלך אי' במד\\\"ר שהשיבו לו הוא נכשל באחת ואתה בכמה. והענין הוא כי מלחמת היצר רבה היא מאד ולולי הקב\\\"ה עזרו לא הי' יכול לו. לכן אם האדם מספר בגנות חבירו ודימה בנפשו ובלבבו ירים כי הוא בטוח להנצל מפיתוי היצר. לכן הקב\\\"ה מסיר ממנו העזר ונופל ברשת ח\\\"ו.לכן כאשר תסור מלהסתכל ברע של חבירך אז תוכל לעשות טוב וזה הרמז ג\\\"כ כאן שאמר יעקב אבינו ליוסף לך נא ראה את שלום אחיך. פי' השלימות והטוב אשר באחיך תראה ולא תביט בחסרונם. ואת שלום הצ\\\"אן רמז ליחוד הוי' אדנ\\\"י בגימ' צ\\\"א. נו\\\"ן רמז לנ' שערי בינה. והשיבני דבר. לשון תשובה. תחזור בתשובה על אשר פגמת שהבאת דבתם רעה. אך טוב תראה בבנ\\\"י תמיד:",
            "english_translation": "Go now, see to your brothers' welfare and the welfare of the flock and bring me back word. This hints at how much a person must guard himself not to place injustice and slander upon his fellow but rather look at his fellow's virtues and overlook his deficiencies. And this is what is said in Psalms 34: Who is the man who desires life, loves days to see good - meaning he should only look at the good in his fellow. Guard your tongue from evil, turn from evil and do good. For when a person spreads slander about his fellow, he causes evil to himself to fall into the net of the evil inclination. As we also find with the angels who criticized at the time of creation \"What is man that You should remember him.\" Although they were then at a very high level, afterwards they fell below as it is written \"And they saw the daughters of man etc.\" Also with Jeroboam who rebuked King Solomon, it says in the Midrash that they responded to him \"He stumbled in one thing and you in several.\" The matter is that the war with the evil inclination is very great and if not for the Holy One helping him he could not overcome it. Therefore if a person speaks negatively about his fellow and imagines in his soul and heart that he is secure from being tempted by the evil inclination, then the Holy One removes His help from him and he falls into the net Heaven forbid. Therefore when you turn from looking at your fellow's evil then you can do good and this is also hinted at here where our father Jacob said to Joseph \"Go now see your brothers' welfare\" - meaning see the completeness and good in your brothers and do not look at their deficiencies. \"And the welfare of the flock\" hints at the unification of YHVH ADNY which equals 91 in gematria. Nun hints at the 50 gates of understanding. \"And bring me back word\" is language of repentance - return in repentance for what you damaged by bringing their evil report. But see only good in the children of Israel always.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Torah, Vayeshev 10"
        },
        {
            "section": "Torah",
            "topic": "Vayishlach",
            "number": "6",
            "passage": "ויזרח לו השמש כאשר עבר את פניאל והוא צולע על ירכו. עפרש\\\"י ויזרח לו השמש לרפאותו מצלעתו כמ\\\"ש שמש צדקה ומרפא כו'. ועדיין יש לדקדק שלשון הפסוק הוא בהיפך שמתחיל ויזרח לו השמש כו' ואח\\\"כ כתיב והוא צולע על ירכו דהול\\\"ל מקודם שהי' צולע על יריכו ואח\\\"כ ויזרח לו השמש לרפאותו. אכן הנ\\\"ל עפמ\\\"ש בפ' מקץ בפ' לולא התמהמהנו כי עתה שבנו זה פעמי' לרמז בזה כי אם האדם עומד במרדו ואינו תוהא על הראשונות כל דרך איש ישר בעיניו כאשר איננו יודע מה חסר לו כי גם זה הסתת היצר לומר לו כי הכל עושה למצוה רבה ואין בו שום עול. ועל זה צריך להיות לו עזר מן השמים למען ידע כי לא טוב עשה ויתקן המעוות בעוצם התשובה הנכונה. לכן גם השבטים הקדושים כל ך\\\"ב שנה שמכרו את יוסף אחיהם לא ידעו אם עשו שום חטא בזה רק נדמה להם כי זה דרך הטוב והישר. רק כאשר באו למצרים אל יוסף הצדיק והופיע עליהם מגודל קדושתו אז הרגישו כולם מה עשו ובא הרהור תשובה בלבבם אז אמרו אבל אשמים אנחנו על אחינו כו'. וז\\\"ש ליעקב אביהם לולא התמהמהנו כי עתה שבנו זה פעמים כי כן הוא דרך התשובה לעלות בכל יום במעלה יתירה ולהתחזק בכל יום יותר וידע כי ביום אתמול לא הי' במעלה זו ויחזור וישוב בתשובה על יום שעבר. ונחזור לענינינו. ויזרח לו השמש פי' כי השי\\\"ת ברוב חסדיו מאיר לאדם ונותן לו אור הנשמה ואימתי זאת כאשר עבר את פניאל פי' כשעברו ממנו הפניות שהי' לו בהעבדות של תורה ומצות מקודם לזה שלמד תורה שלא לשמה כי לא הי' טהור ועודנו מעונה ומוכה מעצת היצה\\\"ר והי' צריך רפואת הנפש לכן לא הי' מרגיש כלל מה שחסר לו. אך עתה כאשר זרח לו השמש אור הנשמה הבהירות הקדושה מסיעתא דשמיא אזי הוא מבין מדעתו כי הוא צולע על ירכו ועודנו צריך תיקון ורפואה לנפשו כנ\\\"ל:",
            "english_translation": "And the sun rose upon him as he passed over Penuel, and he limped upon his thigh. The sun rose upon him to heal him from his limp, as it is said \"sun of righteousness with healing.\" And still there is to examine that the language of the verse is opposite, starting with \"and the sun rose upon him\" and afterward it writes \"and he limped upon his thigh\" when it should have said first that he was limping on his thigh and then that the sun rose upon him to heal him. Indeed, this is according to what is written in Parashat Miketz regarding \"if we had not delayed, we would have returned twice by now\" to hint that if a person stands in rebellion and does not regret his past actions, every man's way is right in his own eyes when he does not know what he lacks, for this too is the temptation of the evil inclination telling him that everything he does is for a great commandment and there is no wrong in it. And for this he needs help from heaven so that he may know that he did not do good and will correct the wrong through the power of proper repentance. Therefore also the holy tribes for all twenty-two years that they sold their brother Joseph did not know if they committed any sin in this, rather it seemed to them that this was the good and right way. Only when they came to Egypt to Joseph the righteous and his great holiness shone upon them, then they all felt what they had done and thoughts of repentance entered their hearts, then they said \"indeed we are guilty concerning our brother.\" And this is what they said to Jacob their father \"if we had not delayed, we would have returned twice by now\" for such is the way of repentance to rise each day to a greater level and to strengthen more each day and know that yesterday he was not at this level and return and repent for the day that passed. And returning to our matter, \"and the sun rose upon him\" means that the Holy One, blessed be He, in His great mercy illuminates man and gives him the light of the soul, and when is this? \"When he passed over Penuel\" means when the ulterior motives he had in his service of Torah and commandments before this passed from him, for he had learned Torah not for its own sake because he was not pure and was still afflicted and struck by the counsel of the evil inclination and needed healing of the soul, therefore he did not feel at all what he was lacking. But now when the sun shone upon him, the light of the soul, the holy clarity from heavenly assistance, then he understands on his own that he limps upon his thigh and still needs correction and healing for his soul as mentioned above.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Torah, Vayishlach 6"
        },
        {
            "section": "Torah",
            "topic": "Vayeshev",
            "number": "14",
            "passage": "וירד יהודה מאת אחיו. במד\\\"ר רשב\\\"נ פתח כי אנכי ידעתי את המחשבות כו' שבטים היו עסוקים במכירתו של יוסף. ויוסף היה עסוק בשקו ותעניתו וכו' והקב\\\"ה היה עוסק ובורא אורו של משיח ע\\\"כ. הנה יש להעיר בדברי המאמר הזה מהו שייכות יש לכל דברי הצומות והשקים של הצדיקים הללו לברא אורו של משיח וכי לא היה עוד זמן אחר טוב ונרצה לפני הש\\\"י ב\\\"ה להוציא אורו הגדול רק בזמן הזה שכל בני יעקב חגרו שקים ואביהם עמהם. אולם כאשר נעמוד להתבונן מעט על חוקי הנהגת העולם עפ\\\"י הש\\\"י מתחלת הבריאה עד עתה. הנה זה מצאנו ראינו כי כל עניני עוה\\\"ז לא יכלו לצאת אל הפועל הגמור והתכלית האמיתי זולת אחרי ההעדר המוחלט ושיוקדם להם האין הכללי וכמ\\\"ש חכז\\\"ל ההעדר קודם להויה ר\\\"ל כי בחי' ההעדר הוא בהכרח קודם למציאת ההוי' והוא הסיבה למציאת ההו' שיבא אח\\\"כ וכמו שנראה זה בתבואת הזרע אשר לא יעלו ולא יצמיחו זולת אחר הרקבון הגמור בעפר כולו. והנה כן הענין היה בתחלת הבריאה האור שבא מכח החשך הקדום לו כמ\\\"ש והארץ היתה תהו ובהו וחשך ויאמר אלהים יהי אור כי מציאת החשך הוא הסיבה לאור וכן ויהי ערב ויהי בקר מבחי' הערב יבא הבקר אחריו. וזהו יוצר אור ובורא חשך ע\\\"י שבורא החשך תחלה עי\\\"כ יצא האור ובקר אחריו להתגלות. וז\\\"ש יתרון החכמה מן הסכלות כיתרון האור מן החשך ר\\\"ל כמו שיתרון האור לא יכול להיות רק אחר מציאת החשך הקדום לו וממנו יוצא האור וזהו מן החשך עצמו יצא האור כן יתרון החכמה תבא לאדם רק מבחי' הסכלות עצמה. פי' שיעשה האדם עצמו כסכל לעולם ולא יהיה נחשב בעיניו לכלום. אז יגיע למעלת החכמה האמיתית כמ\\\"ש א\\\"א ע\\\"ה הנה נא הואלתי לדבר אל ה' ואנכי עפר ואפר ר\\\"ל מה שהואלתי לדבר הוא יען כי אני יודע בעצמי כי הנני עפר ואפר וז\\\"ש אצל מתן תורה ויהי בשמעכם את הקול מתוך החשך. יש להבין מה אשמעינן בזה בשמיעת הקול מתוך החשך ולא נאמר מתוך האש כמו בזולתו. אך בהיות המעמד המובחר ההוא של מתן תורה התכלית המכוון והקיום האמיתי של בריאת העולם כולו הנה לא יכלו בנ\\\"י לקבל את האור הגדול ההוא זולת ע\\\"י סיבת החשך הקדום לו למציאת האור כמו שהיה כן אצל תחלת הבריאה וחשך על פני תהום ויאמר אלהים יהי אור. נמצא כי אך הסיבה העצמיות לתכלית הויות האור הוא החשך הקדום לו. והנה כזה הוא התכלית למציאת אור ה' נשפע על האדם הוא רק ע\\\"י בחינת החשך אשר תוקדם לו לעולם. אשר ידע ויבין בדעו ושכלו גודל חשכת נפשו כמה הוא מגשש באפילה ובמה נחשב הוא אז עי\\\"כ יזכה אשר השי\\\"ת ב\\\"ה יוציאנו מאפילה לאור גדול כמ\\\"ש אני אשכון את דכא והוא שרמזו רז\\\"ל במשנה במס' נגעים פרק ב' מי שהוא בבית אפל אין פותחין לו חלונות לראות את נגעו. ר\\\"ל מי שהוא בבית אפל על מעשיו אשר לא טובים אין פותחין חלונות שיראו אחרים בנוולתו ונגעי לבבו כי אם הוא ישב בחשך ה' אור לו. וכן אמרו עוד שם במשנה אין רואים את הנגעים שחרית ובין הערבים. ר\\\"ל בזמן תפלת שחרית ובין הערבים לא יבקר אז האדם אחרי נגעי לבבו פן יתעצב אל לבו ולא יהיה יכול להתפלל כדת אך יבחר לו זמן אחר מזמנים הידועים הראוים לכל אלה. נחזור לעניננו הנה מציאת ההעדר הוא הסיבה להויה זהו ג\\\"כ ענין המיתה ר\\\"ל שנקנסה על האדם אשר אחריה נקוה לשוב ולהחיות עוד בתחיית המתים אשר לכאורה אין להבין למה צורך להמית ולהחיות אח\\\"כ טוב היה להניח מזה ומזה ושיחיה האדם לעולם ואם בעבור מירוק העון הלא הרבה צדיקים שמתו בלא עון רק מעטיו של נחש. אך הכוונה הוא ג\\\"כ כנ\\\"ל בהיות כי התכלית הנרצה מה שיהיה לעתיד שיתגלה כבוד מלכותו ית\\\"ש לעיני כל בשר באורו הגדול לכן אין בכח מציאת מין האנושי בעוה\\\"ז לקבל האור הגדול רק ע\\\"י ההעדר הקדום לו במיתה הזאת עתה שהיא הקדמה וסיבת קבלת האור ההיא של תחה\\\"מ. וזהו שסמוך לברכת מחיה מתים קדושת השם נקדישך ונעריצך כסוד שיח שרפי קודש. הכוונה כי אז בתחה\\\"מ נקדישך גם אנחנו כמו שמקדישים אותך בסוד שיח שרפי קודש. ואז כתר יתנו לך מלאכים המוני מעלה עם ישראל קבוצי מטה כי אתה קדוש ושמך קדוש וקדושים בכל יום יהללוך סלה. לכן גם אנחנו מקווי' ומצפים להלל אותך בסוד קדושים הללו. נמצא כי בחי' המיתה הקודמת בבחי' החשך לקבל' האור העתיד וזהו שאנו אומרים מלך ממית ומחיה ומצמיח ישועה. ר\\\"ל מה שהוא ממית הוא כדי להחיות אחר כך כשיצמיח ישועה בקרוב. וז\\\"ש חכז\\\"ל החיים למות והמתים להחיות. ולכאורה קשה מי לא ידע בכל אלה ומהו משמיענו בזה. אך הכוונה כנ\\\"ל מה שהחיים למות הוא כדי שהמתים להחיות בתוקף אור הגדול ביתר שאת ויתר עוז. וזהו שאמרו חכז\\\"ל והנה טוב מאד זה המה\\\"מ כי הוא טוב מאד להיותו הסיבה המיתה וההעדר הכנה לביאת האור הגדול לנפשות העתידים לעמוד בתחה\\\"מ כנ\\\"ל. וכענין הזה הוא שהיה אצל האמהות הקדושות אשר היו עקרות זמן הרב קודם לידתן עד בואם בשנים בקצה האחרון רק אז נפתחו רחמם כמו שרה לא זכתה להריון עד בלותה עפ\\\"י נס. וכן רבקה ורחל ויוכבד היא עלתה על כלנה עד היותה בת ק\\\"ל שנה. וזה קשה להבין למה היתה כזאת שעכבום הש\\\"י עד קצה האחרון. אך כדברינו נכון כי אחרי אשר ראו להאמהות הקדושות האלו להוליד נשמות הקדושות האלו נפשות הצדיקים המאורות הגדולים ההם. הנה לא יתכן להם להוציא האור זולת אחרי ההעדר הקודם לכן המתין להם הקב\\\"ה עד עת זקנתן עד שלא חשבו עוד להיות להם זרע כלל ומן החשך ההוא הוציא להם אור גדול כמשרע\\\"ה והאבות הקדושים ע\\\"ה. והנה כן היה הדבר בהנהגת הש\\\"י עם עמו בנ\\\"י בגלותינו אשר בכל עת ענינו ומרודינו כשהם לוחצים אותנו עד מאד רק אז מן החשך מושיע להם ומוציאם לאור גדול וזהו שצעק הנביא כמו ההרה תקריב ללדת תחיל ותזעק בחבלי' כן היינו מפניך ה' דהנה ההרה הקרובה ללדת גם היא לא תוליד עד אשר תבוא אז בהסכנה העצומה ותגדל חבליה מאד אז בקצה האחרון יושיע לה הש\\\"י כן אנחנו חלנו ואין בנו עוד כח ללידה כמו ילדנו רוח. וזה הוא ענין משיח צדקנו שאמרו חכז\\\"ל כי ביום שנחרב הבהמ\\\"ק נולד משיח וביום שחשב הש\\\"י להשחית חומת ירושלים נטה קו על בנין העתיד כי בהיות החורבן ההוא יום בכי ומספד אף בבתי גואי אשר כמהו לא יהיה עוד אח\\\"כ לכן ביום ההוא מחמת החשך וההעדר ההיא יצא משיח. והנה זה ג\\\"כ ביאור המד\\\"ר הנ\\\"ל כי פרץ וזרח שניהם מורים על משיחנו שיבא ב\\\"ב לכן רק בעת החשך ההוא שכל בית יעקב היו אגודים בצרה בשקם ותעניתם אז זרח בחשך אור לישרים ולהוציא הקב\\\"ה אז אורו של משיחנו ב\\\"ב אמן:",
            "english_translation": "And Judah went down from his brothers. In the Midrash Rabbah, Rabbi Shimon ben Nachman opened with \"For I know the thoughts etc.\" The tribes were occupied with selling Joseph, and Joseph was occupied with his sackcloth and fasting etc., and the Holy One Blessed be He was occupied with creating the light of the Messiah. Behold, one must note regarding this statement what connection exists between all the fasting and sackcloth of these righteous ones to create the light of the Messiah, and was there not another good and favorable time before the Lord Blessed be He to bring forth His great light except at this time when all of Jacob's sons wore sackcloth along with their father. However, when we stand to contemplate a bit about the laws of world governance according to the Lord from the beginning of creation until now, we have found and seen that all matters of this world could not come to complete actualization and true purpose except after absolute absence and that general nothingness must precede them, as our Sages said absence precedes existence, meaning that the aspect of absence necessarily precedes the existence of being and it is the cause for the existence that comes afterward, as we see with grain seeds which will not sprout or grow except after complete decomposition in the soil. And so it was at the beginning of creation - the light that came from the power of darkness that preceded it, as it is written \"And the earth was formless and void and darkness\" and \"God said let there be light, \" for the existence of darkness is the cause for light, and so \"there was evening and there was morning\" - from the aspect of evening comes morning after it. And this is \"forms light and creates darkness\" - through creating darkness first, through this light emerges and morning follows to be revealed.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Torah, Vayeshev 14"
        },
        {
            "section": "Torah",
            "topic": "Miketz",
            "number": "17",
            "passage": "כי לולא התמהמהנו כי עתה שבנו זה פעמיים. הנראה לרמז בדברים הללו עפ\\\"י מה שאנו אומרים השיבנו אבינו לתורתך. לפמ\\\"ש בגמ' פשפש ולא מצא יתלה בביטול תורה. דלכאורה צריך להבין איך שייך לומר פשפש ולא מצא אם הוא יודע שלא למד. אך באמת אף אם האדם לומד בהתמדה אם איננו שמור מהעבירות אז גם לימודו הוא כדבר בטל כמו בחמץ שהוא בעין ואפ\\\"ה הוא בטל כמו שאינו. וזהו מדאורייתא בביטול בעלמא סגי. כי ענין הלימוד הוא להורות לאדם דרך הישרה לעבודת הבורא ב\\\"ה ואם התורה איננה מדריכו לעבודה היא בבחי' ביטול מעיקרא. וז\\\"ש יתלה בביטול תורה שהלימוד שלו הוא ג\\\"כ בטל. והתקנה לזה מבואר בזוה\\\"ק מי שעומד בחצות לילה ומשים על לבו להתמרמר על חטאיו ומתחרט על הימים אשר עברו וחלפו בהבל וריק אז אורייתא מודעת לי' חובי'. ואז עיניו תחזינה מישרים וחטאתו לנגדו תמיד לשוב בתשובה שלימה. וז\\\"ש השיבנו אבינו לתורתך. כי גם התורה אשר למד צריכה לתשובה שלימה ואז כאשר ידע מה שחטא יכול לשוב בתשובה שלימה. וכדומה לזה מובא באלשיך על פסוק למנצח מזמור לדוד בבוא אליו נתן הנביא כאשר בא אל בת שבע כי עתה הי' שמחתו בזה כאשר ידע כי חטא כי עתה ישוב בתשובה ויעלה לרצון כי עד עתה הי' סבור כי נעשה בהיתר כמ\\\"ש בגמ' כל היוצא למלחמת בית דוד גט כריתות כותב כו'. וזאת ידוע כי ראיית פני הצדיק והתקשרות עמו מועיל לתיקון נשמתו לבא לתשובה שלימה לנכון כידוע המעשה מהרב ר' חייקא המדורא ז\\\"ל וכו'. לכן גם בענין השבטים שמכרו את יוסף לא עלתה על לבם כי עשו עוול בזה כי המה סברו שעשו מצוה ב\\\"ה לכן לא חזרו בתשובה. אך עתה כאשר באו אל יוסף וראו פניו והוא הי' בדורו בחי' צי\\\"ע כמ\\\"ש כי בן זקונים הוא לו. לכן בראיית פניו נתעורר לבבם בהרהור תשובה על מה עשו ככה וז\\\"ש אבל אשמים אנחנו כו'. וז\\\"ש והם לא ידעו כי שומע יוסף כי המליץ בינותם כמ\\\"ש אם יש עליו מלאך מליץ אחד מני אלף. כי כאשר. התוודו על אשר חטאו נתעורר למעלה מליץ טוב בעדם. כי בראיית פניו נמשך עליהם עול מלכות שמים לשוב בתשובה שלימה לפניו. וזה שאמרו כי לולא התמהמהנו לראות פניו המאירים. כי עתה שבנו זה פעמיים. היינו חוזרים בתשובה זה פעמיים כמבואר לעיל:",
            "english_translation": "For if we had not delayed, we would have returned twice by now. It appears to hint at these matters according to what we say 'Return us, our Father, to Your Torah.' As written in the Gemara, if one searches and does not find, attribute it to neglect of Torah. For seemingly one needs to understand how it is possible to say searched and did not find if he knows he did not study. But truly even if a person studies diligently, if he is not protected from sins then his learning is also like something nullified, like chametz which exists yet is nullified as if it does not exist. And this is from the Torah where mere nullification suffices. For the purpose of study is to guide a person on the straight path to serve the Creator blessed be He, and if the Torah does not guide him to service it is in a state of fundamental nullification. And this is what is meant by attribute it to neglect of Torah - that his learning is also nullified. And the remedy for this is explained in the holy Zohar: one who rises at midnight and takes to heart to be bitter about his sins and regrets the days that passed in vanity and emptiness, then the Torah informs him of his obligations. And then his eyes will see straight and his sin is always before him to return in complete repentance. And this is what is meant by 'Return us, our Father, to Your Torah.' For even the Torah he learned needs complete repentance, and then when he knows what he sinned he can return in complete repentance. And similarly it is brought in Alshich on the verse 'For the conductor, a psalm of David, when Nathan the prophet came to him after he had gone to Bathsheba' - that now his joy was in this when he knew that he had sinned, for now he would return in repentance and it would be accepted, for until now he thought it was done permissibly as stated in the Gemara that all who go out to war for the house of David write a bill of divorce etc. And it is known that seeing the face of the righteous one and connecting with him helps repair his soul to come to proper complete repentance as known from the story of Rabbi Chaika of Madura of blessed memory etc. Therefore also regarding the tribes who sold Joseph, it did not occur to them that they did wrong in this for they thought they were doing a blessed commandment, therefore they did not repent. But now when they came to Joseph and saw his face, and he was in his generation an aspect of a righteous foundation as written 'for he was a son of his old age, ' therefore upon seeing his face their hearts were awakened with thoughts of repentance about what they had done, and this is what is meant by 'but we are guilty.' And this is what is meant by 'they did not know that Joseph understood for the interpreter was between them' as written 'if there be for him an angel interpreter one of a thousand.' For when they confessed what they had sinned, a good interpreter was awakened above for them. For in seeing his face, the yoke of heaven was drawn upon them to return in complete repentance before Him. And this is what they said 'for if we had not delayed' to see his illuminating face, 'we would have returned twice by now' - meaning we would have returned in repentance twice as explained above.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Torah, Miketz 17"
        },
        {
            "section": "Festivals",
            "topic": "Sukkot",
            "number": "62",
            "passage": "(בפ' וישב) וימצאהו איש והנה תועה בשדה וכו' ויאמר את אחי אנכי מבקש. הנראה ברמז הכתוב מבלי שנאריך בדקדוקים. דהנה כתיב בע\\\"ח בשער הכללים בענין סוד שבירת הכלים וז\\\"ל.. והנה כשהגיע האור אל היסוד באו ב' אורות א' שלו וא' לתת אל המלכות והחלק שלו להיותו גדול לא יכול לסבלו ונתבטל כמו האחרים. אך חלק המלכות שקבל הוא נשאר בו ולא נתבטל. וז\\\"ס בן ישי חי על האדמה ולכן נקרא יסוד ח\\\"י ע\\\"כ. המבואר מזה כי עיקר קיום הבחי' של יסוד הי' רק במה שהוא להשפיע לאחרים אבל לא מה שצריך לעצמו כי שלו נתבטל רק מה שהוא להשפיע לאחרים זה מתקיים בידו. הנה כן צריך ללמוד מזה כי עיקר בחי' הצי\\\"ע הוא רק להשפיע לישראל כל טוב ולא לצורך עצמו כלל. וזהו הרמז בפסוק ואלה המלכים שזה מוסב על סוד שבירת הכלים כמבו' בזוה\\\"ק. ואמר הכתוב כי סיבת שבירתן הי' לפני מלוך מלך לבני ישראל שלא השפיעו לכנ\\\"י. ולכך הנה זה הענין האמור אצל יוסף הצי\\\"ע שהוא בבחי' היסודות שלמעלה כאשר אמר לאחיו והנה תסובנה אלומותיכם ותשתחוין לאלומתי שרמז כי כולם צריכין לעבור על ידו שזהו בחי' ההשתחוואה כנודע כי הכל עובר דרך היסוד. אכן הם סברו בו כי מתנשא הוא למלוך לעצמו. ולכך אמרו לו המלוך תמלוך עלינו ר\\\"ל אם סבור אתה למלוך לעצמך הנה בלי ספק תתבטל כמו שנתבאר לכך נאמר ולא יכלו דברו לשלום ר\\\"ל לא היו יכולים להנהיג השפעתו לשלום מלכות כנ\\\"ל. והנה כמו שמבואר בגמ' נשיאות אני נותן לך עבדות אני נותן לך ר\\\"ל כל עניניך יהי' רק להשפיע לאחרים. והוא האמור אצל מלך ישראל לבלתי רום לבבו מאחיו ר\\\"ל לבל יסלק השפעתו מהם אז יהי' למען יאריך ימים על ממלכתו הוא ובניו בקרב ישראל להשפיע לישראל והוא שנאמר אצל יוסף שאמר לו אביו לך נא ראה את שלום אחיך להשפיע להם ולא לעצמך כלל. וכן כשראה א\\\"ע תועה וישאלהו האיש מה תבקש ר\\\"ל מה דעתך עתה ויען לאמור את אחי אנכי מבקש ר\\\"ל מעתה אני יודע כי צריך אני רק לבקש את אחי ולהשפיע להם כל טוב:",
            "english_translation": "And a man found him and behold he was wandering in the field etc. and he said I seek my brothers. The apparent hint in the scripture without lengthening in grammar details. For it is written in Etz Chaim in the Gate of Principles regarding the secret of the breaking of vessels thus: And when the light reached the foundation two lights came one for itself and one to give to kingship and its own portion being too great could not bear it and was nullified like the others. But the portion of kingship that it received remained in it and was not nullified. And this is the secret of the son of Jesse lives on the earth and therefore foundation is called living. What is explained from this is that the main existence of the aspect of foundation was only in what it gives to others but not what it needs for itself because its own was nullified only what it gives to others exists in its hand. Thus one must learn from this that the main aspect of the righteous one is only to give to Israel all good and not for his own need at all.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Festivals, Sukkot 62"
        },
        {
            "section": "Torah",
            "topic": "Vayeshev",
            "number": "4",
            "passage": "וישראל אהב את יוסף מכל אחיו ועשה לו כתונת פסים. ויקנאו בו אחיו וכו'. בגמ' שבת דף י' בשביל משקל ב' סלעים מילת שנתן יעקב ליוסף יותר משאר בניו נתקנאו בו אחיו ונתגלגל הדבר וירדו אבותינו למצרים. הנה הדברים האלו לפי פשוטן אין להם שחר. האם יתכן בקדושי עליון שבטי י\\\"ה כי יתקנאו עבור ב' סלעים מילת וכתונת. אמנם שורש הענין הוא ע\\\"ד שכתוב והבדילה הפרכת לכם בין הקודש ובין קודש קדשים למה הוצרך עוד הפרכת להבדלה הלא כבר מקודש החצר והמשכן עד מאד ומה תוסף עוד הפרכת להבדלה יכול להיות קדשי קדשים בלא הבדלה מהפרכת. אולם להבין זה הנה ידוע לי\\\"ח מענין הצמצום הרבים אשר בשעת בריאת עולם כדי שיוכלו העולמות למטה. להכיל אור א\\\"ם ב\\\"ה כי יש כמה וכמה אלפים ורבבות עולמות למעלה מעולם האצילות בבחי' לבושים זה בתוך זה וכן בד' עולמות אבי\\\"ע יש בהם שבא האור ההוא למטה דרך חלון ומסך ולבוש והיכלות כי זה בלא זה לא היו יכולין לקבל האור המתנוצץ עד עולם העשי' וממנו לעולם השפל הזה ג\\\"כ כזה כי שמש ומגן ה' כו' ד\\\"מ כמו אור השמש אשר לא יוכלו הבריאים להנות ממנו ולקבל אורו הגדול רק ע\\\"י מעבר החלון ומסך והיכלות. והנה בזמן שהי' בהמ\\\"ק קיים ואור ה' הופיע על הבהמ\\\"ק בקדשי קדשים בשפע רב לא הי' העולם יכול לסבול ולקבל האור היוצא בביהמ\\\"ק לכן הוצרך הפרכת להבדלה ד\\\"מ למען יוכלו הבריות לקבל אור השפע העליון אחרי מסך הפרכת והאולם וההיכל. וכן הי' הענין בבגדי כהונה (של)הכה\\\"ג חושן אפוד וכתונת וכו' להיות דוגמת האדם העליון והאורות החסדים בוקעים ומאירים בו הוצרך לבגדים יתירים האלו כמבואר בכתבי האריז\\\"ל סוד הלבושים. אך כאשר נכנם לפני ולפנים הי' לבוש רק ד' בגדים דוגמת ד' עולמות אבי\\\"ע. ולכך כה\\\"ג המחוסר בגדים פסול לעבודה. וזה הי' ג\\\"כ ענין הכתוב ופרשו עליו בגד תכלת וכסו בה את ארון העדות. בהיות הארון מקום השראת הקדושה האור העליון הוצרך הכיסוי תכלת שהוא בחי' צמצום כי תכלת דומה לכסא כבוד בחי' היראה כמבואר בזוה\\\"ק דתכלת היא תכלא דשצי כולא והוא בחי' גבורה והוא בחי' לבוש לצמצם האור כנ\\\"ל. וזה ג\\\"כ ענין המשמורות כהונה ולווי' שהיו בבהמ\\\"ק כי גם הלוים הי' בבחי' גבורה וצמצום על אור החסד שהיו הכהנים משפיעים לבל יצאו החוצה ואל יבוזו זרים והוא הענין התכלת האמור בציצית ונתנו על ציצית הכנף פתיל תכלת. שאור הציצית יהי' בחי' צמצום נגד החיצונים. כי ע\\\"ז מורה ענין התכלת בחי' גבורה וצמצום. וז\\\"ש בלשם יחוד בעטיפת הטלית. ובזכות מצות ציצית תנצל נפשי וכו' והטלית יפרוש כנפיו עליהם. כי הטלית הוא בחי' אור המקיף להנצל מן החיצונים. ולכך מתעטפין בטלית בשעת התפלה על התפילין לצמצם האורות של התפילין. וזש\\\"א מה יקר חסדך וכו' ואח\\\"כ משוך חסדך ליודעיך פי' אחר שנתעטף בטלית לצמצם החסדים מן החיצונים אז משוך חסדך ליודעיך כנ\\\"ל. ונחזור לענינינו. הנה כי זה הי' סוד כתונת יוסף שעשה לו אביו כתונת פסים. ומבואר במדרש שעשה לו ד' בגדים הרמז סוד לבושים הנ\\\"ל שהי' כה\\\"ג לובש בהם כי אמנם ידוע היות יוסף בחי' היסוד מכל העולמות צי\\\"ע והוא צנור ההשפעות. וכח הצדיק לצמצם ההשפעות לבל יתפשטו בין החיצונים כמ\\\"ש כי בן זקונים הוא לו. וזה שעשה לו אביו כתונת פסים ד' לבושים הנ\\\"ל בסוד ד' עולמות אבי\\\"ע כי יעקב ויוסף הם הצי\\\"ע כמ\\\"ש בווין תתקטר תרין ווי\\\"ן לכך הי' צריך הלבוש להיות נעשה ע\\\"י יעקב בעצמו לקשר ולדבק בו בחי' צי\\\"ע ולהיות מסך להשפעה העוברת על ידו להשמר מן החיצונים כמ\\\"ש שומר ה' את כל אוהביו. דלכאורה תיבת כל הוא מיותר. אך ידוע כי כל רומז לצי\\\"ע וכאשר הש\\\"י שומר ההשפעות ע\\\"י בחי' כל הוא הצדיק. אזי ממילא כל הרשעים ישמיד וכידוע ענין סוד כתונת אור של אדה\\\"ר להיות בסוד הלבישה כנ\\\"ל. וזה שאמרו חכז\\\"ל גנזו לצדיקים לע\\\"ל שהאור הראשון נגנז לצדיקי הדור שירדו ההשפעות על ידם וממילא הם נשמרים מן החיצונים והיא הגנוזה בהם. והוא שמצינו אצל רבקה ותקח את בגדי עשו בנה החמודות שחמד אותם מנמרוד שהי' לו מאדה\\\"ר וע\\\"י הקלקול באו לידי עשו. ורבקה נתכוונה להוציאם מידו להלביש את יעקב בנה הצדיק כי לו יאתה לקחת אותם. והנה בהיות הכרח סוד הלבושים האלו ליוסף להיות מסך נגד האור והחסד העובר על ידו לכן קנאו בו אחיו. באמרם כי גם המה בחי' צי\\\"ע. וזה שהשיב להם יוסף והנה תסובינה אלומותיכם ותשתחוין לאלומתי. כי הכל תלוי בו. כי הצדיק הוא העמוד שהעולם קיים על ידו והם לא האמינו לדבריו והפשיטו את כתנתו את כתונת הפסים והוא הי' עיקר הפגם של השבטים במכירת יוסף. וזו שהשמיענו הכתוב בזה שהפשיטו את כתנתו לומר שרצו לקחת ממנו בחי' הלבושים הנ\\\"ל לכך באו לכל הצרה הזאת ולולי כי הפשיטו את כתנתו לא הי' להם כח להזיקו במכירתם. אך מחמת כי הפשיטו את כתנתו הורידו את השפע לחיצונים. כמ\\\"ש להלן וישבו לאכול לחם וכו' וגמליהם נושאים כו' הולכים להוריד מצרימה פי' ההשפעות הלכו למצרים וז\\\"ש והשליכו אותו הבורה והבור ריק אין בו מים. ודרשו רז\\\"ל אבל נחשים ועקרבים יש בו. תיבת אותו רומז לבחי' אות ברית צי\\\"ע כי המדה זאת ירד להחיצונים. ולזה ויברך ה' את בית המצרי בגלל יוסף. וז\\\"ש יעקב כתונת בני חי' רעה אכלתהו טרוף טורף יוסף. לפי פשוטו אין הבנה לזה איך יצא מפיו של אותו צדיק דבר אשר לא כן הי' כי באמת הי' יוסף חי במצרים. אך לפי הנ\\\"ל הפי' בזה כי מפני שהפשיטו את הכתנת בחי' הלבוש כמ\\\"ש כתונת בני שעשה לו יעקב בעצמו בחי' לבוש כנ\\\"ל טרוף טורף יוסף רמז לרפ\\\"ח ני\\\"ק ובגלות הוא נטרף לחיצונים. וזה שהתמרמר יעקב אבינו כי ארד אל בני אבל שאולה. ר\\\"ל כי אצטרך לירד להוציא מהם ההשפעות והני\\\"ק שנפלו. וז\\\"ש ויבך אותו אביו בחי' או\\\"ת כנ\\\"ל ולכך כאשר נדחה השפע לחיצוני' לכן נשארו השבטים חסר לחם. ויוסף בהיותו בגלות הי' רוצה לעשות לו בעצמו לבושים ולא הועיל כדכתיב ותתפשהו בבגדו כו' פי' בגד שלו. אבל בבגד של אביו לא הי' לה שליטה. וזה ויעזוב בגדו בידה וינס ויצא החוצה. כידוע ענין עשרה הרוגי מלכות שנתגלגל עי\\\"ז כיל\\\"ח אך כאשר יצא יוסף מבית האסורין כתיב ויגלח ויחלף שמלותיו כי אז חזר בחי' הלבושי' ע\\\"י אורו עוטה כשלמה כמו שהי' בתחילה. וז\\\"ש יוסף לפרעה בלעדי אלהים יענה את שלום פרעה. כי כאשר היניקה יורד להחיצונים הוא בחי' אלקים. וז\\\"ש יוסף בלעדי אין לך משלי כלום כי אני מבחי' הוי'. רק אלהים יענה את שלום פרעה היניקה שלך הוא מבחי' אלקים. אשר נמשך החיות לבהמות וחיות אפי' הטמאות כמ\\\"ש ר' אליעזר אפי' בהמה טמאה נפשה לשמים. החיות שלה מבחי' אלקים ע\\\"י צמצום והשתלשלות עד אשר נעשה חלילה אלקים אחרים וחיצונים ר\\\"ל. אולם אח\\\"כ כשבאו אחי יוסף ונעשה היחוד וצירוף בשם הוי' וחזר בחי' היסוד אז אמר יוסף שימו לחם סוד ג' הויו\\\"ת. וז\\\"ש ויתן להם לבדם ולמצרים לבדם כי לא יוכלון המצרים לאכול את העברים לחם כי תועבה הוא למצרים. ר\\\"ל כי המצרים ניזונים מבחי' אלקים אחרים ובישראל כתיב לא תאכל כל תועבה. וזה שאמר יוסף חי פרעה אם תצאו מזה. ר\\\"ל אם תצאו מזה הנה תשוב החיות לפרעה. וזש\\\"א בשבת יום קדוש הוא מבואו ועד צאתו. כי השפע היורד בשבת הוא מצד הקדושה בחי' יסוד צדיק כמ\\\"ש וזכרת כי עבד היית במצרים לעבד נמכר יוסף כמבואר במ\\\"א. לכן השפע היורד בשבת מעולם העליון הוא בשמירה מהחיצוני' כי הוא מצד הקדושה מבואו ועד צאתו לעוה\\\"ז. לכן כל זרע יעקב יכבדוהו כו' ואל יבוזו זרים. ודברינו הנ\\\"ל נרמזו בדברי הזוה\\\"ק פ' בלק דף רד ע\\\"ש והבן:",
            "english_translation": "And Israel loved Joseph more than all his brothers and made him a coat of many colors. And his brothers envied him. In the Talmud Shabbat page 10, because of two selas worth of fine wool that Jacob gave Joseph more than his other sons, his brothers became jealous of him and the matter developed and our fathers went down to Egypt. These things according to their simple meaning have no dawn. Is it possible for the supreme holy tribes of God to be jealous over two selas of fine wool and a coat. Indeed the root of the matter is as it is written \"And the curtain shall separate for you between the holy and the holy of holies\" why was the curtain needed for separation when the courtyard and tabernacle were already very holy and what more separation would the curtain add could there not be a holy of holies without separation from the curtain.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Torah, Vayeshev 4"
        },
        {
            "section": "Torah",
            "topic": "Miketz",
            "number": "15",
            "passage": "ויאמרו איש אל אחיו אבל אשמים אנחנו כו' כי המליץ בינותם. הנ\\\"ל לפי מה שבארנו במ\\\"א בענין השבטים שכל ך\\\"ב שנה שמכרו את יוסף אחיהם לא עלתה על לבם כי עשו עוול בזה אך סברו כי עשו מצוה בזה. אך הקב\\\"ה היה מסבב להם סיבות במצרים להבין שחטאו במכירת יוסף כדי שיחזרו בתשובה כי באו לידי נסיון מדה כנגד מדה כי לקח מאתם את שמעון. ויאסור אותו לעיניהם ואח\\\"כ צוה להביא את בנימין. וכאשר הבינו הדבר התוודו על חטאתם באמרם אבל אשמים אנחנו על אחינו כו'. ולזאת סמך הכתוב כי המליץ בינותם. כמ\\\"ש אם יש עליו מלאך מליץ אחד להגיד לאדם ישרו כי על ידי הווידוי היה תיכף מליץ טוב עליהם. וז\\\"ש כי לולא התמהמהנו כי עתה שבנו זה פעמים. כדרך הצדיקים שכל מה שחוזרים בתשובה יותר מתחרטים על יום האתמול שלא הי' במדריגה זו. וזה לשון פעמיים. כמ\\\"ש שובי שובי השולמית שובי שובי כו' כמבואר במ\\\"א:",
            "english_translation": "And they said to one another, \"Indeed we are guilty\" because the interpreter was between them. According to what we explained elsewhere regarding the tribes, that for all 22 years since they sold their brother Joseph, it did not occur to them that they had done wrong in this, but rather thought they had performed a mitzvah. But the Holy One Blessed be He arranged circumstances in Egypt for them to understand that they had sinned in selling Joseph so they would repent, for they came to a test measure for measure when he took Simeon from them and bound him before their eyes and afterward commanded to bring Benjamin. And when they understood the matter they confessed their sin saying \"Indeed we are guilty concerning our brother.\" And to this the verse connects \"for the interpreter was between them, \" as it is written \"if there is for him an interpreting angel, one to tell man his uprightness, \" for through the confession there was immediately a good interpreter for them. And this is what is meant by \"for if we had not delayed, by now we would have returned twice, \" as is the way of the righteous that the more they repent the more they regret the previous day that was not at this level, and this is the meaning of \"twice, \" as it is written \"Return, return O Shulamite, return, return\" as explained elsewhere.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Torah, Miketz 15"
        },
        {
            "section": "Festivals",
            "topic": "Rosh Hashanah",
            "number": "4",
            "passage": "(נחמיה ח׳:י׳) ויאמר להם לכו אכלו משמנים ושתו ממתקים ושלחו מנות לאין נכון וכו' כי חדות ד' הוא מעוזכם. ודרשו רז\\\"ל שזה קאי על ר\\\"ה. הנראה לרמז בזה לחזק ידים רפות על מה שאנו רואים כובד הגלות שמתגבר בכל יום כי הוא ענין הנסתר מבני אדם כי באמת הוא טובה גדולה לקרב הגאולה. ונבאר הענין עפ\\\"י משל לרופא מומחא שנכנס אצל החולה בהתחלת החולי שיש לו רק מיחוש בעלמא ועודנו מתחזק כבריא ללכת ברגליו וכאשר בא הרופא אליו לבקרו אומר עליו כי הוא צריך לרחמי' גדולי' ולעסוק ברפואות וסמים. וברבות הימים כאשר הכביד חוליו ושוכב ערש דוי אשר כמעט נתיאשו ממנו נכנס הרופא עוד אליו ואומר לכל הנצבים עליו שלא ידאגו עוד מאומה כי מהר יתרפא ויעמוד מחוליו הקשה הנה בעיני הרואים הוא דבר הפלא ופלא כי הנה בעודנו החולה הזה הולך ומתחזק ברגליו הי' אומר עליו כי הוא מסוכן ועתה כאשר הכביד חוליו ובשרו רזה וכחוש מכף רגליו עד ראשו אין בו מתום הוא אומר עליו כי מהר יתרפא. אך האמת כן הוא כי הרופא הבין כי אז הי' רק התחלה ובוודאי בכל יום יכביד עליו חוליו לכן אז הי' צריך לרפואות ולסמים ולרחמים רבים. אך עתה כאשר עבר עליו כל התלאה הוא בטוח עליו כי יפול עליו זיעה ומהר יתרפא. וכן הוא ג\\\"כ ענין הגלות לפי הנראה בעיני בשר הוא דבר הפלא מדוע עשה ד' ככה. ומי לנו גדול ממשה רבינו ע\\\"ה כאשר ראה קושי השיעבוד הקשה ואמר למה הרעות כו'. והשיב לו הקב\\\"ה וארא אל אברהם כו' לכן אמור לבני ישראל אני ד' והוצאתי אתכם מתחת סבלות מצרים. כי הש\\\"י הי' יודע כי מהר יהי' הישועה כי הקושי שיעבוד ישלים הקץ. וכן ביוסף הי' כזה כל ענין המכירה ואשר שמו אותו בבור הי' תמוה בעיניו כאשר אמר וגם פה לא עשיתי מאומה כי שמו אותי בבור. והאמת הי' כי השיעבוד שלו הי' רק הכנה על גלות מצרים ועל קירוב הגאולה ללקט הני\\\"ק הנפזרים כידוע מספרים שכל ענין הגלות הוא לרבות גרים הם הניצוצות כידוע. לכן אח\\\"כ כשירד יעקב למצרים אמר יוסף והגדתם לאבי כל כבודי במצרים. פי' כל ענין הכבוד והגאולה הי' ע\\\"י ירידתי למצרים. וז\\\"פ בפ' נצבים. ואמרו כל הגוים על מה עשה ד' ככה לארץ הזאת וכו' ואמרו על אשר עזבו וכו'. ולכאורה קשה למה דוקא הגוים יאמרו הלא גם בנ\\\"י יתמהו על כובד יהגלות. אך הפי' בזה כי דוקא הגוים יהיו תולים כי כובד הגלות הוא מחמת אשר עזבו שחטאו בנ\\\"י ושלחם ביד פשעם. אולם הכתוב מסיים ואמר הנסתרות לד' אלהינו והנגלות לנו ולבנינו לעשות כל דברי התורה הזאת. כי ישראל הם מאמינים ובני מאמינים. הם צריכין להבין זאת כי הגלות הוא ענין נסתר ולעתיד הכל ידעו כי הי' לטובה. כמ\\\"ש ישמחו השמים ותג\\\"ל הארץ רומז לשכינה הקדושה. ותג\\\"ל אותיות גלו\\\"ת. ונחזור לעניננו כי בימי עזרא ג\\\"כ היו בנ\\\"י בתכלית השפלות קודם בנין בית שני. לכן אמר להם עזרא לכו אכלו משמני' וכו' ושלחו מנות לאין נכון לו. פי' אפי' מי שלא הכין לבו על הגאולה בתשובה שלימה כראוי בכל ימי הגלות עכ\\\"ז אל תעזבוהו ותחזקו בידו להיות עמכם יחד ולהחזירו בתשובה שלימה. כי חדות ד' הוא מעוזכם פי' כי הבטחת הש\\\"י ב\\\"ה על הגאולה והוא היודע כי מהר יצמיח לכם ישועה. הוא מעוזכם לחזק גם עתה את לבבכם. וכן נזכה לישועה למהר קץ הגאולה במהרה בימינו אמן:",
            "english_translation": "And he said to them, \"Go, eat rich foods and drink sweet drinks and send portions to those who have nothing prepared, for the joy of the Lord is your strength.\" And our sages interpreted this as referring to Rosh Hashanah. It appears to hint at strengthening weak hands regarding what we see of the heaviness of exile that grows stronger each day, for it is a matter hidden from mankind, for in truth it is a great good to bring the redemption closer. And we will explain the matter through a parable of an expert physician who enters to see a sick person at the beginning of the illness when he has only a minor ailment and is still strong like a healthy person walking on his feet, and when the doctor comes to visit him he says about him that he needs great mercy and must deal with medicines and remedies. And after many days when his illness becomes severe and he lies on his sickbed when they have almost given up on him, the doctor enters again and tells all those standing around him not to worry anymore for he will soon recover and rise from his severe illness. Behold in the eyes of observers this is a great wonder, for while the sick person was still walking and strong on his feet he said about him that he was in danger, and now when his illness is severe and his flesh is thin and weak from head to toe with no wholeness in him, he says about him that he will soon recover. But this is indeed the truth, for the doctor understood that then it was only the beginning and certainly each day his illness would become more severe, therefore then he needed medicines and remedies and great mercy. But now when all the hardship has passed over him, he is confident about him that sweat will fall upon him and he will soon recover. And so too is the matter of exile, according to what appears to physical eyes it is a wonder why God did this. And who is greater for us than Moses our teacher peace be upon him, when he saw the difficulty of the harsh bondage and said \"Why have you done evil?\" And the Holy One Blessed be He answered him \"I appeared to Abraham etc., therefore say to the children of Israel I am the Lord and I will bring you out from under the burdens of Egypt.\" For God knew that soon there would be salvation for the harsh bondage would complete the appointed time. And so it was with Joseph, the whole matter of his sale and their putting him in the pit was puzzling in his eyes as he said \"Also here I did nothing that they put me in the pit.\" And the truth was that his bondage was only preparation for the Egyptian exile and for bringing redemption closer to gather the scattered sparks as is known from books that the whole matter of exile is to increase converts who are the sparks as is known. Therefore afterward when Jacob went down to Egypt, Joseph said \"Tell my father of all my glory in Egypt.\" Meaning all the matter of glory and redemption was through my descent to Egypt. And this explains in Parshat Nitzavim: \"And all the nations will say why did God do thus to this land etc. and they will say because they abandoned etc.\" And at first glance it is difficult why specifically the nations will say this, won't the children of Israel also wonder about the heaviness of exile. But the explanation of this is that specifically the nations will attribute that the heaviness of exile is because they abandoned that the children of Israel sinned and He sent them away through their transgression. However the verse concludes saying \"The hidden things belong to the Lord our God and the revealed things to us and to our children to do all the words of this Torah.\" For Israel are believers and children of believers. They need to understand this that exile is a hidden matter and in the future all will know that it was for good. As it is written \"The heavens will rejoice and the earth will rejoice\" alluding to the holy Divine Presence. And \"rejoice\" has the same letters as \"exile.\" And we return to our matter that in the days of Ezra also the children of Israel were in the depths of lowliness before the building of the Second Temple. Therefore Ezra said to them \"Go eat rich foods etc. and send portions to those who have nothing prepared.\" Meaning even one who has not prepared his heart for redemption with complete repentance properly throughout all the days of exile, nevertheless do not abandon him and strengthen his hand to be together with you and return him in complete repentance. \"For the joy of the Lord is your strength\" means that God's promise about redemption and He who knows that He will soon cause salvation to sprout for you, that is your strength to strengthen even now your hearts. And so may we merit salvation to hasten the end of redemption speedily in our days, Amen.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Festivals, Rosh Hashanah 4"
        },
        {
            "section": "Torah",
            "topic": "Vayeshev",
            "number": "6",
            "passage": "במס' ברכות דף כ\\\"ז. כשמינוהו את ר' אלעזר לנשיא א\\\"ל איזיל ואימלך באינשי ביתי' אזיל ואמליך בדביתהו. אמרה לי' דלמא מעברין לך. א\\\"ל יומא חדא לישתמש אינש בכסא דמוקרא ולמחר ליתבר א\\\"ל לית לך חיוורתא ע\\\"ש בגמ'. הנראה לרמז בזה בדבריהם ז\\\"ל כי הנה בכל דבר מעלה ומדריגה טרם תתנשא על מכונה צריך להיות לה בחי' שבירה בתחלה כמו שהי' זה בשעת בריאת העולם בראשית ברא כו'. והארץ היתה תהו ובוהו כי בתחלת הבריאה לא יכלו לסבול את האור הגדול ונשברו ונעשו בחי' תהו ואח\\\"כ נתקנו ויאמר אלהים יהי אור כי עיקר התיקון על מכונו או\\\"א להיות רק אחר השבירה והירידה מתחלתו והירידה היא צורך העלי'. וכן נאמר אצל יוסף כשהתחיל להתנשא ויאמרו לו אחיו המלוך תמלוך עלינו. כי אי אפשר לך זה רק אחר השבירה והירידה מתחלה לכך ויוסף הורד מצרימה ומשם הוא נתעלה אח\\\"כ ונתקן למלוך אמנם בחי' התיקון אחרי השבירה זה בא ע\\\"י בחי' זקן שהוא מבחי' אריך ועתיק והוא בא ע\\\"י י\\\"ג מדות שהאור עובר בהם בבחי' מדה וצמצום. וזהו הענין שהי' אצל הלוחות שהלוחות הראשונים ניתנו בפומבי ובשפע האור הרב ולכך נשברו. אבל בהלוחות השניות נאמר אצלם הי\\\"ג מדות ושכותי כפי עליך שהי' האור בחי' צמצום ומסך מעט ושם נאמר פסל לך שני לוחות אבנים כראשונים. וזה הענין בגדלות ראשון וגדלות שני האמור בכתבי האריז\\\"ל כי ההארה צריך לעבור דרך דרגין כיל\\\"ח. וזה הענין שאמרו בגמ' כי האדם במעי אמו מתחלה הוא יודע כל התורה ואח\\\"כ בצאתו בא מלאך וסטרו על פיו ומשכח הכל כי כן צריך להיות בחי' ההארה והידיעה באדם מתרבה והולכת עמו מעט מעט כפי שניו דרך דרגין דאם לא כן לא הי' יכול לסבול את האור הגדול הקודם. ולכך בא מלאך וסטרו על פיו הוא בחי' השבירה כמו שנתבאר. הנה זה הענין אצל ר\\\"א בן עזרי' כשבא להיות נשיא פתאום א\\\"ל דלמא מעברין לך כי ההתנשאות צריך להיות בחי' שבירה בתחלה כנ\\\"ל. וזה שא\\\"ל יומא חדא לישתמש אינש בכסא דמוקרא ולמחר ליתבר. כי אחרי הבריאה מתחלה בחי' יום אחד ולמחר ליתבר נעשה השבירה. וזה שא\\\"ל והא לית לך חיוורתא כי צריך להמשיך מבחי' י\\\"ג מדות חוורתי כמו שהי' אצל יוסף בצאתו לאסור שריו בנפשו וזקניו יחכם מהזקן עד החכמה זקן זה שקנה חכמה. וזה שאמרו שם ההוא יומא בר י\\\"ח שנין הוה אתעביד לי' ניסא ואהדרי לי' תמני סרי דרי חיורתא. הוא כמו שנתבאר בע\\\"ח בחי' ברכאין. וזהו רמז על י\\\"ג תקוני דיקנא דא\\\"א וה' ראשונים שלו כיל\\\"ח ע\\\"ש.וזהו תמני סרי דרי חיוורתא מבחי' הזקן שלמעלה כמו שנתבאר:",
            "english_translation": "In Tractate Berachot page 27, when they appointed Rabbi Elazar as Nasi, he said \"I will go and consult with my household.\" He went and consulted with his wife. She said to him \"Perhaps they will remove you.\" He said to her \"Let a person use a precious cup for one day, and if it breaks tomorrow, let it break.\" She said to him \"You have no white hair.\" The hint in this appears to be that in every matter of elevation and rank, before it can be established firmly, it must first experience breaking, as was the case during the creation of the world \"In the beginning created etc.\" and \"The earth was formless and void\" because at the beginning of creation they could not bear the great light and broke and became chaos, and afterward were fixed \"And God said let there be light\" for the main fixing in its proper place can only come after the breaking and initial descent, and the descent is necessary for ascent. And so it is said regarding Joseph when he began to rise up, his brothers said to him \"Will you indeed reign over us.\" For this is impossible except after breaking and initial descent, therefore \"Joseph was brought down to Egypt\" and from there he was later elevated and established to rule. However, the aspect of fixing after breaking comes through the aspect of elder which is from the aspect of Arich and Atik and comes through the 13 attributes through which the light passes in measured and constrained form. And this is the matter that occurred with the tablets, that the first tablets were given publicly with abundant light and therefore broke. But with the second tablets the 13 attributes were stated and \"I will cover you with My hand\" where the light was constrained and slightly screened, and there it says \"Carve for yourself two stone tablets like the first ones.\" And this is the matter of first maturity and second maturity mentioned in the writings of the Arizal, for the illumination must pass through levels gradually. And this is what they said in the Gemara that a person in his mother's womb initially knows the entire Torah and afterward when he emerges an angel comes and strikes him on his mouth and he forgets everything, for so must the illumination and knowledge in a person increase gradually with his years through levels, for if not he would not be able to bear the great prior light. Therefore an angel comes and strikes his mouth which is the aspect of breaking as explained. This is the matter with Rabbi Elazar ben Azariah when he came to be Nasi suddenly, she said to him \"Perhaps they will remove you\" for elevation requires initial breaking as mentioned. And this is what he said \"Let a person use a precious cup for one day and tomorrow let it break.\" For after creation initially there is one day and tomorrow breaking occurs. And this is what she said to him \"But you have no white hair\" for one must draw from the aspect of 13 white attributes as was with Joseph when he went out to bind his officers to his soul and his elders became wise from the elder to wisdom - an elder who has acquired wisdom. And this is what they said there that on that day he was eighteen years old and a miracle occurred and eighteen rows of white hair appeared. This is as explained in Etz Chaim regarding blessings. And this hints to the 13 fixes of the beard of Arich Anpin and its first five as known there. And these are the eighteen rows of white from the aspect of the supernal beard as explained.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Torah, Vayeshev 6"
        },
        {
            "section": "Torah",
            "topic": "Vayeshev",
            "number": "8",
            "passage": "ויאמר יעקב הלא אחיך רועים בשכם כו' לך נא ראה את שלום אחיך כו'. יש להמשיך הכתובים הנ\\\"ל בדרך רמז. עפ\\\"י הגמרא ברכות דף ג' ע\\\"א.אמר ר' יוסי פעם אחת כו' ונכנסתי לחורבה אחת מחורבות ירושלים להתפלל בא אליהו כו' ושמר לי על הפתח כו' ואמר לי בני מפני מה נכנסת לחורבה זו אמרתי לו להתפלל ואמרלי הי' לך להתפלל בדרך. יבואר עפ\\\"י מה שמצינו בספרים פי' על המאמר בפרקי אבות דע מה למעלה ממך. פי' לפי גודל הצער שהאדם יש לו בדוחק ובצער יש להתבונן מה שנוגע למעלה בכפלי כפליים בצער גלות השכינה כביכיל עמו אנכי בצרה. וזה דע מה למעלה ממך מן הצער שלך תדע הצער שלמעלה כביכול. לכן היו כמה צדיקים אשר לא הסתכלו כלל על דוחק וצער של בנ\\\"י רק על כללות צער השכינה וכל ימיהם רק זאת הם מצפים ומיחלים על גדלות הבורא ב\\\"ה בקנאת ה' צבאות כמ\\\"ש באליהו הנביא ע\\\"ה קנא קנאתי כו'. אכן בדור שלאחריו יונה בן אמיתי שהי' תלמידו של אליהו לא רצה ללכת בשליחות הנבואה אל נינוה שלא יהי' ח\\\"ו קטרוג על בנ\\\"י כידוע. כי באמת לא זו הדרך ישכון אור הצלחת הצדיק רק כאשר יסתכל ג\\\"כ על טובת בנ\\\"י לעורר עליהם רחמים וחסדים ולהצטער בצרתם. ועיין בעין יעקב בהכותב בפי' הגמ' אר\\\"י פעם אחת נכנסתי לחורבה אחת מחורבות ירושלים. פי' מחשבתו הי' להצטער בצער גלות השכינה וזה חורבות ירושלים. ובא אליהו ושמר על הפתח. אמר לו הי' לך להתפלל בדרך. פי' בעוד שהם הולכים בדרך שהם בגלות להתפלל עליהם להשפיע להם כל טוב להצילם מעניים ומרודם וזה הרמז בפ' הנ\\\"ל באחי יוסף והנה אנחנו מאלמים אלומים בתוך השדה. פי' שהיו מצטערים בצער גלות השכינה ועל חורבן ירושלים דכתיב ציון שדה תחרש והיו מצפים רק על רוממת כבודו ית\\\"ש.וז\\\"ש ג\\\"כ כאן הלא אחיך רועים בשכ\\\"ם ר\\\"ת ברוך שם כבוד מלכותו. וז\\\"ש לו יעקב לך נא ראה את שלום אחיך לראות בטובתם ולהשפיע להם בעודם בגלות. וז\\\"ש וימצאהו איש ויאמר לו מה תבקש. ר\\\"ל מהו עיקר בקשתך. כי על צער גלות השכינה לבד איננה צריכה לרחמנות שלנו כי כביכול הש\\\"י הוא כל יכול לעזור א\\\"ע כרגע כמ\\\"ש ואתה ה' לעולם תשב. רק למה לנצת תשכחנו תעזבנו לאורך ימים. עיקר הצער על אורך הגלות שאנו בנ\\\"י דווים וסחופים. לכן כאשר שמע יוסף דברים הללו השיב לו את אחי אנכי מבקש. פי' טובתם של בנ\\\"י אני מבקש ומצפה לראות בטובתם וישועת' לנצח. ולעורר רחמים עליהם:",
            "english_translation": "And Jacob said, \"Are not your brothers shepherding in Shechem? Go now, see the welfare of your brothers.\" The above verses can be connected through allusion, according to the Talmud Berachot page 3a. Rabbi Yosi said one time I entered one of the ruins of Jerusalem to pray, and Elijah came and guarded the entrance, and said to me, \"My son, why did you enter this ruin?\" I said to him, \"To pray, \" and he said to me, \"You should have prayed on the road.\" This is explained according to what we find in the books interpreting the saying in Pirkei Avot \"Know what is above you.\" According to the greatness of the suffering that a person has in distress and pain, one should contemplate what affects above in multiple times the pain of the exile of the Divine Presence, as it were \"I am with him in distress.\" This is \"know what is above you\" - from your pain you should know the pain above, as it were. Therefore there were many righteous ones who did not look at all at the distress and pain of the Children of Israel, only at the general pain of the Divine Presence, and all their days they only anticipated and hoped for the greatness of the Creator, blessed be He, in the zealousness of the Lord of Hosts, as it is written regarding Elijah the Prophet, \"I have been very zealous.\" However, in the generation after him, Jonah son of Amitai, who was Elijah's student, did not want to go on the prophetic mission to Nineveh so there would not be, Heaven forbid, prosecution against the Children of Israel, as is known. For truly this is not the path where the light of the righteous one's success dwells, only when he also looks at the good of the Children of Israel to arouse mercy and kindness for them and to feel pain in their distress.",
            "average_score": 7.5,
            "reference": "Tiferet Shlomo, on Torah, Vayeshev 8"
        },
        {
            "section": "Torah",
            "topic": "Vayeshev",
            "number": "17",
            "passage": "ויהי יוסף יפה תואר ויפה מראה. ערש\\\"י כשראה עצמו מושל התחיל אוכל ושותה ומסלסל בשערו אמר הקב\\\"ה אביך מתאבל עליך כו' ע\\\"ש. הנה יש להבין באמת מה היתה דעת יוסף בזה הלא ידע בצערו של אביו וכמ\\\"ש ראובן אנה אברח מצערו של אבא. אך הנה יבואר ע\\\"ד שאמר ר' יהושע לר\\\"ג אי אתה יודע בצערן של תלמידי חכמים. כי הנה ר\\\"ג הוא שהיה במדריגה העליונה מופשט מתאוות עוה\\\"ז והי' נשיא ומנהיג הדור לתקן אך נשמות ישראל למעלה וכמ\\\"ש דמות צורות לבנו' היה לו לר\\\"ג בעלייתו ובחי' לבנה היא השכינה כנודע ובה היה מסתכל להיו' כל ישראל בני עליה ולכך כשהסתכל למעלה על נשמת ר' יהושע וחביריו הנה הם גדולים וטובים בעיניו. ולא דאג עליהם כלל מי יתן כל ישראל כמותם. אבל ר' יהושע אמר לו כי צריך להסתכל גם למטה בעוה\\\"ז על פרנסת ישראל לבל יחסר להם כל טוב. וזה אי אתה יודע בצערן של ת\\\"ח בעוה\\\"ז כנ\\\"ל. והנה כן השבטים שהיו אצל אביהם המה ראו בעיניהם צערו ואבלו של יעקב אביהם ימים רבים. אבל יוסף הצדיק שהיה מרוחק ממנו והוא שהיה במדריגה העליונה כנ\\\"ל הנה הוא הסתכל רק למעלה. ושם הנה ראה גודל מעלת יעקב אבינו ע\\\"ה דיוקנו של אביו חקוקה בכסא הכבוד וכל שהצטער יותר בעוה\\\"ז הנה נתעלה למעלה יותר ויותר לכך לא דאג כלל על צערו של אביו. וז\\\"ש אוכל ושותה וכו'.אבל הקב\\\"ה אמר כי לא יאות כן רק צריך להסתכל על עניני עוה\\\"ז וז\\\"ש אביך מתאבל כו' וז\\\"ש משפט וצדקה ביעקב אתה עשית. פי' שגם בעת המשפט שם הוא צדקה ביעקב לדורות כי הכל היה תיקון העתיד לזמן הזה. וז\\\"ש לך נא ראה את שלום אחיך. התורה מלמד' להצדיק הדור להסתכל ולראות את שלום אחיך בעוה\\\"ז ואת שלום הצאן. וזהו ענין מעלת נסיעה לצדיק הדור ע\\\"ד בקשת חיי ומזוני בעוה\\\"ז כי למעלה יודעים כי הכל לטובה ואינה רואים שום ריעותא וחסרון בצרכי עוה\\\"ז. אבל הצדיק שהוא אתנו בעוה\\\"ז הנה הוא רואה כל היום בחוסר וצרכי פרנסת עוה\\\"ז וכן שאר דברים בבריאות וכדומה. לכן הנה הוא מתפלל על עמו כל הימים לכן הוא מפיק להם ברכה וחיים ושלום. אמן:",
            "english_translation": "And Joseph was beautiful in form and beautiful in appearance. When he saw himself as ruler he began eating and drinking and curling his hair. The Holy One Blessed be He said your father mourns for you etc. Indeed one must understand what was Joseph's thinking in this for he knew of his father's pain as Reuben said where shall I flee from father's pain. But it will be explained as Rabbi Joshua said to Rabban Gamliel you do not know the pain of Torah scholars. For Rabban Gamliel who was on the highest level detached from worldly desires and was prince and leader of the generation to fix only the souls of Israel above and as it is said he had forms of the moon in his upper chamber and the moon aspect is the Divine Presence as is known and in it he would gaze to make all Israel elevated and therefore when he looked above at the soul of Rabbi Joshua and his companions they were great and good in his eyes and he did not worry about them at all if only all Israel were like them. But Rabbi Joshua said to him that one must also look below in this world at Israel's livelihood so they should not lack any good. And this is you do not know the pain of Torah scholars in this world as mentioned above. And so the tribes who were with their father saw with their eyes his pain and mourning for many days. But righteous Joseph who was distant from him and was on the highest level as mentioned above only looked above. And there he saw the greatness of our father Jacob peace be upon him his father's image engraved on the Throne of Glory and the more he suffered in this world the more he was elevated above therefore he did not worry at all about his father's pain. And this is what is meant by eating and drinking etc. But the Holy One Blessed be He said this is not proper rather one must look at worldly matters and this is what is meant by your father mourns etc. And this is what is meant by justice and righteousness in Jacob you have done. Meaning that even at the time of judgment there is righteousness in Jacob for generations for everything was fixing for the future for this time. And this is what is meant by go see the welfare of your brothers. The Torah teaches the righteous of the generation to look and see the welfare of your brothers in this world and the welfare of the flock. And this is the matter of the virtue of traveling to the righteous of the generation regarding requesting life and sustenance in this world for above they know that all is for good and they do not see any fault or lack in worldly needs. But the righteous who is with us in this world sees all day the lack and needs of worldly livelihood and other matters of health and the like. Therefore he prays for his people all the days therefore he brings forth blessing and life and peace. Amen.",
            "average_score": 7.5,
            "reference": "Tiferet Shlomo, on Torah, Vayeshev 17"
        },
        {
            "section": "Torah",
            "topic": "Vayeshev",
            "number": "9",
            "passage": "א\\\"י לך נא ראה את שלום אחיך ואת שלום הצאן וכו'. דהנה מצינו צדיקים גדולים וטובים אשר מעולם המה שלא כוונו כל ימיהם רק על רוממת כבודו ית\\\"ש ולא שתו את לבבם לטובת עוה\\\"ז להשפיע לדורם כמ\\\"ש באליהו הנביא כנ\\\"ל. וכן הי' ענין נדב ואביהוא כתי' בקרבתם לפני ה' וימותו. ומפני כי כל עבודתם הי' רק על כבודו ית\\\"ש כנ\\\"ל. לכן לא הי' להם הנהגה בזה העולם. וכן הי' ענין ער ואונן שהיו נשמות גבוהים מאד כנודע. וחטאו בזה שלא חשבו בטובת אחיהם בעוה\\\"ז כמ\\\"ש לבלתי נתן זרע לאחיו. זרע הוא בחי' האור זרוע לצדיק להצמיח בקרב ישראל יראת שמים והשפעות טובות לכן לא הוטב בעיני ה' כי רוצה ה' בעמו ומרבה להטיב להם ובטובם נתגדל ונתקדש שמו ית' בעולם והנה כן יוסף הצדיק מתחלה לא שת לבו רק לקנא את קנאת ה' צבאות על גדולת הבורא לבד לכן ויבא יוסף את דבתם רעה אל אביהם. כי העבירה הקטנה שנראה לו מהם הי' גדול בעיניו מאד וקנא הוא להשי\\\"ת לכן כתיב וישנאו אותו ולא יכלו דברו לשלום. פי' לא יכלו להתנהג כמדתו. דברו לשון הנהגה. כי לא הוטב בעיניהם מה שלא השגיח להטיב להם. אך כאשר יעקב אמר לו לך נא ראה את שלום אחיך ואת שלום הצאן להשפיע להם. לזאת השיב אל המלאך הדובר עמו את אחי אנכי מבקש להשפיעם כל טוב:",
            "english_translation": "Go now, see to the peace of your brothers and the peace of the flock, etc. For we find great and good righteous ones who were from ancient times who all their days intended only for the exaltation of His blessed glory and did not set their hearts on the good of this world to influence their generation as it is written regarding Elijah the prophet as mentioned above. And so was the matter of Nadav and Avihu, it is written \"when they drew near before God and died.\" And because all their service was only for His blessed glory as mentioned above, therefore they had no conduct in this world. And so was the matter of Er and Onan who were very lofty souls as is known. And they sinned in this that they did not consider the good of their brothers in this world as it is written \"to not give seed to his brother.\" Seed is the aspect of light sown for the righteous to grow fear of heaven and good influences among Israel therefore it was not good in God's eyes for God desires His people and increases goodness to them and through their good His blessed name is magnified and sanctified in the world and so Joseph the righteous at first set his heart only to be zealous for the Lord of Hosts about the Creator's greatness alone therefore Joseph brought their evil report to their father. For the small transgression that appeared to him from them was very great in his eyes and he was zealous for God therefore it is written they hated him and could not speak peacefully to him. The explanation is they could not conduct themselves according to his measure. Speaking means conduct. For it was not good in their eyes that he did not look to benefit them. But when Jacob said to him go now see to the peace of your brothers and the peace of the flock to influence them. To this he responded to the angel speaking with him \"I seek my brothers\" to influence them with all good.",
            "average_score": 7.5,
            "reference": "Tiferet Shlomo, on Torah, Vayeshev 9"
        }
    ],
    "timestamp": "2024-12-25T21:49:57.068693",
    "metadata": {
        "total_passages_processed": 115,
        "selection_criteria": "Passages with average score above 7.0",
        "scoring_version": "3.0"
    }
}