{
    "question_id": "f9ec8ea2-772b-47a0-a349-db7fb5deb7c6",
    "question": "in which scenario can it appear as if a person is lying in his prayers?",
    "selected_passages": [
        {
            "section": "Torah",
            "topic": "Vaetchanan",
            "number": "20",
            "passage": "רק השמר לך ושמור את נפשך מאד כו' ופן יסור מלבבך כל ימי חייך והודעתם לבניך ולבני בניך כו' יום אשר עמדת כו' אשר ילמדון ליראה אותי כל הימים אשר הם חיים עלהאדמה ואת בניהם ילמדון. הנה לכאורה אין קשור לפסוקים הללו. גם מה שאמר פן יסורו מלבבך והודעתם לבניך. כיון שיסורו מלבבו איך יודיעום לבניהם. ונראה לפרש בדרך צחות על אותן בני אדם שהם עסוקים בהבלי עולם ומטפשין ומסירים מעל לוח לבם מצות השי\\\"ת. גם בעמדם בתפלה שפתותיהם נעות ולבם בל עמהם. ורק את בניהם אשר יוולד להם הם מייסרין אותם ללכת אל בית הספר שלא לבטל רגע אחת רק יעסקו בתורה ותפלה. והוא אינו משים אל לבו מה שהוא ממעט בעבודתו ית\\\"ש ואיך ימלא לבבו להוכיח אחרים בשבט מוסר ובניו מומם ואינו מרגיש מומו הפוסל אותו. וזה שמרמז הכתוב השמר לך כו' ופן יסורו מלבבך. ר\\\"ל אתה בעצמך תסור מלילך בדרכי השם. והודעת' לבניך. היינו שתוכיח רק את בניך שהם ילמדו ועל עצמך לא תשגיח כלל. לא זו הדרך ישכון אור רק אשר ילמדון ליראה כו' שהם עצמם ילמדו מקודם ליראה כו' ואח\\\"כ את בניהם ילמדון:",
            "english_translation": "Only take heed to yourself and guard your soul diligently lest you forget and lest it depart from your heart all the days of your life and make them known to your children and your children's children the day you stood when they will learn to fear me all the days that they live on the earth and teach their children. Behold apparently there is no connection to these verses. Also what he said lest they depart from your heart and make them known to your children. Since they depart from his heart how will they make them known to their children. And it seems to explain humorously about those people who are busy with worldly vanities and become foolish and remove from their heart's tablet the commandments of God. Even when standing in prayer their lips move but their hearts are not with them. And only their children who are born to them they discipline them to go to school not to waste a single moment only to engage in Torah and prayer. And he does not take to heart what he diminishes in his service to God and how can he fill his heart to rebuke others with the rod of discipline while his children have blemishes and he does not feel his own blemish that disqualifies him. And this is what the verse hints take heed to yourself lest they depart from your heart meaning you yourself will turn from walking in God's ways. And make them known to your children meaning you will rebuke only your children that they should learn while on yourself you do not watch at all. This is not the way light dwells but rather they should learn to fear that they themselves should first learn to fear and afterward teach their children.",
            "average_score": 9.0,
            "reference": "Tiferet Shlomo, on Torah, Vaetchanan 20"
        },
        {
            "section": "Torah",
            "topic": "Toldot",
            "number": "9",
            "passage": "ויתרוצצו הבנים בקרבה ותאמר אם כן למה זה אנכי כו'. ופרש\\\"י עוברת על פתחי תורה יעקב מפרכס לצאת. עוברת על פתחי ע\\\"ג עשו מפרכס לצאת. הנה בפ' זו מורה לנו התורה הקדושה דרך הישרה לעבודת הבורא ב\\\"ה שיהיה באמת ובתמים ולא יהיה דרכו דרך הפכפך וזר עד ארגיעה לשון שקר. כאשר נמצא רבים מעמי הארץ כי בשעה שעוסק בתורה ותפלה לבבו כלפיד יבער. וכאשר התעיף בו ואיננו כי אחר התפלה תיכף הולך בשרירות לבו חומד ומתאוה. וז\\\"פ הענין וירא אלהים את האור כי טוב כו' ודרשו חז\\\"ל שאיננו ראוי שישתמשו האור והחשך בערבוביא כו'. לכאורה אין להבין איך שייך לומר אור והחשך יחד בערבוביא תרתי דסתרי אהדדי. אך הרמז בזה. כי דרכי התורה ועבודה המה רומזים לאור. ותאוות העולם השפל והנבזה הם דומים לחשך. והאדם צריך לשמור מזה לבל יהי' בערבוביא פוסח על שני הסעיפים פעם הולך בדרכי התורה ופעם פונה לדרכי החשך ח\\\"ו. וכזה פרשנו בפ' צרופה אמרתך מאד ועבדך אהבה. כי זהו הצירוף והבחינה אם התו\\\"מ מביאים את האדם לידי האהבה לבל יסיר מני דרך הישרה. לכן עתה כאשר ראתה רבקה אמנו שהתרוצצו הבנים סברה כי הוא אדם אחד אשר פעם חשקו ללכת לבהמ\\\"ד ופעם חשקו ללכת לפתחי ע\\\"ג כדרך אנשי רשע כאשר יבוא בין הצדיקים יתלוה עמהם לעשות כמעשיהם. וכאשר פונה מהם ופגעו בו אנשים פוחזים וריקים הנה הוא כאחד מהם. לכן ותלך לדרוש את ה' מה יהיה בסופו. כי לא זה הדרך ישכון אור רק כיתד שלא תמוט. לזה כתיב ויאמר ה' לה שני גוים בבטנך. כי באמת הם שנים יעקב ועשו זה פונה לרשעו ותאוותו הרעה. וזה פונה לתומו וצדקתו לעד עומדת בל ימוט לנצח. ובזה יש לרמז מ\\\"ש להלן ויהי אך יצוא יצא יעקב מאת פני יצחק אביו והנה עשו אחיו בא מצידו. לרמז על הנ\\\"ל ויהי לשון צער כאשר נמצא איש הפכפך במעשיו אשר בשעת עשיית המצוה הוא בבחי' יעקב. וכאשר יצא מאת פני יצחק אביו בגמר תפלתו ועבודתו והנה חוזר לסורו נהפך לאיש אחר והנה עשו אחיו בא מצידו. מצידו. כי הסט\\\"א גובר עליו בתאוות עוה\\\"ז. אך צריך האדם להיות חזק ואמיץ כיתד שלא תמוט להשגיח על כל דרכיו בתם וביושר:",
            "english_translation": "And the children struggled within her, and she said if it is so why am I thus, and Rashi explained when she passed by the doors of Torah study Jacob would stir to come out, when she passed by the doors of idol worship Esau would stir to come out, behold in this portion the holy Torah shows us the straight path to serve the Creator blessed be He that it should be in truth and sincerity and one's path should not be fickle and strange until suddenly speaking falsehood, as is found among many common people for in the hour they engage in Torah and prayer their heart burns like a torch, and when you look away it is gone for after prayer they immediately go after their heart's desires lusting and craving, and this explains the matter \"And God saw the light that it was good\" and our sages interpreted that it is not fitting for light and darkness to be used in mixture, at first glance it is incomprehensible how light and darkness could be together in mixture as they contradict each other, but the hint in this is that the ways of Torah and service allude to light, and the desires of this lowly despised world are like darkness, and a person must guard against this so it won't be mixed straddling two branches sometimes going in Torah's ways and sometimes turning to ways of darkness God forbid, and thus we explained the verse \"Your word is very pure and Your servant loves it\" for this is the refinement and test if Torah and commandments bring a person to love so they won't turn from the straight path, therefore now when Rebecca our mother saw the children struggling she thought it was one person who sometimes desired to go to the study hall and sometimes desired to go to doors of idol worship like the way of wicked people when they come among the righteous they join with them to act like them, and when they turn from them and encounter worthless frivolous people behold they are like one of them, therefore she went to inquire of God what would be in the end, for this is not the path where light dwells but rather like an unmovable stake, for this it is written \"And God said to her two nations are in your womb\" for truly they are two Jacob and Esau this one turns to his wickedness and evil desire and this one turns to his integrity and his righteousness stands forever never to be moved, and in this there is a hint to what is written later \"And it happened just as Jacob went out from before Isaac his father and behold Esau his brother came from his hunting\" hinting to the above \"and it happened\" is an expression of distress when there is found a fickle person in their deeds who during performance of a commandment is in the aspect of Jacob, and when he goes out from before Isaac his father upon completing his prayer and service and behold he returns to his ways transformed to another person and behold Esau his brother comes from his hunting, from his hunting because the Other Side overpowers him with worldly desires, but a person must be strong and courageous like an unmovable stake to watch over all his ways in integrity and uprightness.",
            "average_score": 9.0,
            "reference": "Tiferet Shlomo, on Torah, Toldot 9"
        },
        {
            "section": "Festivals",
            "topic": "Shaar Tefillah",
            "number": "12",
            "passage": "ר' אלעזר יהיב פרוטה לעני והדר מצלי. היינו לעורר רחמים בעולם עוד י\\\"ל עפ\\\"י דברי רז\\\"ל מרבה צדקה מרבה שלום. שלום יעשה לי שהנותן צדקה עושה שלום בין הקב\\\"ה להעני. שהעני הולך ומהרהר ח\\\"ו בלבו על הקב\\\"ה לכל הוא נותן פרנסה כו'. ור\\\"א הי' נותן על הכוונה זו. לכן הי' נותן לו בבקר מיד כדי שהעני יהי' יכול להתפלל ולהודות להקב\\\"ה שהזמין לו פרנסתו דאל\\\"כ בשעת התפלה הי' יכול העני ח\\\"ו להיות קורא תגר על הקב\\\"ה. וז\\\"פ ר\\\"א יהיב פרוטה לעני והדר מצלי. היינו העני הי' מתפלל אח\\\"כ: (מכי\\\"ק)",
            "english_translation": "Rabbi Eleazar would give a coin to a poor person and then pray. This is to arouse mercy in the world and also according to the words of our sages, increasing charity increases peace. Peace he will make for me, for one who gives charity makes peace between the Holy One Blessed be He and the poor person. For the poor person goes and contemplates Heaven forbid in his heart about the Holy One Blessed be He that He gives livelihood to all etc. And Rabbi Eleazar would give with this intention. Therefore he would give to him in the morning immediately so that the poor person would be able to pray and thank the Holy One Blessed be He who provided his livelihood, for otherwise during prayer the poor person might Heaven forbid complain against the Holy One Blessed be He. And this is the meaning of Rabbi Eleazar gives a coin to the poor person and then prays, meaning the poor person would pray afterwards.",
            "average_score": 9.0,
            "reference": "Tiferet Shlomo, on Festivals, Shaar Tefillah 12"
        },
        {
            "section": "Festivals",
            "topic": "Shaar Tefillah",
            "number": "23",
            "passage": "הודו לד' כי טוב כי לעולם חסדו. הנה עיקר ההודאה והשבח הוא בשביל כללות ישראל. כי אם האדם נותן הודאה על עצמו. חוץ דהוא גריעות בנפש שאינו שמח בישועת בנ\\י אך הוא ג\\\"כ גרעון בהודאה עצמה. למשל בשנה זו שהקב\\\"ה נתן מטר על הארץ והארץ נתנה יבולה. אם האדם יתן הודאה על עצמו לבד אין ההודאה גדולה כל כך אך אם האדם נותן הודאה על כל העולם שריחם על נפשות האומללים והרעבים אזי נותן האדם הודאה עצומה. ובפרט מי שיש לו קצת עושר אזי בשביל עצמו אינה נחשבת לו כ\\\"כ הטובה הזאת. אבל אם מסתכל על כל העולם כולו אזי רואה גודל החסד שעשה הקב\\\"ה בשנה זאת. וז\\\"פ הכ' הודו לד' כי טוב כי לעולם חסדו. לא תהללו בשביל עצמיכם רק כל אחד יהלל לד' עבור כל העולם שנעשה עמהם חסד. וז\\\"פ הכ' גם את העולם נתן בלבם. כדי להודות ולהלל להקב\\\"ה על כל הטובות ולהתפלל עליהם. וז\\\"פ הכ' ופדויי ד' ישובון ובאו ציון ברנה ושמחת עולם על ראשם שהשמחה לא תהי' על כל אחד לעצמו רק כ\\\"א יהי' שמח בשמחת חבירו ובשמחת כל העולם. ובזה תגדל השמחה על כל העולם ועל הצדיקים עד מאד. ובזה יהי' ששון ושמחה ישיגו. אך לזה צריך להיות לו טהרת הנשמה והנפש לקיים ואהבת לרעך כמוך. וז\\\"פ בידיד נפש כו' בהראות לה נועם זיווך אז תתחזק ותתרפא והיתה לה שמחת עולם. עיקר הרפואה הוא לאדם אם יש לו שמחת עולם מכלל ישראל לראות בישועתם וגדולתם. וכבר אמרתי לפרש בזה דברי הש\\\"ס גדול העונה אמן יותר מן המברך כו' מה טעם לזה. אך הפי' בזה דמצינו תפלות בלשון יחיד דהיינו ברכת השחר שלא עשני עכו\\\"ם וכן כל הברכות כולם הולכים כל אחד ואחד לעצמו. פוקח עורים מלביש ערומים כמבואר במס' ברכות א\\\"כ אם אדם עונה אמן על ברכת חבירו ונותן הודאה לשמים על שחבירו נברא יהודי ורואה בעינים ויש לו מלבושים ושאר ענינים אזי גדול העונה אמן יותר מן המברך. כי זה מברך על עצמו וזה מברך על חבירו. וזה הי' מעלת יתרו ששמח על הטובה אשר עשה ד' לישראל. ויאמר ברוך ד' אשר הציל אתכם מיד מצרים שהוא לא הי' במצרים בכלל השיעבוד ונתן הודאה על ישראל. וזה כוונת המד\\\"ר שזהו הי' גנאי לישראל שלא ברכו להקב\\\"ה עד שבא יתרו ונתן הודאה. והרי ישראל אמרו שירה מקודם. אך הם נתנו הודאה על עצמם וזה אין כל כך חשיבות. אבל יתרו נתן הודאה על אחרים והוא דבר גדול ודו\\\"ק. וז\\\"פ רבים אומרים לנפשי מי יראנו טוב נסה עלינו אור פניך כו' היינו שהם מבקשים עבור עצמם. אבל אני איני כן. נתת שמחה בלבי מעת דגנם ותירושם רבו. וז\\\"פ צדקתך לא כסיתי בתוך לבי היינו בעת שהתפללתי והי' עת רצון לא המשכתי את הישועה לעצמי רק נחלק בשוה עם כל העולם. וזהו לא כחדתי חסדך ואמתך לקהל רב ובזה אתה ד' לא תכלא רחמיך ממני. היינו כל המבקש על חבירו והוא צריך לאותו דבר הוא נענה תחלה דהיינו אם אחד יש לו פרנסה ממסחר התבואה ומתפלל על הגשמים ובשעת הזול אין לו פרנסה. וז\\\"פ והוא צריך לאותו הדבר שיהי' ח\\\"ו יוקר. אז הוא נענה תחלה. כי לא על הלחם לבדו יחי' האדם כו'. וז\\\"פ בגמ' תבוא מארה למי שאשתו ובניו מברכים לו. למה דוקא ברכת המזון. אך הפי' שהוא נותן הודאה רק על מה שאשתו ובניו יש להם פרנסתם. רק ההודאה צריך להיות על כלל העולם. וז\\\"פ הגמ' אצל בועז דכתי' וייטב לבו שהי' מברך ברכת המזון. פי' בשעה שהי' בגורן וראה הברכה בתבואות הי' מברך להקב\\\"ה על הכלל ישראל. וז\\\"פ כי פקד ד' את עמו לתת להם לחם. להם דייקא. משום הכי כתי' כי שמעה. הא כולם שמעו. אלא פי' שמעה לשון שמחה מכלל ישראל ולא השגיחה על עצמה כלל. וז\\\"ש בישעי' ס\\\"ג חסדי ד' אזכיר כעל כל אשר גמלנו ד' ורב טוב לבית ישראל אשר גמלם כרחמיו וכרוב חסדיו ודו\\\"ק. וז\\\"פ הפ' כהניה בעיר גוועו כי בקשו אוכל למו וישיבו את נפשם היינו שהפרנסה אשר בקשו לא הי' רק עבור עצמם. וכן תשובה עבור עצמם. לפי שגם התשובה וכפרת עוונות צריך האדם להתפלל עבור כלל ישראל. וז\\\"פ על זאת יתפלל כל חסיד אליך לעת מצוא רק לשטף מים רבים אליו לא יגיעו. מים הם החסדים. והוא מתפלל רק עבור כלל ישראל לטובתם. אפי' אם הוא אינו נהנה כלל מן החסדים. וזה כל העולם ניזון בשביל חנינא בני כו'. וזהו נפתלי אילה שלוחה הנותן אמרי שפר. אילה היא החסידה שבחיות. והתפלה הזאת בוקעת כל הרקיעים. וז\\\"ש אם שגורה תפלתי בפי. היינו שהוא מתפלל עבור הכלל. התפלה זאת מקובלת ברצון. וז\\\"ש בש\\\"ס אין הקב\\\"ה מואס בתפלתם של רבים שנאמר הן אל כביר לא ימאס. ואמאי אין נשמע עדיין. אך הפי' אם כל אחד מתפלל על חבירו וצרכי רבים אזי תפלתו נשמעת. ובזה י\\\"ל העוסק בתורה ובגמ\\\"ח ומתפלל עם הצבור מעלה אני עליו כאלו פדאני לי ולבני מן הגלות. ג\\\"כ הפי' כן בכל מה שעוסק בתורה הוא עושה עם הצבור דהתורה מגינה ומציל כוונתו בלימודו שכל הצבור יהיו ניצולים מעבירות שבידם. ובגמילות חסדים כוונתו עם הצבור שהשכר של גמ\\\"ח יהי' ג\\\"כ עם הצבור. וכן מתפלל עם הצבור לטובת כלל ישראל",
            "english_translation": "Give thanks to the Lord for He is good, for His kindness endures forever. The main thanksgiving and praise is for the entirety of Israel. For if a person gives thanks only for himself, besides being a deficiency in the soul for not rejoicing in the salvation of others, it is also a deficiency in the thanksgiving itself. For example, in this year when the Holy One Blessed be He gave rain upon the earth and the earth yielded its produce, if a person gives thanks only for himself the thanksgiving is not so great, but if a person gives thanks for the whole world that He had mercy on the souls of the wretched and hungry, then the person gives tremendous thanks. And especially one who has some wealth, for himself this goodness is not considered so significant. But if he looks at the whole world, then he sees the greatness of the kindness that the Holy One Blessed be He did this year. And this explains the verse \"Give thanks to the Lord for He is good, for His kindness endures forever\" - do not praise for yourselves alone, rather each one should praise the Lord for the whole world with whom kindness was done. And this explains the verse \"Also the world He placed in their hearts\" - in order to give thanks and praise to the Holy One Blessed be He for all the good and to pray for them. And this explains the verse \"And the redeemed of the Lord shall return and come to Zion with song and eternal joy upon their heads\" - that the joy will not be for each one alone, rather each one will rejoice in his fellow's joy and in the joy of the whole world. And through this the joy will greatly increase for the whole world and for the righteous. And through this \"they will achieve gladness and joy.\" But for this one needs purity of soul and spirit to fulfill \"love your neighbor as yourself.\"",
            "average_score": 8.5,
            "reference": "Tiferet Shlomo, on Festivals, Shaar Tefillah 23"
        },
        {
            "section": "Torah",
            "topic": "Miketz",
            "number": "4",
            "passage": "ויהי מקץ וכו'. פרש\\\"י כל לשון קץ סוף הוא. הנראה לרמז בדבריו הקדושים עפ\\\"י מ\\\"ש בפי' הפיוט קדם רבון עלמין במילין סתימין וכו'. להורות לכל איש בגשתו אל הרנה ואל התפלה על כל מחסורו בעניני עוה\\\"ז אשר יחסר לו לא ישים מגמתו על מצוקותיו רק יהיה עיניו ולבו על גודל צער גלות השכינה כמ\\\"ש בספרים על המשנה באבות דע מה למעלה ממך. פי' מהחסרון שחסר לך למטה תוכל להבין החסרון שנוגע למעלה צער גלות השכינה. וז\\\"ש ושמחתים בבית תפלתי תפלתם לא נאמר אלא תפלתי. פי' שיהיה עיקר תפלתם למען כבודו ית\\\"ש. וזה הרמז בגמ' שנים שנכנסו להתפלל. פי' בשעת התפלה צריך להיות בשני בחי'. מה שנוגע למעלה וגם בצרכי נפשו למטה. לכן במשה רבינו כשהיה מתפלל עבור אחותו כתיב אל נא רפא נא לה. הרמז בזה רפא נא לה' האחרונה בשם הוי' לעשות היחוד למעלה ואז ממילא תתרפא. וז\\\"פ לא על צדקותינו אנחנו מפילים תחנונינו לפניך כי על רחמיך הרבים. וז\\\"ש ואתה ברחמיך הרבים עמדת להם בעת צרתם. פי' שהעמידו נגד עיניהם צער גלות השכינה שהקב\\\"ה כביכול סובל גודל צער בנ\\\"י וכאשר באו למדריגה זו לעורר רחמי שמים אז נצמח להם הישועה רבת את ריבם. העולה מזה כי גם בכל נוסח התפלה שאנו מתפללים בשמ\\\"ע רפאנו ברך עלינו וכדומה הנראי' לעיני בשר כי הם דברים פשוטים הנצרכים בעוה\\\"ז. אמנם הם עומדים ברומו של עולם. וז\\\"פ קדם רבון עלמין במילין סתימין. כי במחשבה היא דברים סתומים לכן עולה לרצון למעלה. וז\\\"ש שועתנו קבל ושמע צעקתנו יודע תעלומות. פי' מה שאנו צועקים על מחסורינו אתה היודע תעלומות לבבנו כי כל כוונתינו על צער גלות השכינה כנ\\\"ל. ונחזור לענין הנ\\\"ל שזה רמז בדברי רש\\\"י במתוק שפתיו. רהי מקץ כל לשון קץ. פי' הצדיק כזה אשר כל לשונו בתפלתו הוא רק על הקץ ומצפה לישועת ה'. סוף הוא. פי' הוא אשר יזכה להיות בסוף ולראות במהרה בישועה ונחמה בבוא הגאולה ב\\\"ב. אמן:",
            "english_translation": "And it came to pass at the end etc. Rashi explains that every expression of 'end' means conclusion. It appears to hint in his holy words according to what is written in the explanation of the poem 'Before the Master of Worlds' with hidden words etc. To instruct every person when approaching prayer and supplication for all his needs in matters of this world that he lacks, he should not focus on his distress but rather have his eyes and heart on the great pain of the Divine Presence in exile as written in the books on the Mishnah in Avot know what is above from you, meaning from the lack that you lack below you can understand the deficiency that affects above the pain of the Divine Presence in exile. And this is what is said 'And I will gladden them in My house of prayer' - it does not say their prayer but rather My prayer, meaning that the main prayer should be for His blessed glory. And this is the hint in the Gemara two who entered to pray, meaning during prayer one needs to be in two aspects - what affects above and also one's personal needs below. Therefore with Moses when he prayed for his sister it is written please heal her please, hinting heal please to the final letter in God's name to create unity above and then automatically she will be healed. And this explains not for our righteousness do we cast our supplications before You but for Your great mercy. And this is what is said and You in Your great mercy stood for them in their time of trouble, meaning they set before their eyes the pain of the Divine Presence in exile that God as it were suffers the great pain of Israel and when they reached this level to arouse heavenly mercy then salvation sprouted for them fighting their fight. Rising from this that also in all the prayer text that we pray in the Amidah heal us bless us and similar which appear to physical eyes as simple things needed in this world, however they stand at the height of the world. And this explains Before the Master of Worlds with hidden words, for in thought they are hidden things therefore they rise favorably above. And this is what is said accept our plea and hear our cry Knower of Hidden Things, meaning what we cry about our needs You who knows hidden things of our hearts for all our intention is about the pain of the Divine Presence in exile as mentioned above. And returning to the above matter this is hinted in Rashi's words with his sweet lips and it came to pass at the end every expression of end, meaning such a righteous person whose every word in prayer is only about the end and anticipates God's salvation. It is the end, meaning he who will merit to be at the end and see quickly salvation and comfort when redemption comes speedily in our days Amen.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Torah, Miketz 4"
        },
        {
            "section": "Torah",
            "topic": "Noach",
            "number": "16",
            "passage": "במס' סנהדרין דף ק\\\"ח ע\\\"ב (אורשינא פירש\\\"י עוף ששמו חול בלשון המקרא ואינו מת לעולם) אשכחי' אבא דגני בספנא דתיבותא א\\\"ל לא בעית מזוני. א\\\"ל חזיתיך דהות טרידא אמינא לא אצערך. א\\\"ל יהא רעווא דלא תמות שנאמר ואומר עם קני אגוע וכחול ארבה ימים. הנראה ללמוד מזה כי כן יש בחי' צדיקים אשר קוראים אל ה' והוא יענם כמ\\\"ש בצרתה לי קראתי ויענני ובכל עת צרכותם קוראים אל ה' וכמ\\\"ש ונצעק וכו' וישמע את קולנו וכו' ויש בחי' צדיקים אשר אינם צועקים כלל על ענינם כמ\\\"ש טוב ויחיל ודומם לתשועת ה' ורק ברצון ובמחשבה לבד הם מצפים לישועה וכמ\\\"ש בזוה\\\"ק אצל אלישע לא בעינא לאטרוחי למארא וכמ\\\"ש באסתר לו. בקשה דבר. ועל הבחי' האלו נאמר רצון יראיו יעשה ואת שועתם ישמע ויושיעם. כי המעלה הראשונה הוא אשר ברצון לבד היא העליונה עליהם אמר הכתוב רצון יראיו יעשה. ואחרי' ואת שועתם ישמע ויושיעם שצועקים ונענים. וכזה היה ענין נח שלא התפלל כלום בכל צרתם רק נאמר ויזכור אלהי' את נח מאליו בא הזכרון בלא תפלה. ולכך אנו אומרים בפסוקי הזכרונות בר\\\"ה וגם את נח באהב' זכרת מעצמו עלה בזכרונך טוב לפניך כי אתה זוכר מעשה כולם ואין שכחה לפני כסא כבודך כמו כן תעלה זכרונינו לפניך בלא תפלה. ואח\\\"כ בשופרות אנו מזכירין רק קול בעלמא:",
            "english_translation": "In Tractate Sanhedrin page 108b (Phoenix, as Rashi explained, is a bird called Chol in Scripture that never dies) he found father lying in the ark's storage. He said to him: \"Do you not need food?\" He replied: \"I saw you were busy and said I will not trouble you.\" He said: \"May it be His will that you shall not die, as it is said 'Then I said, I shall die with my nest, and multiply my days like the phoenix.'\" From this it appears that there are types of righteous ones who call to God and He answers them, as it is written \"In my distress I called and He answered me, \" and in all times of need they call to God, as it is written \"And we cried out etc. and He heard our voice etc.\" And there are types of righteous ones who do not cry out at all about their matters, as it is written \"It is good to wait silently for God's salvation, \" and only with will and thought alone do they await salvation, as mentioned in the holy Zohar regarding Elisha \"I do not wish to trouble the Master\" and as said about Esther \"she did not request anything.\" And about these types it is said \"He fulfills the desire of those who fear Him, and He hears their cry and saves them.\" For the first level which is with will alone is the highest, about them Scripture says \"He fulfills the desire of those who fear Him.\" And after that \"and He hears their cry and saves them\" who cry out and are answered. And such was Noah's matter, that he did not pray at all in all their distress, rather it only says \"God remembered Noah\" - the remembrance came on its own without prayer. Therefore we say in the Remembrance verses on Rosh Hashana \"And Noah too You remembered with love\" - he arose in Your good remembrance on his own, for You remember everyone's deeds and there is no forgetting before Your throne of glory, likewise may our remembrance arise before You without prayer. And afterwards in the Shofar verses we only mention sound alone.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Torah, Noach 16"
        },
        {
            "section": "Festivals",
            "topic": "Shemini Atzeret",
            "number": "27",
            "passage": "ה' עוז לעמו יתן ד' יברך את עמו בשלום. ויהיו נא אמרינו לרצון לפני אדון כל. הסמיכות של ב' הפסוקים הללו. נקדים לפרש הפסוק בתהלים. יפיפית מבני אדם הוצק חן בשפתותיך. חגור חרבך על ירך גבור הודך והדרך. עוד נקדים לפרש הפסוק. כל ארחות ד' חסד ואמת לנוצרי בריתו ועדותיו. דהנה ידוע שברית הלשון וברית המעור מכוונים זה כנגד זה כמבואר בספרים הקדושים דאם האדם איננו שומר את הדיבור אז ממילא בא לידי פגם הברית ח\\\"ו כמ\\\"ש בס' ראשית חכמה ובס' תומר דבורה על פסוק אל תתן את פיך לחטיא את בשרך. בשרך היינו הברית קודש כמ\\\"ש ועל בריתך שחתמת בבשרנו ע\\\"ש. ומכ\\\"ש אם ח\\\"ו האדם חוטא בברית פשיטא שאין תפלתו נשמעת ואין תורתו עולה למעלה. ובזה פרשתי המשנה אל תרבה שיחה עם האשה כו' מכאן אמרו המרבה שיחה כו' ובוטל מדברי תורה היינו שמבטלים דברי תורה שלו שלמד ושילמוד הכל הולך לסט\\\"א וכעין שאמרו מדאורייתא בביטול בעלמא סגי ולהוי כעפרא כו' אמרו פ\\\"ה גימט' מיל\\\"ה ובזוהר הקדוש \\\"מי \\\"יעלה \\\"לנו \\\"השמימה ר\\\"ת מילה. דהיינו אם האדם שומר את הברית אז תפלתו עולה השמימה. ובזה פרשתי והי' עקב תשמעון. עקב הוא שמירת הברית כידוע. ושמר ד' אלהיך לך את הברית לא יהי' בך עקר ועקרה ודרשו רז\\\"ל לא תהי' תפלתך עקורה היינו ע\\\"י שמירת הברית לא תהי' תפלתך עקורה ותהי' נשמעת למעלה. ובז\\\"פ נצור לשונך מרע ושפתיך מדבר מרמה. כפל הלשון לשונך ושפתיך. רמוז על שמירת הלשון וברי\\\"ק. וכ\\\"ז שהאדם אינו נשמר משמירת הברית ושמירת הפה אין המצות ומעש\\\"ט שלו הולכים למעלה רק לסט\\\"א ח\\\"ו. ולזה אמר מי האיש החפץ חיים כו' נצור לשונך מרע. ולזה אמר כל ארחות ד' חסד ואמת לנוצרי בריתו ועדותיו. דהיינו שהחסדים הולכים רק לבני ישראל שהם נוצרי בריתו ועדותיו. ונבוא לביאור הפסוקים הללו. יפיפית מבני אדם הוצק חן בשפתותיך. הנה ידוע שלא נכתב לשון חן רק לשומרי בריתו כגון אצל נח כתיב ונח מצא חן בעיני ד'. שכל דורו לא היו שומרים את הברית ונח שמר בריתו. ואצל יוסף כתיב ג\\\"כ לשון חן וימצא חן בעיניו. ויתן חנו בעיני שר בית הסוהר. וזהו חן וכבוד יתן ד' לא ימנע טוב להולכים בתמים. תמים הוא מי ששומר הברית כידוע בזוה\\\"ק. ויעקב איש תם נח צדיק תמים. ולזה יתן להם חן ולא ימנע טוב שיסוד העליון נקרא טוב כידוע. ולזה אמר הוצק חן בשפתותיך. היינו שהתפלות יתקבלו למעלה. וגם מצא חן בעיני ד' וע\\\"ז אמר מהיכן האדם זוכה לזה. חגור חרבך על ירך גבור הודך והדרך היינו שמירת היסוד כמבואר בזוהר הקדוש (פ' וארא דף כ\\\"ו). שפסוק הזה מרמז על שמירת הברית. ולזה אמר ד' עוז לעמו יתן הוא ספירת היסוד כמבואר בכוונת האר\\\"י ז\\\"ל ד' יברך את עמו בשלום. שלום הוא ג\\\"כ יסוד כמ\\\"ש במקום אחר מזה. ולזה אמר ויהיו נא אמרינו לרצון לפני אדון כל. אדון הוא ספירת המלכות כידוע כל הוא ספירת היסו\\\"ד כמבואר בכתבי האר\\\"י ז\\\"ל על ואתה מושל בכל ע\\\"ש. אדו\\\"ן כ\\\"ל הוא יחוד הוי' אדנ\\\"י וק\\\"ל. ולזה אנו אומרים בברכת המזון. במרום ילמדו עליו ועלינו זכות שתהא למשמרת שלום. היינו שמירת הברית הוא יסו\\\"ד ונמצא חן ושכל טוב וכו' שלאחר שמירת היסוד נמצא חן בעיני אלהים ואדם כמו שמצינו ביוסף הצדיק וק\\\"ל: (מכי\\\"ק)",
            "english_translation": "The Lord will give strength to His people, the Lord will bless His people with peace. May our words be pleasing before the Master of all. The connection of these two verses. Let us first explain the verse in Psalms. You are fairer than the sons of men, grace is poured upon your lips. Gird your sword upon your thigh, O mighty one, your glory and your majesty. Let us further explain the verse. All the paths of the Lord are kindness and truth to those who keep His covenant and His testimonies. For it is known that the covenant of the tongue and the covenant of circumcision are aligned with each other as explained in the holy books that if a person does not guard his speech then he will come to damage the covenant heaven forbid as written in Reishit Chochma and Tomer Devorah on the verse do not let your mouth cause your flesh to sin.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Festivals, Shemini Atzeret 27"
        },
        {
            "section": "Torah",
            "topic": "Toldot",
            "number": "24",
            "passage": "ותקח רבקה את בגדי עשו בנה הגדול החמודות כו' ותלבש את יעקב בנה הקטן. הנה בזה מורה לנו הכתוב דרך העבודה להש\\\"י כאשר הקדמנו לעיל בעניני התפלה בגשתו אל הרנה ואל התפלה ולבו יודע מרת נפשו כי המרה את רוחו והלך בדרכי תעתועים בתאוות רעות וירא לנפשו לפתוח פיו. כמ\\\"ש אולי ימושני אבי והייתי בעיניו כמתעתע וכו' אולם העצה הנכונה לזה עפ\\\"י מ\\\"ש בשם הבעש\\\"ט ע\\\"פ מאת כל איש אשר ידבנו לבו תקחו את תרומתי. היינו שכל אדם צריך לשית עצות בנפשו להפוך לעשות מדות טובות מכל אשר ידבנו לבו מהתאוות החיצוניו' ומדות הרעות אשר הרגיל בהם מהם יקח דרך לעבודת הבורא ב\\\"ה באותו חשק ובאותה התאווה ביתר שאת. ובזה פרשתי בפ' ציצית ולא תתורו אחרי לבבכם וכו' אשר אתם זונים אחריהם למען תזכרו ועשיתם כו'. פי' שלא יפול לב האדם בראותו הסתת היצר ח\\\"ו לתאוות רעות ולא יקשה בעיניו למה עשה כן הבורא ב\\\"ה להכניס האדם בעוה\\\"ז בעבודה קשה כזה. כי. באמת הוא לטובת האדם כי ממנו נקח לעבוד הבורא ב\\\"ה באותו חשק ובאותו תאווה. וזה ולא תתורו כו' אשר אתם זונים אחריהם. כי למען תזכרו ועשיתם את כל מצותי. כי ממנו נלמוד לעשות המצות בחשק נמרץ כנ\\\"ל. וזה ג\\\"כ הרמוז כאן ותקח רבקה את בגדי עשו כו' החמודות.הם התאוות והחמדות רעות של עשו כנ\\\"ל. ותלבש את יעקב בנה הקטן. הם הצדיקים שהם קטנים בעיניהם ומורא על ראשם לגשת אל הקודש. והם מלבישים אותו החשק והרצון של תאוות עוה\\\"ז לקחת אותו חשק לעבודת הבורא ב\\\"ה. וז\\\"פ ג\\\"כ ויגנוב יעקב את לב לבן הארמי. כי לבן הי' סבור שיעקב ילמוד ממנו דרכו ומדותיו. אך הוא הי' מהפך אותם לטובה. כנ\\\"ל:",
            "english_translation": "And Rebecca took the garments of Esau her elder son, the precious ones, and clothed Jacob her younger son. Behold, in this the scripture teaches us the way of service to God, as we previously introduced above regarding matters of prayer when approaching supplication and prayer, and his heart knows the bitterness of his soul for he has embittered his spirit and walked in ways of delusion with evil desires and fears for his soul to open his mouth. As it is written \"Perhaps my father will feel me and I will be as a deceiver in his eyes.\" However, the correct advice for this according to what is written in the name of the Baal Shem Tov regarding \"from every man whose heart motivates him you shall take My offering\" - meaning that every person needs to devise strategies in his soul to transform and make good traits from all that his heart motivates him from external desires and evil traits that he has become accustomed to, from these he should take a path to serve the Creator blessed be He with that same desire and that same longing even more strongly. And with this I explained in the portion of tzitzit \"and you shall not follow after your hearts etc. after which you stray, in order that you remember and do etc.\" The explanation is that a person's heart should not fall when seeing the enticement of the evil inclination God forbid to evil desires, and it should not be difficult in his eyes why the Creator blessed be He made it so to place man in this world with such difficult service. For in truth it is for man's benefit because from it we take to serve the Creator blessed be He with that same desire and that same longing. And this is \"and you shall not follow etc. after which you stray, for in order that you remember and do all My commandments.\" For from it we learn to do the commandments with intense desire as mentioned above. And this is also alluded to here \"And Rebecca took the garments of Esau etc. the precious ones\" - these are the evil desires and lusts of Esau as mentioned above. \"And clothed Jacob her younger son\" - these are the righteous who are small in their own eyes and fear is upon their heads to approach the holy. And they clothe that desire and will of worldly desires to take that desire for the service of the Creator blessed be He. And this also explains \"And Jacob stole the heart of Laban the Aramean.\" For Laban thought that Jacob would learn from him his way and his traits, but he was transforming them for good, as mentioned above.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Torah, Toldot 24"
        },
        {
            "section": "Torah",
            "topic": "Bereshit",
            "number": "40",
            "passage": "וישמעו את קול ה' אלהים מתהלך כו' ויתחבא האדם ואשתו בתוך עץ הגן ויקרא לו ויאמר איכה וכו' ואירא כי עירום אנכי ואחבא. ויאמר מי הגיד לך כי עירום אתה המן העץ אשר צויתיך לבלתי אכל ממנו אכלת. ההרגש בפסוקים הללו מבואר בראשונים. והנראה בפירוש הענין ע\\\"ד מאמרם ז\\\"ל שקראו לאדה\\\"ר גנב שגנב מעץ הדעת לכך ויתחבא כי כאשר הבין האדם בעצמו שחטא מאד כי ראה הנחש כרוך אחריו ורע עליו המעשה כמ\\\"ש וידעו כי עירומים הם ערומים מכל מצוה ומכל טובה לכך ויתחבא בתוך עץ הגן הוא התורה ע\\\"ש ג\\\"ן פרשיות לתורה כמבואר בזוה\\\"ק והתחבא בתורה להמלט מזוהמת הנחש. ויקרא לו ה' איכה. ר\\\"ל איכה תמצא ידך ורגליך אחרי עשות המעשה כזה והשיב את קולך שמעתי ואירא כי עירום אנכי מכל טובה. ואמר לו הקב\\\"ה מי הגיד לך כי עירום אתה כי זה דרך הסט\\\"א וכל הדבקים בה להתנשאות ולגבהות לאמר כי חף אנכי מפשע כמו שאנו רואים כל הרשעים אומרים לנפשם צדיקים אנחנו ולא חטאנו וכמו זה אמה\\\"כ הנני נשפט אותך על אמרך לא חטאתי. כי כן דרך היצה\\\"ר מסמא את עיני אדם לאמור כי בכל אשר הוא עושה עדיין לא חטא כלל ועודנו לא נתרחק כלל מהש\\\"י ואדרבא הוא מתאמר בנפשו עוד לאמור כי מצוה הוא עושה כל הימים כמו שהשיא לחוה לאמר והייתם כאלהים לכן ההתחלת העבדות שיהיה האדם מכיר בעצמו כי חטא לה'. וצריך להיות תמיד פלס ומאזני משפט לפלס דרכיו אם יכונו באמת לה' ולא יעשה בנפשו שקר כמ\\\"ש דוד המלך ע\\\"ה ה' לי בעוזרי ואני אראה בשונאי. ר\\\"ל ה' לי בעוזרי עי\\\"כ אוכל לראות ולהכיר בשונאי לידע מי הוא האוהב אותי ומי הוא השונא המפתה אותי לדרך רעה כי היצה\\\"ט ויצה\\\"ר שניהם מפת' לדרך מצוה אך זה חלקו בחיים וזה אחריתו דרכי מות. לכן הודיעני דרך זו אלך. הורני ה' דרכיך. תעיתי כשה אובד בקש עבדך. ואל יהיה דבר זה קטן בעיני האדם לשום עינא פקיחא על נפשו בכל עניניו כי מצינו כן בצדיקים הגדולים שלא הכירו במעשיהם וחשבו למצוה והיה בהיפך כמו ענין מכירת יוסף כי עברו כ\\\"ב שנים ולא ידעו כי עשו עולה עד שראו תפיסת אחיהם ואת בנימין. אז אמרו אבל אשמים אנחנו וכתיב מיד אחריו כי המליץ בינותם ע\\\"י שהכירו שחטאו נעשה מליץ טוב עליהם. וכן היה רדיפת שאול לדוד כי סבור היה כי הוא מצוה להורגו. מעתה ק\\\"ו ב\\\"ב של ק\\\"ו לאנשים פחותי ערך כמונו עורי לב שכלו ימיהם בהבל צריך להבין ולהשכיל בפתוי היצה\\\"ר להנצל ממצודתו ודבריו הטובי' ולדעת כי איש חוטא הוא. וכזה המליצו חכז\\\"ל יש צדיק וטוב לו צדיק ורע לו רשע וטוב לו. ר\\\"ל שאומרים לנפשם כי טוב הוא ואינם יודעים בעצמם שום חטא כי הוא דומה בעיניו לצדיק וטוב לנפשו מאד. וז\\\"ש ג\\\"כ כאן מי הגיד לך כי עירום אתה המן העץ אכלת ועודך מכיר שחטאת מאין בא לך זאת והשיב כי האשה אשר נתת עמדי היא נתנה לי ומבואר במד\\\"ר כי הוא שוגג ולכך בשוגג כתיב או הודע אליו חטאתו כי עודנו זוכה להתוודע אליו חטאתו אבל במזיד אינו יודע כלל שחטא כי הכל טוב בעיניו וכשר לפניו. וד\\\"ל:",
            "english_translation": "And they heard the voice of the Lord God walking and the man and his wife hid themselves among the trees of the garden and He called to him and said where are you and I was afraid because I was naked and I hid myself and He said who told you that you were naked have you eaten from the tree which I commanded you not to eat from it you have eaten and the feeling in these verses is explained by the early ones and it appears in the explanation of the matter according to their saying that they called Adam a thief who stole from the tree of knowledge therefore he hid himself for when man understood in himself that he had greatly sinned because he saw the serpent wrapped around him and the deed was evil upon him as it is written and they knew they were naked stripped of all commandments and all goodness therefore he hid himself among the trees of the garden which is the Torah named for the 53 portions of Torah as explained in the holy Zohar and he hid in Torah to escape from the contamination of the serpent and God called to him where are you meaning how will you find your hands and feet after doing such a deed and he replied I heard your voice and I was afraid because I am naked of all goodness and the Holy One Blessed be He said to him who told you that you were naked for this is the way of the Other Side and all who cling to it to become proud and haughty saying I am free from transgression as we see all the wicked say to themselves we are righteous and have not sinned.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Torah, Bereshit 40"
        },
        {
            "section": "Torah",
            "topic": "Pinchas",
            "number": "15",
            "passage": "ויקרב משה את משפטן לפני ה'. ויאמר ה' אל משה כן בנות צלפחד דוברות. יל\\\"ד מהו לשון כן הול\\\"ל אמת בנות צלפחד דוברות. אכן הנה כבר ידוע כי כל שאלת האדם בצרכיו מאת השי\\\"ת ותפלותיו הרבים לא נכון להם להתפלל עלצרכי עצמו בעניני עוה\\\"ז רק לכוון בהם להיות בזה כבוד שמים בכל דרכיך דעהו שיהיו כל עניני האדם רק לכבוד הש\\\"י ב\\\"ה על אחת כמה וכמה בשעת התפלה צריך לכוון לבו רק לשמים וממנו בא הישועה גם לעוה\\\"ז כמ\\\"ש ויזעקו אל ה' בצר להם וממצוקותיה' יושיעם. פי' שיהי' כל כוונתם אל ה' שהוא כביכול בצר להם עמהם ממילא ממצוקותיהם יושיעם. והנה עד\\\"ז הוא פי' כל הברכות שבש\\\"ע אע\\\"פ שהם שאלת צרכיו רפואה וברכת השנים הכל הוא למעלה כיל\\\"ח וצריך לכוון להש\\\"י כשמתפלל בהם ליחוד שלמעלה וע\\\"י כן שלום על ישראל. והנה לפעמים מי שאין בו דעת לכל אלה להתפלל על ה' כנ\\\"ל. הנה זהו העצה נכונה כשבא אל הצדיק הדור הנה הוא מליץ טוב בעדו כי גם הוא כוונתו רק לשמים ומקרב את עניניו וצרכיו שהוא ג\\\"כ לצורך גבוה ית\\\"ש. וז\\\"ש בגמרא מי שיש לו חולה בתוך ביתו ילך אצל חכם ויבקש עליו רחמים כי הצדיק הוא היודע להמליץ עליו רחמים בתפלתו וע\\\"ז הבטיח הש\\\"י למשרע\\\"ה וחנותי את אשר אחון ואמרו חכז\\\"ל אעפ\\\"י שאינו הגון ואינו כדאי הפי' שאין כוונתו רצויה להתקבל למעלה אני אעביר כל טובי על פניך שיהיה בך כח כזה להטיב לברואיו להמליץ טוב בעדם וללמד זכות עליהם עי\\\"כ וחנותי את אשר אחון. וז\\\"פ הנה אנכי בא אליך בעב הענן בעבור ישמעו העם בדברי עמך כו' וישב משה את דברי העם אל ה'. ר\\\"ל גם דברי פשוטי העם שאינם יודעים להתפלל באמת ברצוןובכוונה למעלה עכ\\\"ז יעלו לרצון על ידי הצדיק. וזה הענין כשבאו בנות צלפחד לתבוע נחלה בא\\\"י תחלה הנה יש לפרש בזה כוונה פשטיות שרצו בתחלה כדרך הארץ. ויש לפרש בהם עוד שהיה כוונתם על קדושת הארץ שהיו מחבבות הארץ ולכן כשבאו לפני משה ויקרב את משפטן לפני ה'. שהי' מקרב וממתיק אותם שתביעתן הוא ג\\\"כ למקום ב\\\"ה כדרך הנכון להצדיק לקרב את בנ\\\"י לפני הש\\\"י ולזה השיב לו הקב\\\"ה כן בנות צלפחד דוברות אינך צריך עוד להמתיק ולתקן דבריהם בכוונתם. כן בנות צלפחד דוברות מתחלה רק לרצון הש\\\"י:",
            "english_translation": "And Moses brought their case before the Lord. And the Lord said to Moses, \"The daughters of Zelophehad speak correctly.\" It should be asked what is the meaning of \"correctly\" - it should have said \"truly\" the daughters of Zelophehad speak. Indeed it is already known that all requests of man for his needs from the Blessed Name and his many prayers are not proper to pray for his own needs in matters of this world but only to intend in them to bring honor to Heaven in all your ways know Him that all matters of man should be only for the honor of the Blessed Name how much more so during prayer one must direct his heart only to Heaven and from Him comes salvation also to this world as it is written \"They cried to the Lord in their distress and from their troubles He saved them.\" This means that all their intention should be to the Lord who is as if in distress with them consequently from their troubles He will save them. And thus is the explanation of all blessings in the Shulchan Aruch even though they are requests for needs healing and blessing of the years all is above as is known and one must intend to the Blessed Name when praying them for unification above and through this peace upon Israel. And sometimes one who lacks understanding for all these to pray to the Lord as mentioned above. This is the proper advice when he comes to the righteous one of the generation he is a good advocate for him because his intention too is only for Heaven and brings close his matters and needs which are also for the high purpose blessed be He. And this is what the Gemara says one who has a sick person in his house should go to a sage and request mercy for him because the righteous one knows how to advocate mercy for him in his prayer and for this the Blessed Name promised Moses \"I will be gracious to whom I will be gracious\" and the Sages said even though he is not worthy and not deserving meaning his intention is not proper to be accepted above I will pass all My goodness before you that you will have such power to benefit His creatures to advocate good for them and teach merit for them through this \"I will be gracious to whom I will be gracious.\" And this explains \"Behold I come to you in the thick cloud so that the people will hear when I speak with you etc.\" and Moses brought back the words of the people to the Lord. Meaning also the words of the simple people who do not know how to pray truly with desire and intention above nevertheless they will be accepted through the righteous one. And this is the matter when the daughters of Zelophehad came to claim inheritance in the Land of Israel first there is to interpret in this a simple intention that they wanted at first in the way of the world. And there is to interpret in them further that their intention was for the holiness of the Land that they cherished the Land and therefore when they came before Moses and he brought their case before the Lord that he was bringing close and sweetening them that their claim is also for the Blessed Place in the proper way for the righteous to bring the children of Israel before the Blessed Name and to this the Holy One Blessed be He answered him \"correctly the daughters of Zelophehad speak\" you do not need to further sweeten and fix their words in their intention. \"Correctly the daughters of Zelophehad speak\" from the beginning only for the will of the Blessed Name.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Torah, Pinchas 15"
        },
        {
            "section": "Torah",
            "topic": "Vaera",
            "number": "1",
            "passage": "וידבר אלהים אל משה ויאמר אליו אני ה' . להבין ענין האמירה הזאת שאמר אליו אני ה' מה אמר לו. אך הנה באה ללמד לאדם דעת להבין בעצמו כי בכ\\\"ע עמדו לפני ה' בתורה ותפלה כי הוא איננו כדאי וראוי לזכות ולעמוד לפתוח פיו לפני הש\\\"י ממה\\\"מ הקב\\\"ה ואינו בכחו לדבר מאומה זולת מחסד הבורא עליו אשר ישים דבר בפיו לאמר כה תדבר כמש\\\"א דוד המלך ע\\\"ה כי אין מלה בלשוני הן ה' ידעת כלה. לכן צריך האדם להכנע ולשבר לבבו קודם הלימוד והתפלה להתפלל לה' ולשאול ממנו מענה לשון כמ\\\"ש בברכת התורה אשר קדשנו במצותיו וצונו לעסוק בדברי תורה. ואעפ\\\"כ מתפללים והערב נא כו' את דברי תורתך בפינו שיהיה בו עריבות ומתיקות לפניך להיות נחת רוח לפני כסא כבודך אע\\\"פ שהאדם מחויב ללמוד במצות הבורא בחיוב דאורייתא מ\\\"מ אינו כשאר מלאכות שמחויב לראות להשלים פעולתו אשר נשלח אליה כי אורייתא צריך הקדמת דחילו ורחימו וכן בתפלה ושאר כל המצות כי הוא רק חסד עליון אשר יזכה האדם השפל לעמוד לפניו ולהתפלל כמ\\\"ש הללו את ה' מן השמים. ר\\\"ל להודות ולהלל לפניו ית\\\"ש הוא ג\\\"כ סיוע מן השמים טוב ה' לכל ורחמיו על כל מעשיו יודוך ה' כו' כל זה מצד הרחמנות אשר יודוך כל מעשיך. לכן אל יפול לב האדם עליו בראותו כי הקדים ליגע קודם התפלה הרבה בלימוד שיעורין כסדרן ואעפ\\\"כ מתהפך הוא בתחבולותיו בשעת התפלה ואיננה שגורה בפיו ואיננו יכול להתפלל כי הכל הוא מן השמים והוא יעשה את שלו. ועל כזה רמזו רז\\\"ל אל תעש תפלתך קבע. ענין הקביעות הוא הבא בכל עת בטבע. כן אל תעש תפלתך מצד שלמדת הרבה קודם התפלה בקביעות ועי\\\"כ נכון לך להתפלל. לא כן אלא רחמים ותחנונים לפני המקום מצד הרחמנות תבא לפני המקום. וכן נאמר ואתחנן כו' פרש\\\"י מתנת חנם אע\\\"פ שיש להם לצדיקים לתלות במעשיהם הטובים אעפ\\\"כ אינם מבקשים רק מתנת חנם. ר\\\"ל שיש להם לתלות שיהיה תפלתם נכונה ע\\\"י מעשיהם הטובים שלמדו הרבה ועשו מעש\\\"ט קודם התפלה אעפ\\\"כ אינם מבקשים ר\\\"ל הבקש' שלהם אינה רק מתנת חנם כנ\\\"ל. וז\\\"ש שצריך לומר קודם שמ\\\"ע אדני שפתי תפתח כי לולא זאת איך יכול לעמוד בתפל' כי איך יזכה ילוד אשה לעמוד לפני הקב\\\"ה. הנה כזה היה הענין אצל משרע\\\"ה ציר נאמן כי שלחו ה' לפדו' את בנ\\\"י ולהוציאם ממצרים ומשרע\\\"ה באהבתו לישראל הלך בהתלהבות לקיים דבר השליחות וכאשר ראה כי לא שמעו לו הרע בעיניו והתחיל לזעוק למה הרעות. אמר לו הקב\\\"ה דע לפני מי אתה עומד כי אני ה' כמו שמבואר בזוה\\\"ק מקמאי מלילת מילין אילין. ודו\\\"ק:",
            "english_translation": "And God spoke to Moses and said to him I am the Lord. To understand the matter of this saying that He said to him I am the Lord what did He say to him. Indeed it came to teach man knowledge to understand within himself that in all circumstances he stands before the Lord in Torah and prayer for he is not worthy and deserving to merit and stand to open his mouth before the Holy One blessed be He and it is not in his power to speak anything except from the Creator's kindness upon him who puts words in his mouth to say thus shall you speak as King David peace be upon him said for there is no word on my tongue behold Lord You know it all. Therefore a person needs to humble himself and break his heart before learning and prayer to pray to the Lord and ask from Him for an answer of tongue as it is said in the blessing of the Torah who sanctified us with His commandments and commanded us to engage in words of Torah. And nevertheless we pray and make sweet etc. Your Torah words in our mouths that there should be pleasantness and sweetness before You to be satisfaction before Your throne of glory even though a person is obligated to learn by the Creator's command as a Torah obligation nevertheless it is not like other tasks that one must see to complete his action that he was sent to do for Torah requires the precedence of fear and love and so too in prayer and all other commandments for it is only supreme kindness that the lowly person merits to stand before Him and pray as it is said praise the Lord from the heavens meaning to thank and praise before Him blessed be He is also assistance from heaven the Lord is good to all and His mercies are upon all His works they will thank You Lord etc. all this is from the aspect of mercy that all Your works will thank You therefore let not a person's heart fall upon seeing that he preceded to toil before prayer much in learning regular lessons and nevertheless he turns in his strategies during prayer and it is not fluent in his mouth and he cannot pray for everything is from heaven and He will do His part and about this the Sages hinted do not make your prayer fixed the matter of fixedness is that which comes naturally at all times so do not make your prayer from the side that you learned much before prayer regularly and through this it is proper for you to pray not so but rather mercy and supplications before the Omnipresent from the aspect of mercy come before the Omnipresent and so it is said and I beseeched etc Rashi explained a free gift even though the righteous have to rely on their good deeds nevertheless they only ask for a free gift meaning that they have to rely that their prayer will be proper through their good deeds that they learned much and did good deeds before prayer nevertheless they only ask meaning their request is only a free gift as mentioned above and this is what is said that one needs to say before the Amidah Lord open my lips for without this how can one stand in prayer for how can one born of woman merit to stand before the Holy One blessed be He behold this was the matter with Moses our teacher peace be upon him the faithful messenger for the Lord sent him to redeem the children of Israel and take them out of Egypt and Moses our teacher peace be upon him in his love for Israel went with enthusiasm to fulfill the matter of the mission and when he saw that they did not listen to him it was bad in his eyes and he began to cry out why have You done evil the Holy One blessed be He said to him know before whom you stand for I am the Lord as is explained in the holy Zohar from before you spoke these words and examine carefully.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Torah, Vaera 1"
        },
        {
            "section": "Torah",
            "topic": "Vayishlach",
            "number": "9",
            "passage": "ויאמר יעקב אל ביתו ואל כל אשר עמו הסירו את אלהי הנכר אשר בתוככם והטהרו ונקומה ונעלה בית אל. ואעשה שם מזבח וכו'. פירש\\\"י והטהרו מעבודת גלולים עכ\\\"ל. התורה מלמדת אותנו דרך לעבודת הבורא ב\\\"ה מדברי יעקב אבינו ע\\\"ה ונקדים דברי הש\\\"ס בקדושין כל שאינו יודע בטיב גיטין וקדושין לא יהי' לו עסק עמהם והרגישו המפורשים למה הקדימה גיטין לקדושין הלא בכ\\\"מ קדושין קודמין לגיטין דבתחלה האדם מקדש ואח\\\"כ אם מצא בה וכו' הוא מגרשה. אך נקדים דברי הש\\\"ס על פסוק מה ה' דורש ממך כי אם הצנע לכת עם ה' אלקיך. ודרשו חכז\\\"ל זה הוצאת המת והכנסת כלה. ונדחק רש\\\"י בפי' הש\\\"ס הזה. ועוד מה הוא הענין שדרשו דוקא הפי' הצנע לכת לשני דברים הללו דלמא הפי' הצנע לכת ליתן צדקה בסתר כמ\\\"ש מתן בסתר וכו' או להתפלל בהצנע כיון שכל הדברים טוב בהם הצניעות. ועוד מאי כי אם הצנע לכת וכי אם יקיים אדם הני תרי דברים הוצאות המת והכנסת כלה יותר אין הקב\\\"ה חפץ מן האדם. ולמה תרי\\\"ג מצות. אך נקדים לזה דברי הספרים הקדושים ובפרט האריז\\\"ל שכל המצות ותפלות ותורה ומעש\\\"ט שהאדם עושה אם חטא מקודם ולא עשה תשובה כל התפלות והמצות נוטלים הסט\\\"א וחיילותיו ואדרבא מוסיף כח לקליפה בתורה ומצות. ובזה פרשו הפסוק ולרשע אמר אלקים מה לך לספר חוקי וכו'. ובזה פרשו הפסוק סור מרע ועשה טוב היינו קודם עשיית הטוב מקודם צריך להיות סור מרע דהיינו לעשות תשובה. ובזה פרשו תשובה ומעשים טובים בעוה\\\"ז שלכל מעשים טובים שאנו עושים בעוה\\\"ז צריך תשובה מקודם ואח\\\"כ מעשים טובים. ובזה פרשנו ואמרנו שהדברים האלו מפורשים בתורה בפ' התשוב' בפ' וילך ושבת עד ה' אלקיך וכו' ושמעת בקולו ככל אשר אנכי מצוך וכו'. עוד שם פסוק אחר ואתה תשוב ושמעת בקול ה' כו' לשמור מצותיו וחוקותיו הכתובה בספר הזה כי תשוב אל ה' אלקיך כו' מבוארים הדברים שהתורה אומרת שהתשובה קודמת לכל המצות ומבלעדה לא ירים איש את ידו לעשות שום מצוה שהרי אמר הכתוב לשמור מצותיו וכו' כי תשוב וכו' שכל זמן שלא עשה תשובה הכל הולך לסט\\\"א. ובזה נחזור לש\\\"ס הנ\\\"ל הצנע לכת עם ה' אלהיך ע\\\"ד שאיתא בזוהר על פסוק הנסתרות לה' אלהינו שהיא יראה ואהבה שהם דברים שבלב. וזהו הצנע לכת עם ה' אלקיך שיראה ואהבה הם בהצנע לכת כי היא בתוך בנ\\\"א דהיינו השם י\\\"ה שהוא יראה ואהבה כמבואר בזוהר ותלך עם ה' אלקיך שהשם הוי' יהי' שורה עמך בכל דרכיך. וזהו הוצאות המת והכנסת כלה. וגם מבואר שס\\\"מ וסט\\\"א נקראים מתים. וזהו אמרו כאלו אכלו מזבחי מתים. וגם אמרו בש\\\"ס רשעים בחייהם קרוים מתים משום שהס\\\"ם וסט\\\"א שולטין על האדם הרשע כמאמר חכז\\\"ל רשעים יצה\\\"ר שופטן והן נקראים מתים לכן הרשעים שהם תחתיהן נקראים ג\\\"כ מתים כמוהם. וזה כוונת הש\\\"ס מעבירין את המת מלפני הכלה אם אדם רוצה להכניס הקדושה היינו השכינה הנקראת כלה לתוכו יצטרך מקודם לפנות המת ולהעבירו מלפני הכלה שאין אדם דר עם נחש וכו' ומכ\\\"ש הקב\\\"ה. וזה רמז הכתוב בפ' חיי שרה בדברי לבן ויאמר בא ברוך ה' למה תעמוד בחוץ ואנכי פניתי הבית ופרש\\\"י פניתי הבית מע\\\"ג רמז לנו הכתוב שקודם פניות הבית מע\\\"ג היינו פנימיות ועקמימות שבלב ע\\\"ד לא יהי' בך אל זר היינו היצה\\\"ר שבלבבו של אדם שאי אפשר לבוא בתוכו ברוך ה' ומכש\\\"כ השכינה וכמבואר בזוהר שצריך כל אדם להעביר הסט\\\"א מכל אבר ואבר אז שורה השכינה עליו. וזה רמזו רז\\\"ל זהו הוצאות המת והכנסת כלה היינו השכינה הנקראת כלה וזהו כל שאינו יודע בטיב גיטין וקדושין קודם כל מצוה. שידוע עיקר כוונת כל מצוה היתה להתקדש אותנו בהם כמ\\\"ש אומרים אשר קדשנו במצותיו שבכל מצוה ומצוה אנו מוסיפין עלינו קדושה ואם האדם נתעב בחטאיו ועוונו אין הקדושה יכולה לשרות על האדם כי אין אדם דר עם נחש וכו'. וזה נקרא גיטין היינו גרושין. וזה כל שאינו יודע בטוב גיטין וקדושין היינו מקודם גיטין ואח\\\"כ קדושין. ומזה פרשתי הכתוב משכו וקחו לכם צאן ופרשו רז\\\"ל משכו ידיכם מע\\\"ג שזה היתה מצוה ראשונה כמאמר חכז\\\"ל לא הי' צריך התורה להתחיל אלא מהחודש הזה לכם למדה התורה אותנו שקודם עשיית הקרבן שהיא מצות קרבן פסח למשוך ידיהם מע\\\"ג. ולזה היתה הרמזים וכוונת התורה במצוה הראשונה בפסח שיצאו מתתת הסט\\\"א היינו מיד מצרים דכל זמן שהיו תחת יד מצרים היו תחת יד הסט\\\"א כמבואר בספרים. אך אחר שיצאו ממצרים מתחת שיעבודם הי' כוונת הקב\\\"ה שיצאו מתחת יד שיעבוד היצה\\\"ר. ולזה מצוה ראשונה הוא פסח ואכילת מצה היינו להתקדש גופו של בנ\\\"י בהשראת הקדושה צוה הש\\\"י לגרש הסט\\\"א והיצה\\\"ר דהיינו ביעור חמץ הוא היצה\\\"ר כמבואר בזוה\\\"ק ובספרים. ולזה אמה\\\"כ אחר מצות קרבן פסח ואמר עוד ז' ימים מצות תאכלו אך ביום הראשון תשביתו שאור מבתיכם היינו מערב יו\\\"ט ולא ביו\\\"ט עצמו ע\\\"ד שאמרו מעבירין את המת מלפני הכלה. וזה כוונת רבא בש\\\"ס בפסחים דף ה' אך ביום הראשון הוא מעיו\\\"ט ולא ביו\\\"ט עצמו הרי נאמר לא תשחט על חמץ דם זבחי א\\\"כ ראינו שכוונת הכתוב שקודם עשיית המצוה יהי' ביעור חמץ. ולזה אמר אח\\\"כ ושמרתם את המצות ודדשו חכז\\\"ל אל תיקרי מצות אלא מצוות הרמז שבכל המצות צריך מקודם ביעור חמץ. ולזה יש לומר מה שמקשים שבדברי משה לא נזכר רק עשיית הפסח ולא נזכר כלל ביעור חמץ. אך במה שאמר משכו ידיכם מע\\\"ג כדרשת חכז\\\"ל ממילא מרמז בזה מצות ביעור חמץ כנ\\\"ל. ולזה בא הרמז בסמיכות בפ' כי תשא אלהי מסכה לא תעשו לכם את חג המצות תשמור. עוד רמז בכ' ובא השמש וטהר ואחר יאכל מן הקדשים. וזה ג\\\"כ בפ' משפטים לא תשתחוה לאלהיהם ולא תעבדם וכו' ושבר תשבר מצבותיהם ועבדתם את ה' אלהיכם כו'. וזה ג\\\"כ הרמז בפ' אדם כי יקריב מכם קרבן לה' מן הבהמה כו' תקריבו את קרבנכם. היינו מקודם צריך להקריב הבהמיות שבאדם לעשות לה' בכל דרכיך דעהו ואח\\\"כ אדם כי יקריב מכם כו' יכול האדם להתקרב להקב\\\"ה. וכן נאמר בפ' קדושים לרצונכם תזבחוהו היינו הרצון הרע שבכם תזבחוהו קודם עשיית הקרבן. וזה היתה כוונת יעקב אבינו ע\\\"ה בפסוק הזה הסירו את אלהי הנכר אשר בקרבכם ע\\\"ד שאמרו חכז\\\"ל לא יהי' בך אל זר זה היצה\\\"ר שהוא בתוך לבו של אדם והטהרו מע\\\"ג כפרש\\\"י ונקומה ונעלה בית אל ונעשה שם מזבח כו' היינו כנ\\\"ל שקודם עשיית המצוה ובפרט הקרבנות. הסירו את אלהי הנכר כו'. כן יהי רצון בכל מעשינו אמן:",
            "english_translation": "And Jacob said to his household and to all who were with him, \"Remove the foreign gods that are among you and purify yourselves and let us arise and go up to Bethel. And I will make there an altar.\" Rashi explains \"purify yourselves\" means from idol worship. The Torah teaches us the way to serve the Creator, blessed be He, from the words of our father Jacob, peace be upon him, and we preface the words of the Talmud in Kiddushin that whoever does not know the proper way of divorce and marriage should not deal with them, and the commentators noticed why divorce precedes marriage when everywhere marriage comes before divorce since first a person marries and then if he finds in her etc. he divorces her. But we preface the words of the Talmud on the verse \"What does the Lord require of you but to walk humbly with your God.\" And our Sages interpreted this as referring to attending to the dead and bringing in the bride. And Rashi struggled to explain this Talmudic passage. And furthermore what is the matter that they interpreted specifically the meaning of walking humbly for these two things, perhaps the meaning of walking humbly refers to giving charity in secret as it is written \"a gift in secret\" etc. or to pray privately since all things are good with modesty. And furthermore what is meant by \"but to walk humbly\" - if a person fulfills these two things, attending to the dead and bringing in the bride, does God want nothing more from the person? And why are there 613 commandments?",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Torah, Vayishlach 9"
        },
        {
            "section": "Festivals",
            "topic": "Sukkot",
            "number": "51",
            "passage": "יהי לבי תמים בחוקיך למען לא אבוש. ובמד\\\"ר שבקש דוד המלך ע\\\"ה אף בשעת עשיית המצוות יהי' לבי תמים כי אע\\\"פ שלכך נברא היצה\\\"ר לבעבור תהי' הבחירה ביד האדם בכל זה צריך להתפלל שיעשה המצות בתמימות בלי שום פני' חיצונית למען לא אבוש כי באמת אם האדם עושה המצוה לשום כוונה חיצונית חלילה אז אח\\\"כ בעולם העליון הוא מתבייש מאד על סכלותו אשר לא טוב עשה וכמעשה המובא בס' ר' ייבא באחד שהגיד לחבירו בחלום איך שהוא מתבייש וחרפה תכסה פניו בהכריז עליו המלאך כוונת המצות אשר עשה בעולם הזה וכל הצדיקים ינוסו לקולם מג\\\"ע בשמעם אוולתו ופגמו ולכך צריך האדם להתפלל שלא יבוש בעה\\\"ב וזהו אחת שאלתי מאת ד' אותה אבקש שבתי בבית ד' כל ימי חיי פי' כל ימי חיי יעלו לפני ד'. לחזות בנועם ד'. פי' שאוכל לחזות ולהתראות לפני ד' ולא אבוש:",
            "english_translation": "Let my heart be perfect in Your statutes so that I will not be ashamed. And in the Midrash, King David peace be upon him requested that even during the performance of commandments his heart should be perfect, for although the evil inclination was created for the purpose of giving humans free choice, nevertheless one must pray to perform the commandments with wholeness without any external motives so that I will not be ashamed, for truly if a person performs a commandment for any external intention heaven forbid, then afterward in the upper world he becomes very ashamed of his foolishness for not acting properly, as in the story brought in the book of Rabbi Yiba about one who told his friend in a dream how he is ashamed and shame covers his face when the angel announces the intentions of the commandments he performed in this world and all the righteous flee from Paradise upon hearing his foolishness and blemish, and therefore a person must pray not to be ashamed in the World to Come, and this is \"One thing I ask from God, that I seek: that I dwell in the house of God all the days of my life\" meaning all the days of my life shall rise before God, \"to behold the pleasantness of God\" meaning that I should be able to behold and appear before God and not be ashamed.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Festivals, Sukkot 51"
        },
        {
            "section": "Torah",
            "topic": "Beha'alotcha",
            "number": "1",
            "passage": "ונסעו הקהתים נושאי המקדש. ופרש\\\"י נושאי דברים המקודשים. לכאורה דברי רש\\\"י הם אך למותר. כי כבר בסוף פ' במדבר במשא בני קהת באוהל מועד קודש הקדשים פרש\\\"י שם ג\\\"כ המקודש שבכלים הארון והשלחן ומזבחות והפרכת וכלי השרת. אמנם י\\\"ל כי הנה ידוע כי הצדיקים שבדור הם בתפלתן מעלים התפלות של כל ישראל אפי' מפחותי הערך הגם שלא התפללו בדו\\\"ר כמאמר הספרים על פסוק ועתה הנה צעקת בנ\\\"י באה אלי מהו לשון ועתה ופרשו ועתה תיכף בעת הזאת אחרי שהי' מעט דבר ה' אל משה הנה צעקת בנ\\\"י באה אלי בדבר ה' אליו מיד העלה תפלתן וזעקתם. וז\\\"ש בעבור ישמע העם בדברי עמך אל תיקרי ישמע אלא ישמע ופירושו ישמע תפלת העם בדברי עמך ע\\\"י דברי עמך. וזה ג\\\"כ היתה עבודת הלוים להעלות תפלת ישראל ופרש\\\"י נושאי דברים המקודשים לשון דיבורים המקודשים אפי' התפלות שלא נאמרו בדו\\\"ר כתקנת חכז\\\"ל אנשי כנה\\\"ג מכל מקום הם דיבורים המקודשים והלוים נושאים בתפלתם אלו הדיבורים המקודשים אל מקור העליון אשר זולתם לא עלו למקור העליון:",
            "english_translation": "And the Kohathites journeyed, bearers of the sanctuary. And Rashi explains: bearers of the sacred things. At first glance, Rashi's words seem superfluous, for already at the end of Parshat Bamidbar regarding the burden of the sons of Kohath in the Tent of Meeting of the Holy of Holies, Rashi explained there also the most sacred of vessels - the ark, table, altars, curtain, and service vessels. However, one can say that it is known that the righteous of each generation through their prayers elevate the prayers of all Israel, even those of lesser worth who did not pray with proper intention, as the books say on the verse \"And now behold the cry of the children of Israel has come to me\" - what is the meaning of \"and now\"? They explained \"and now\" means immediately at that moment after God spoke briefly to Moses, behold the cry of the children of Israel came to Him through God's speaking to him, immediately elevating their prayers and cries. And this is what is meant by \"so that the people may hear when I speak with you\" - don't read it as \"hear\" but as \"will be heard\" meaning the people's prayer will be heard through your words, through the words of your people. And this too was the service of the Levites to elevate Israel's prayers, and Rashi explains \"bearers of sacred things\" meaning sacred utterances, even prayers not said with proper intention as established by the Sages of the Great Assembly, nevertheless they are sacred utterances and the Levites carry in their prayer these sacred utterances to the supreme source, without which they would not ascend to the supreme source.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Torah, Beha'alotcha 1"
        },
        {
            "section": "Festivals",
            "topic": "Shaar Tefillah",
            "number": "24",
            "passage": "מזמור שיר חנוכת הבית לדוד. סדרו אנשי כנה\\\"ג לומר מזמור זה קודם התפלה. דהנה ידוע שהתפלה היא העיקר ההכנעה קודם התפלה לחשוב ברוממות האל ובשפלות עצמו ובעונותיו המרובים. והנה יכול ליפול לב האדם לגמרי ויאמר מה תועלת בתפלתי בוודאי לא יעלה לרצון למעלה כלל וזה הוא שני ההפכים בנושא אחד. ולזה צריך אמונה להאדם ויגבה לבו בדרכי השם שאדרבא תפלתו עולה למעלה ובוקע חלוני רקיע. ובזה י\\\"ל דברי המדרש. אם מזרע היהודים מרדכי כו' כשהם יורדים יורדים עד לעפר וכשהם עולים עולים עד לרקיע. ובזה יש לפרש דברי התפלה ונפשי כעפר לכל תהי' פתח לבי בתורתך וכו'. ולזה אמר אברהם הנה נא הואלתי לדבר ואנכי עפר ואפר. זה בשעה שהתחיל להתפלל. ואח\\\"כ צריך האדם להתחזק יותר ויותר כמו שאמר אברהם אולי יש חמשים צדיקים בתוך העיר וכו' אולי יש עשרה. היוצא מזה דבשעה שמתחיל האדם להתפלל צריך להיות כמו עפר בעצמו ואח\\\"כ עולה למעלה וזהו ממש כמו בבנין הבית שמתחלה חופר אדם בקרקע להניח יסוד ולבנותו ואח\\\"כ עולה ובונה עד לשמים. וז\\\"פ מזמור שיר חנוכת הבית לדוד. אליך ד' אקרא כו'. מה בצע בדמי ברדתי אל שחת היודך עפר. דהוא תמוה מאד דמאי הו\\\"א לאדם שיהי' לו ריווח שיבא אל השחת וכמובן. אך להנ\\\"ל ניחא דהפי' במחשבה. שאל יהי' האדם שפל בשעת התפלה ויורד במחשבתו אל שחת. ע\\\"ז אמר היודך עפר אם אהי' שפל ונבזה יותר מדאי א\\\"כ לא יהי' באפשר כלל להתפלל וכו'. פתחת שקי ותאזרני שמחה למען יזמרך כבוד ולא ידום היינו כנ\\\"ל שהקב\\\"ה יחזק לאדם ויסיר ממנו העצבות מעבירות שבידו למען יזמרך כבוד (ע\\\"ד שכ' האור המאיר) וז\\\"פ הפ' סור מרע ועשה טוב. שיפנה מחשבתו מהעבירות ויעשה טוב. וכן נ\\\"ל הפי' בפסוק בטח בד' ועשה טוב. דהנה כתיב אל תבטחו באלוף כדרשת חכז\\\"ל. אך כדי לעשות הטוב אסור להיות עניו. ולזה פירשו המפרשים העשיר לא ירבה והדל לא ימעיט אפי' כל העולם אומרים עליך כו' תהי' בעיניך כרשע. ואל תהי רשע בפני עצמך היינו כנ\\\"ל. ואין סתירה לב' הדברים אלו. (וזה הפי' אם מזרע היהודים כו' כשהם עולים כו'. דהנה אסתר אמרה כי אין לבא אל המלך בלבוש שק היינו בעצבות ולכך ותלבש אסתר מלכות ותעמוד בחצר בית המלך הפנימית. והנה החכמים היו רואים שמרדכי לובש שק וחשבו שלא יהי' נשמע בקול תפלתו אבל עכשיו שהסירה השק מעליו והלבישתו בגדי מלכות א\\\"כ יעלה תפלתו וכשהם עולי' עולי' עד לשמים. אין עמידה אלא תפלה. (עיי' בדרוש פורים בפ' והרכיבהו). וזהו ממעמקי' קראתיך ד' ד' שמעה כו' אם עונות תשמר יה אדני מי יעמוד. היינו תפלה. ואני בחסדך בטחתי יגל לבי בישועתך. אני בטוח שתושיעני. כי בהישועה אין אני שמח על עצמי רק על ישועת ישראל וזהו ישועת הקב\\\"ה כמ\\\"ש במד\\\"ר על פסוק לד' הישועה על. עמך ברכתך סלה. (וכן הפי' פתחת שקי ותאזרני שמחה. שהשמחה היא למען יזמרך כבוד). וזה הפי' אחור וקדם צרתני דהקב\\\"ה חפץ בזה שיהי' האדם שפל בדעתו ובשעת התפלה יהי' בהתרוממות שבונה עולמות בתפלתו. פליאה דעת ממני נשגבה לא אוכל לה. שיהי' ב' הפכיים בנושא אחד. אך התירוץ אנה אלך מרוחך ואנה מפניך אברח וכו' ע\\\"ד שכ' בס' מבשר צדק בפ' ויגש ע\\\"ש. העבר עיני מראות שוא בדרכיך חייני. העבר חרפתי אשר. יגורתי כו' זדים הליצוני עד מאד מתורתך לא נטיתי. רחוק מרשעים ישועה כי חוקיך לא דרשו. אליו פי קראתי ורומם תחת לשוני. און אם ראיתי בלבי כו'. וזה הכוונה הלוחות ושברי לוחות מונחים בארון. דארון הוא כינוי ללב כמבואר בזוהר הקדוש ושברי לוחות הוא לזכרון העונות שאז לדור המדבר היו לזכרון מעשה העגל זכור אשר הקצפת. ועכשיו יש לכל אדם יותר ויותר עונות מדור המדבר כידוע. ולכן מונחים בארון: (מכי\\\"ק)",
            "english_translation": "A psalm, a song for the dedication of the house, for David. The men of the Great Assembly arranged to say this psalm before prayer. For it is known that prayer is the main humility before prayer, to think of God's greatness and one's own lowliness and many sins. And behold, a person's heart can completely fall and say what benefit is in my prayer, surely it will not rise favorably above at all, and these are two opposites in one subject. And for this faith is needed for a person and his heart should be elevated in God's ways that on the contrary his prayer rises above and pierces the windows of heaven. And in this can be explained the words of the Midrash. If from the seed of the Jews is Mordecai etc., when they descend they descend to dust and when they rise they rise to heaven. And in this can be interpreted the words of prayer \"and may my soul be like dust to all\" open my heart to your Torah etc.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Festivals, Shaar Tefillah 24"
        }
    ],
    "timestamp": "2024-12-24T08:48:41.964340",
    "metadata": {
        "total_passages_processed": 90,
        "selection_criteria": "Passages with average score above 7.0",
        "scoring_version": "3.0"
    }
}