{
    "question": " Prayer is obligatory in all circumstances, especially in times of distress. - Even if war were chosen, prayer should precede it.  Therefore, making prayer sound merely conditional conflicts with its mandatory nature",
    "analyzed_passages": [
        {
            "source": "Divrey Yoel, Torah, Vayigash (Torah #3, Passage #11)",
            "relevant_sentences": "אין משפטים ישירים",
            "passage": "והנה דבריהם הקדושים נשארו נצחיות לדורי דורות, שכבשו דרך ופתחו מעיין ישועה לבניהם אחריהם, וכמ\"ש ק\"ז הייטב לב זלל\"ה (בפרשת תולדות) על מה דאיתא בזוה\"ק: כ' שנין אשתהי יצחק עם אתתי' ולא אולידת עד דצלי צלותיה, בגין דקוב\"ה אתרעי בצלותהון דצדיקייא, מ\"ט בגין דיתרבי ויתוסף רבות קודשא לכל מאן דאיצטרך בצלותהון דצדיקייא עכ\"ד הזוה\"ק. וכתב ק\"ז זלל\"ה למה זה דומה לצינור שנסתם ואם יבוא אחד ויפתחנו וינקנו שוב הוא פתוח לכל, וכמו\"כ ע\"י תפלתן של צדיקים נפתחו צנורות הישועה והחסדים וכל מי שצריך למימי הישועה ישאב בששון מאותו הצינור וכענין דכתיב ושאבתם וגו' ממעיני הישועה, וביארו המפרשים כי ישועת צדיקים הוא כמו מעיין הנובע ישועה לכל מיד ולדורות, ולכן הקב\"ה מתאווה לתפלתן שע\"י תפלתן יפתח הצינור והמעיין לכל מי שצריך לאותו דבר ע\"כ בייטב לב. ויובן בזה דברי המדרש מים עמוקים עצה בלב איש וגו' משל לבאר עמוקה מלאה צונן והיו מימי' צוננין ויפין, ולא היתה ברי' יכולה לשתות הימנה, בא אחד וקשר חבל בחבל וכו' ודלה הימנה ושתה התחילו הכל דולין הימנה ושותין, כך לא זז יהודה משיב ליוסף וכו', דהנה השבטים הק' לא היו צריכים לפעולות אלו בשביל עצמם. כי היה בכח קדושתם לפעול ישועה לעצמם בלאו הכי, אבל עשו כל זה שיהיה מעיין ישועה נמשך לדורות, ויש מקום בדבריהם הקדושים לדורות, כל דור לפי המצב ולפי המאורעות ולכך היו דבריהם מראין פנים לכל צד, שיהיה נמשך לדורות מעיין הנובע ישועה לכל מי שצריך, וכך היה יהודה משיב ליוסף דבר על דבר עד שעמד על לבו והכל דולין ושותין מהם לדורי דורות.",
            "explanation": "ביאור העניין הוא שתפילת הצדיקים פותחת צינורות ישועה לדורות, ולכן היא חובה בכל עת ובפרט בעת צרה, שכן היא מעיין נובע ישועה לכל, וכך גם בעת מלחמה יש להקדים תפילה, כי היא המפתח לישועה."
        },
        {
            "source": "Divrey Yoel, Torah, Vayigash (Torah #1, Passage #51)",
            "relevant_sentences": "אין משפטים ישירים",
            "passage": "ובזה יתבאר דברי המדרש הנ\"ל שאמר יהודה אם למלחמה אני בא, אם לפיוס אני בא, אם לתפלה אני בא, עפימ\"ש ק\"ז הישמח משה זלל\"ה (בפ' וישב) בשם ספה\"ק קדושת לוי זלל\"ה דבימי החשמונאים לא הי' הנס בשלימות מפני שהיה דרך מלחמה, ודרך התורה שלא יעשו התחתונים שום פעולה גשמית רק בתפלה ובתחנונים לפני הקב\"ה עשיי\"ד. אמנם ישנם זמנים שהסכימו מן השמים למלחמה, כמו בימי החשמונאים הכהנים הגדולים שהיו לוחמים עפ\"י רוה\"ק, ודוד המלך ע\"ה לחם מלחמותיו בעצת אורים ותומים ועפ\"י רוה\"ק, ועוד מלכים אחרים שהראו להם הסכמה מן השמים על המלחמה, והיו זמנים שלא הוסכם מן השמים להלחם עם האומות, והוצרכו לפייסם בדורונות ולשחדם בממון בצירוף כח התפלה, ובאופן זה ניצולו מהם, ועתידים אומות העולם להחזיר כל אותן הדורונות כנ\"ל, ובזמנינו אלה עיקבתא דמשיחא אין לנו רשות לערוך נגדם מלחמה ואין לנו עצה ותרופה כי אם להתפלל להבוי\"ת וזה כל תוחלתינו, וע\"כ אמר יהודה כל אלו הג' בחינות, שהי' מלך על השבטים, ומלך המשיח עתיד לצאת מיהודה, ע\"כ מונה והולך כל אלו הזמנים וכל הבחינות שיעברו על ישראל עד ביאת המשיח. וז\"ש אם למלחמה. ר\"ל אם יסכימו מן השמים למלחמה, ויהיה רצון העליון כן, אז אני בא להלחם, ורמז על דוד דאתי מיהודה, וגם רמז על שאר המלכים שנלחמו במצות השי\"ת, שיהודה הוא ראש המלוכה, ורמז גם עליהם באמרו אני בא, וכן אם לפיוס אני בא. ואם לתפלה כשיהיה רצון העליון שיבא הישועה ע\"י תפלה לבדה, אז אני בא בכח התפלה, והכוונה על מלך המשיח דאתי מיהודה, שיבא משיח צדקינו בלי פעולה גשמיות ובלי מלחמה, ובאמת כח וזכות התפלה צריך שיהיה מצורף גם למלחמה ולפיוס, ומ\"ש אם לתפלה הכוונה על תפלה לבדה לאפוקי מלחמה, ובכח התפלה לבד יבא משיח צדקינו. ולא יצטרכו לפעולה טבעיות ולמלחמה, ובעוה\"ר בימינו אלה נסתמו הלבבות, ואין היכולת בידינו לשפוך שיח ותחנונים בלב שלם, אבל כבר הוכן כח התפלה ע\"י האבות הקדושים והשבטים, כמ\"ש בזוה\"ק ע' תולדות שע\"י צלותהון דצדיקיא יתרבי ויתוסף רבות קודשא לכל מאן דאצטריך, ובפרט על גלות האחרון ועל גאולה העתידה שראו כל זה ברוח קדשם והתפללו עליה, ושמורה כח וזכות תפילתם לעת חננה כי בא מועד, ובודאי שיהיה לסיוע ועזר שיתקבל גם תפילתינו אכיה\"ר.",
            "explanation": "ביאור העניין הוא שבדברי יהודה נרמז שהמלחמה והתפילה אינן סותרות זו את זו, אלא ישנם זמנים שהמלחמה נעשית ברצון העליון ובסיוע התפילה, ובזמנים אחרים הישועה באה בכח התפילה לבדה, ולכן התפילה היא תמיד חובה ואינה מותנית במצב המלחמתי."
        },
        {
            "source": "Divrey Yoel, Torah, Vayigash (Torah #4, Passage #2)",
            "relevant_sentences": "\"אין משפטים ישירים\"",
            "passage": "ג) במד\"ר ויגש אליו יהודה ר' יהודה ור' נחמי' ורבנן, רי\"א הגשה למלחמה וכו' ר\"נא הגשה לפיוס, רבנן אמרי הגשה לתפלה וכו', אם למלחמה אני בא אם לפיוס אני בא אם לתפלה אני בא, עכ\"ד המדרש, וצ\"ב מ\"ש אם לתפלה דלא יתכן תפלה לבשר ודם זולת להקב\"ה.",
            "explanation": "ביאור העניין הוא שהמדרש מבאר כי התפילה היא פעולה עצמאית ונשגבה שאינה תלויה במלחמה או פיוס, אלא היא חובה תמידית כלפי הקב\"ה, ולכן אין לראותה כתנאי אלא כמצווה קבועה ומחייבת בכל מצב."
        },
        {
            "source": "Divrey Yoel, Torah, Vayigash (Torah #1, Passage #1)",
            "relevant_sentences": "\"אבל מ\"ש אם לתפלה איך תלה את התפלה בתנאי ובספק, והרי התפלה מחוייבת בכל אופן.\"  \n\"א\"כ אף אם יבוא למלחמה, יתחייב להקדים אלי' התפלה, דאין לך צרה גדולה מהמלחמה, ולמה תלה את התפלה בתנאי ובספק.\"",
            "passage": "ב) עוד במדרש ויגש אליו יהודה ויאמר וגו' ר' יהודה אומר הגשה למלחמה שנאמר וכו', ר' נחמי' אומר הגשה לפיוס וכו', רבנן אמרי הגשה לתפלה וכו', ר' אלעזר אמר פשט להון (שהי' יהודה מפרש דבריו ליוסף וא\"ל) אם למלחמה אני בא, אם לפיוס אני בא. אם לתפלה אני בא ע\"כ, ראוי להבין דבשלמא מ\"ש אם למלחמה אם לפיוס. תלה הדבר בדרך תנאי וע\"צ הספק, דאם ירצה במלחמה אלחום עמו, ואם בפיוס אכנס עמו לפיוס, אבל מ\"ש אם לתפלה איך תלה את התפלה בתנאי ובספק, והרי התפלה מחוייבת בכל אופן. ואף לפי\"ד הרמב\"ן ז\"ל דס\"ל תפלה דרבנן. אבל בעת צרה חיובא דאורייתא הוא, א\"כ אף אם יבוא למלחמה, יתחייב להקדים אלי' התפלה, דאין לך צרה גדולה מהמלחמה, ולמה תלה את התפלה בתנאי ובספק.",
            "explanation": "ביאור העניין הוא שהדברי יואל מבאר כי התפילה היא חובה מוחלטת בכל מצב, ובפרט בעתות צרה כמו מלחמה, ולכן אין לתלותה בתנאי או ספק, אלא יש להקדימה לכל פעולה אחרת, שכן היא מהווה את היסוד וההכנה לכל מעשה."
        },
        {
            "source": "Divrey Yoel, Torah, Vayigash (Torah #2, Passage #10)",
            "relevant_sentences": "\"אך הענין הוא דדרך הצדיק בדברו עם אנשים. אזי הוא מדקדק בדבריו להשכיל, שיהיו דבריו נשמעים במשמעותיהן כפשוטן לאיש המדבר עמו, ועיקר תוכן דבר שמכוין באותן הדיבורים שיהיו תפלה ותחנונים לפני המקום ב\"ה וב\"ש\"",
            "passage": "ויבואר דברי המדרש הנ\"ל (בדרוש הקודם) ויגש אליו יהודה רי\"א הגשה למלחמה ר' נחמי' אומר הגשה לפיוס וכו' רבנן אמרי הגשה לתפלה ואלו ואלו דא\"ח, שהיו כלולים בדבריו כל אלו הבחינות, וע\"ד שפירשנו בדיבוריו של יוסף שמלבד הבנה הפשוטה שבהם, פנימיות הדיבורים היה בהם רמז ורמיזא לדברים גבוהים ונעלמים. וכמו\"כ היו דיבוריו של יהודה, וע\"ד שכתב בספה\"ק נוע\"א זלל\"ה בפרשת וישלח) עה\"פ כה תאמרון לאדוני לעשו עם לבן גרתי וגו'. ודקדק ז\"ל דלמה לו ליעקב לאמר בביתו בדברו עם המלאכים להזכיר ולקראו לעשו אדוני, גם הלמד של לעשו אין לו שחר, וכך הי\"ל לומר לאדוני עשו, וגם מה שפירש רש\"י ז\"ל עם לבן גרתי ותרי\"ג מצות שמרתי, וכי בשביל זה ישא חן בעיניו וכו'. אך הענין הוא דדרך הצדיק בדברו עם אנשים. אזי הוא מדקדק בדבריו להשכיל, שיהיו דבריו נשמעים במשמעותיהן כפשוטן לאיש המדבר עמו, ועיקר תוכן דבר שמכוין באותן הדיבורים שיהיו תפלה ותחנונים לפני המקום ב\"ה וב\"ש, והכוונה בזה שמסתיר דבריו של תפלה בהדיבורים שמדבר עם האדם, ואינו מתפלל תפלתו הצורך לו בפירוש, הוא למען המקטרג שלא יבין כוונתו ולא יקטרג עליו וכו', וז\"ש יעקב אל המלאכים כה תאמרון באופן זה ובכוונה זאת תאמרון כל דבריכם, לאדוני ר\"ל שיהי' כוונתכם לאדון הכל הוא הבוי\"ת ויתעלה, וגם דברים כפשוטן לעשו שיהיה דברי רצוי אליו, וז\"ש כה אמר עבדך יעקב עם לבן גרתי וגו' ומשתמע לתרי אנפין שהוא דברי מליצה לפניו ית\"ש ששמר תרי\"ג מצות, וזכות זה יעמוד לו שינצל מעשו, וגם דברים כפשוטן דברי רצוי והכנעה לעשו שהייתי גר ולא נעשתי שר וחשוב כפרש\"י, עיי\"ש שפי' בדרך זה כל הפסוקים ויהי לי שור וגו' שמשמעותן וכוונתו לתרי אנפין. ומעתה יתפרש כמו\"כ בדברי יהודה אל יוסף שאמר בי אדוני ידבר נא עבדך דבר באזני אדוני וגו', ובמה שהזכיר אדוני היתה תוכן כוונת דבריו תפלה ותחנונים לפני הבוי\"ת ומלין לצד עילאה ימלל אלא שהסתיר והלביש בדיבוריו גם משמעות פשוטו שיהיה דברי רצוי ופיוס ודברים קשות ליוסף הנאמר אליו, וא\"ש מ\"ש ז\"ל במדרש שהיה הגשה זו לפיוס ולמלחמה ליוסף כפי משמעותן הפשוט. והגשה לתפלה להבוי\"ת כנ\"ל.",
            "explanation": "ביאור העניין הוא שהצדיק, אף בדברו עם אנשים, מדקדק בדבריו שיהיו נשמעים כפשוטם לאדם המדבר עמו, אך עיקר כוונתו היא תפילה ותחנונים לפני המקום ב\"ה, ובכך מראה שהתפילה היא חובה בכל מצב, גם בעת מלחמה, ואין היא מותנית אלא מהותית."
        }
    ]
}