{
    "question_id": "ede056c0-4e50-4cc2-b614-dd83420fb642",
    "question": "what practical lessons can we learn from parshas vayigash?",
    "selected_passages": [
        {
            "section": "Torah",
            "topic": "Vayigash",
            "torah_number": "3",
            "passage_number": "11",
            "passage": "והנה דבריהם הקדושים נשארו נצחיות לדורי דורות, שכבשו דרך ופתחו מעיין ישועה לבניהם אחריהם, וכמ\"ש ק\"ז הייטב לב זלל\"ה (בפרשת תולדות) על מה דאיתא בזוה\"ק: כ' שנין אשתהי יצחק עם אתתי' ולא אולידת עד דצלי צלותיה, בגין דקוב\"ה אתרעי בצלותהון דצדיקייא, מ\"ט בגין דיתרבי ויתוסף רבות קודשא לכל מאן דאיצטרך בצלותהון דצדיקייא עכ\"ד הזוה\"ק. וכתב ק\"ז זלל\"ה למה זה דומה לצינור שנסתם ואם יבוא אחד ויפתחנו וינקנו שוב הוא פתוח לכל, וכמו\"כ ע\"י תפלתן של צדיקים נפתחו צנורות הישועה והחסדים וכל מי שצריך למימי הישועה ישאב בששון מאותו הצינור וכענין דכתיב ושאבתם וגו' ממעיני הישועה, וביארו המפרשים כי ישועת צדיקים הוא כמו מעיין הנובע ישועה לכל מיד ולדורות, ולכן הקב\"ה מתאווה לתפלתן שע\"י תפלתן יפתח הצינור והמעיין לכל מי שצריך לאותו דבר ע\"כ בייטב לב. ויובן בזה דברי המדרש מים עמוקים עצה בלב איש וגו' משל לבאר עמוקה מלאה צונן והיו מימי' צוננין ויפין, ולא היתה ברי' יכולה לשתות הימנה, בא אחד וקשר חבל בחבל וכו' ודלה הימנה ושתה התחילו הכל דולין הימנה ושותין, כך לא זז יהודה משיב ליוסף וכו', דהנה השבטים הק' לא היו צריכים לפעולות אלו בשביל עצמם. כי היה בכח קדושתם לפעול ישועה לעצמם בלאו הכי, אבל עשו כל זה שיהיה מעיין ישועה נמשך לדורות, ויש מקום בדבריהם הקדושים לדורות, כל דור לפי המצב ולפי המאורעות ולכך היו דבריהם מראין פנים לכל צד, שיהיה נמשך לדורות מעיין הנובע ישועה לכל מי שצריך, וכך היה יהודה משיב ליוסף דבר על דבר עד שעמד על לבו והכל דולין ושותין מהם לדורי דורות.",
            "english_translation": "Here's the English translation, preserving the Hasidic terminology:\n\nIndeed, their holy words remain eternal for all generations, as they paved the way and opened a wellspring of salvation for their children after them. As the holy Yitav Lev wrote (in Parshat Toldot) regarding what is found in the holy Zohar: \"Isaac waited twenty years with his wife who did not bear children until he prayed his prayer, because the Holy One, blessed be He, desires the prayers of tzaddikim (righteous ones). Why? Because through the prayers of tzaddikim, holy abundance increases and is added for all who need it.\"\n\nThe holy Yitav Lev wrote that this is comparable to a blocked pipe - if someone comes and opens it and cleans it out, it then remains open for all. Similarly, through the prayers of tzaddikim, the channels of salvation and kindness are opened, and whoever needs the waters of salvation can draw joyfully from that pipe, as it is written, \"And you shall draw water with joy from the wellsprings of salvation.\" The commentators explained that the salvation of tzaddikim is like a flowing spring bringing salvation immediately and for generations, and therefore the Holy One, blessed be He, desires their prayers, for through their prayers the pipe and spring are opened for all who need that thing.\n\nThis explains the words of the Midrash: \"Deep waters are counsel in the heart of man...\" - A parable of a deep well full of cold water, and its waters were cold and good, but no creature could drink from it. Someone came and tied rope to rope, etc., and drew from it and drank. Then everyone began drawing and drinking from it. Similarly, Judah did not cease responding to Joseph, etc.\n\nThe holy tribes did not need these actions for themselves, as they had the power of their holiness to bring about salvation for themselves regardless. But they did all this so that there would be a wellspring of salvation flowing for generations, and there is relevance in their holy words for all generations, each generation according to its situation and circumstances. Therefore their words showed different aspects, so that the flowing spring of salvation would continue for generations for whoever needs it. Thus Judah kept responding to Joseph point by point until he understood his heart, and all draw and drink from them for all generations.",
            "average_score": 8.0,
            "reference": "Divrey Yoel, Parshas Vayigash, Torah #3, Passage #11"
        },
        {
            "section": "Torah",
            "topic": "Vayigash",
            "torah_number": "12",
            "passage_number": "3",
            "passage": "ומבואר בספה\"ק די\"ב שבטי י\"ה הם כנגד י\"ב צירופי הוי', וכל צירוף מורה על מדה ובחי' אחרת, נמצא לפי\"ז שעבדו השי\"ת כאו\"א במדה ובדרך אחרת, וז\"ש המדרש ארי ושור מתווכחין זה בזה, שאין מודתם ודרך עבודתם שוה אבל עושה שלום במרומיו שלענין כבוד שמים יש שלום ביניהם בלי שום פירוד כלל וכ\"א מייחד לבבו להקב\"ה. וידוע שיעקב אבינו ע\"ה הוה כלול מכל המידות כולן ובזה יבואר אמרם ז\"ל במדרש שאמחו בניו ליעקב כשם שאין בלבך אלא אחד כך אין בלבנו' אלא אחד, פי' אף שבפעולתינו בעבודת השי\"ת יש השתנות בא' מחבירו אבל בתוכיות ופנימיות הלב אין לנו אלא לב אחד, ובחי' זו נרמז בדברי המדרש כאן שיהודה לא זז משם עד שעמד על לבו, פי' שהבין פנימיות לבו של יוסף והבחין שיש שלום ביניהם וכולם לכוונה א' עובדים לייחד לבבם להקב\"ה, וההשתנות שביניהם הוא חק בפעולת המעשה, וע\"כ ואחר שעמד על לבו השיג שאין פירוד ביניהם כלל, השי\"ת יעזור לייחד לבבנו לשמו יתברך באמת. זא",
            "english_translation": "Here's the English translation, preserving the Hasidic terminology:\n\nIt is explained in the holy sefarim that the 12 tribes of G-d correspond to the 12 permutations of the Divine Name (Havaya), and each permutation indicates a different middah (attribute) and aspect. According to this, each one served Hashem in a different way and approach. This is what the Midrash means when it says that the lion and ox argue with each other - their middot and ways of service are not the same, but \"He makes peace in His heights\" means that regarding kavod shamayim (Heaven's honor), there is peace between them without any separation at all, and each one unifies their heart to the Holy One, Blessed be He.\n\nIt is known that our father Yaakov, peace be upon him, encompassed all the middot together. This explains what our Sages said in the Midrash that his sons said to Yaakov, \"Just as in your heart there is only One, so too in our hearts there is only One.\" This means that although in our actions in serving Hashem there are differences between one and another, in the inner depths of our hearts we have only one heart.\n\nThis aspect is alluded to in the words of the Midrash here that \"Yehudah did not move from there until he understood his heart,\" meaning he understood the inner heart of Yosef and recognized that there was peace between them, and they all served with one intention to unify their hearts to the Holy One, Blessed be He. The differences between them were only in the outer actions. Therefore, after he understood his heart, he realized there was no separation between them at all. May Hashem help us to unify our hearts to His blessed Name in truth.",
            "average_score": 8.0,
            "reference": "Divrey Yoel, Parshas Vayigash, Torah #12, Passage #3"
        },
        {
            "section": "Torah",
            "topic": "Vayigash",
            "torah_number": "7",
            "passage_number": "2",
            "passage": "והנה יעקב אבינו ע\"ה שלח את יהודה לפניו להורות לפניו גושנה, ולהכין לו בית תלמוד כאמרם ז\"ל, ולכאורה היה יכול יוסף בעצמו להכין את זאת, גם היה אפשר לעשות שליחות זו ע\"י אחד מהשבטים ומדוע שלח את יהודה שהיה מלך, אך נראה עפומ\"ד במדרש וירא את העגלות אשר שלח יוסף ואותן העגלות ששלח פרעה היכן היו, א\"ל אותן עגלות ששלח פרעה לשאת אותו היתה ע\"ז חקוקה עליהם עמד יהודה ושרפן, למוד הוא השבט הזה להיות שורף ע\"ז, ודייקו ביפ\"ת ובנזה\"ק מדוע לא שרפם יוסף בעצמו, ותירצו דמפני שיהודה מסוגל לזה ע\"כ הניחו אליו, ובנזה\"ק האריך לבאר עפי\"ד המדרש אין אנו בקיאים בדקדוקי ע\"ז כיעקב אבינו, וכמו כן יהודה היה בקו בדקדוקי ע\"ז עכ\"ד, וע\"כ שלח יעקב אבינו את יהודה שהוא יכיר ויבחין גם בחי' ע\"ז הטמון בסתר, גם מחשבת ע\"ז, דהרי למוד אותו שבט להיות שורף ע\"ז, ולפי שרצה יע\"א להכין לו בית שמשם תצא הוראה, ע\"כ היה צורך לזה הבחנה והבדלה שלא יהיה מעורב בו אף שמץ ע\"ז ולזה מסוגל רק יהודה כנ\"ל, וע\"כ שלח את יהודה דייקא שהוא יכין לו בית תלמוד, שלא יהיה בה שום שמץ ע\"ז ומשם תצא הוראה, ומזה אפשר לראות עד היכן צריכין להיות נשמר מדרך ע\"ז שלזה צריך חכמה יתירה להבין ולהבדיל ולהפריש מהם, ולזה הסמיכו לכאן ההלכה ילמדנו רבינו אימתי מברכין על הנר במוצ\"ש כך שנו רבותינו אין מברכין על הנר עד שיאותו לאורו, והיינו מטעמא שצריך הכרה יתירה להבדיל ומנין למדו מן הקב\"ה שנאמר וירא אלקים את האור כי טוב ואח\"כ ויבדל אלקים בין האור ובין החושך ומה\"ט את יהודה שלח לפניו מפני שהוצרך להכרה יתירה להכין ביהמ\"ד שיהיה מסוגל וראוי לכך שמשם תצא הוראה.",
            "english_translation": "Here's the English translation, preserving the Hasidic concepts and terminology:\n\nOur father Yaakov, peace be upon him, sent Yehudah ahead of him to prepare the way to Goshen, and to establish a Beis Medrash (house of study) as our Sages said. Seemingly, Yosef himself could have prepared this, or it could have been done through any of the other tribes, so why did he send Yehudah who was king?\n\nIt appears to be explained based on the Midrash regarding \"and he saw the wagons that Yosef sent\" - where were the wagons that Pharaoh sent? It teaches that those wagons that Pharaoh sent to carry him had idolatrous images engraved on them, so Yehudah stood up and burned them. This tribe was accustomed to burning avodah zarah (idolatry). The Yefeh Toar and Nitzotzei Kedushah questioned why Yosef didn't burn them himself, and they answered that since Yehudah was especially suited for this task, it was left to him. The Nitzotzei Kedushah elaborates based on the Midrash that \"we are not as expert in the details of avodah zarah as our father Yaakov,\" and similarly, Yehudah was expert in the details of avodah zarah.\n\nTherefore, Yaakov sent Yehudah because he could recognize and discern even hidden aspects of avodah zarah, including thoughts of idolatry, as that tribe was accustomed to burning avodah zarah. Since Yaakov wanted to establish a house from which Torah instruction would emanate, it required careful discrimination to ensure there would be no trace of avodah zarah, and only Yehudah was suited for this as mentioned above. Therefore, he specifically sent Yehudah to prepare the Beis Medrash, ensuring it would be completely free of any trace of avodah zarah, and from there Torah instruction would emerge.\n\nFrom this, we can see how carefully one must guard against the ways of avodah zarah, requiring extra wisdom to understand, distinguish, and separate from them. This connects to the halachah they taught: \"When do we make the blessing over fire at the conclusion of Shabbos? Our rabbis taught that we don't make the blessing until we can benefit from its light.\" This is because extra recognition is needed to make distinctions, and where did they learn this from? From the Holy One, Blessed be He, as it says, \"And God saw the light that it was good\" and afterward \"God separated between the light and the darkness.\" For this reason, he sent Yehudah ahead, because extra discernment was needed to prepare a Beis Medrash that would be suitable and worthy for Torah instruction to emanate from it.",
            "average_score": 8.0,
            "reference": "Divrey Yoel, Parshas Vayigash, Torah #7, Passage #2"
        },
        {
            "section": "Torah",
            "topic": "Vayigash",
            "torah_number": "23",
            "passage_number": "7",
            "passage": "ומכאן תשובה ניצחת למנהיגי דורנו אשר שמו יד לפה מלהוכיח בעושי רשעה, בטענת הצטדקות כי אינם בקיאים בתחבולות בעלי רשע, ועוצמים עיניהם מראות ברע, כי לא יאתה לתכונת נפשם לראות ולהרהר במעשה רשע, דאדרבה זקני בי\"ד חייבין להשכיל ולהבין כל בחינת הרע, ולידע כל פירצה חדשה, כדי שיוכלו לגדור גדר ולעמוד בפרץ ולכך התוודו זקני בית דון ובקשו סליחה על שלא השגיחו בעין פקיחא על בני דורם, וזה שרמז עו יוסף ליעקב אבינו שלמד עמו פ' עגלה ערופה, שאל יפלא בעיני אביו מנין הוא מכיר כל מין ע\"ז להשמר ממנה, כו מפרשת עגלה ערופה שהתוודו זקני בי\"ד על שלא ראו תקלת הדור, משם למד שצריך להבין ולהכיר כל עון ומכשול, ושפיר מיושב הדרש עם הפשט כו הא בהא תליא, דאליבא דאמת שלח לו עגלות ממש. אבל רמז לו שמפרשת עגלה ערופה שלמד עמו ידע להתבונן בכל זה.",
            "english_translation": "Here is the English translation:\n\nFrom here there is a decisive response to the leaders of our generation who have placed their hand over their mouth, refraining from rebuking those who commit wickedness, with the self-justifying claim that they are not familiar with the schemes of evildoers, and they close their eyes from seeing evil, saying that it does not befit their spiritual nature to see and contemplate acts of wickedness. On the contrary, the elders of the Beit Din are obligated to comprehend and understand every aspect of evil, and to know every new breach, so that they can build a fence [against sin] and stand in the breach. This is why the elders of the Beit Din confessed and sought forgiveness for not watching with a vigilant eye over their generation.\n\nThis is what Yosef hinted to our father Yaakov when he studied with him the passage of the Eglah Arufah (the broken-necked heifer). [He was showing] that his father should not wonder how he knows about all types of avodah zarah (idolatry) to guard against it, for from the passage of Eglah Arufah, where the elders of the Beit Din confessed about not seeing the stumbling blocks of the generation, from there he learned that one needs to understand and recognize every sin and obstacle. This interpretation aligns well with the simple meaning, as they are dependent on each other, for in truth he sent actual wagons, but he hinted to him that from the passage of Eglah Arufah that he studied with him, he knew to contemplate all this.",
            "average_score": 8.0,
            "reference": "Divrey Yoel, Parshas Vayigash, Torah #23, Passage #7"
        },
        {
            "section": "Torah",
            "topic": "Vayigash",
            "torah_number": "20",
            "passage_number": "15",
            "passage": "ואפ\"ל בזה מאמר הכתוב כו עיניכם הרואות וגו' כי פו המדבר אליכם, ודרשו חז\"ל כפו כן לבי, כי הנה בפסוק שלפניו כתוב וכלכלתו אתך שם כו עוד חמש שנים רעב פן תורש אתה וביתך וכל אשר לך, ולכאורה הרי לא נתקיים הבטחתו מה שנדר לזונם ולכלכלם עוד חמש שנים, שהרי אמרז\"ל משבא יעקב אבינו למצרים נפסק הרעב מיד בזכותו ויתכן שהשיג יוסף ברוה\"ק שעתיד הרעב להתבטל עצו יע\"א, כי אמרו רז\"ל בפדר\"א שרוח הקודש הנהיגתו מנעוריו ועד יום מותו, א\"כ מדוע אמר וכלכלתי אתך וגו' כו עוד חמש שנים הרעב ולא נתקיים נדרו, אולם הרי קיי\"ל דאין סומכין על הנס, ע\"כ יוסף הצדיק השתתף בצערם וקיבל על עצמו בכל לבו ונפשו לזונם ולכלכלם עוד חמש שנים, ובזה כבר קיבל השכר על כל החמש שנים אף שנפסק הרעב אח\"כ, כמבואר בדברי הספרי הנ\"ל שמגיע שכר על האמירה אף שלא הספיק ליתן, וכדי שלא יקשה לאחיו עליו. האיך הותר לו לנדור בכהאי גוונא והלא אסור לנדור אלא באומר הרי זו, אמנם ביררנו לעיל דבמחשבתו רצויה מותר, ע\"כ הסמיך לומר כי עיניכם הרואות כו פו המדבר אליכם, ודרשו רז\"ל כפי כן לבי. היינו שמחשבתי וכוונתי רצויה, ובכהאי גוונא מצוה לנדור ומקבל שכר על האמירה כמעשה, והנה ישנם כאלו שחושבים כי בלאו הכי הוא מעשה נסים, לקיים ולהחזיק מוסד גדול בלי עין הרע בהוצאות גדולות ע\"י מתו מעט ומספר מצומצם של יר\"א, וע\"כ סומך הוא על הנס וחושב שאינו צריך ליקח חבל ויבוא הנס מ\"מ, אבל אינו כן כי אין סומכין על הנס. ורק בכח הזה שבנ\"י נותנים במסירות ובמחשבה רצויה אנו מתקיימים למעלה מדרך הטבע.",
            "english_translation": "Here's the English translation, preserving the Hasidic terminology:\n\nOne can explain the verse \"Your eyes see... for it is my mouth speaking to you,\" which Chazal interpret as \"as my mouth is, so is my heart.\" In the previous verse it states \"I will sustain you there... for there are yet five years of famine, lest you come to poverty, you, and your household, and all that you have.\" However, seemingly Yosef's promise to feed and sustain them for five more years wasn't fulfilled, as Chazal say that when Yaakov Avinu came to Egypt, the famine immediately ceased in his merit.\n\nIt's possible that Yosef knew through Ruach HaKodesh (Divine inspiration) that the famine would end with Yaakov's arrival, as Chazal say in Pirkei D'Rabbi Eliezer that Ruach HaKodesh guided him from his youth until his death. If so, why did he say \"I will sustain you... for five more years of famine\" when his vow wasn't fulfilled?\n\nHowever, we have a principle that one shouldn't rely on miracles. Therefore, Yosef HaTzaddik empathized with their suffering and took upon himself wholeheartedly to feed and sustain them for five years. For this, he already received reward for all five years even though the famine ended earlier, as explained in the aforementioned Sifri that one receives reward for the declaration even if unable to complete the action.\n\nSo his brothers wouldn't question how he was permitted to make such a vow, since it's forbidden to make vows except by saying \"Harei Zu\" (behold this is), we explained earlier that it's permitted with proper intention. Therefore, he immediately said \"Your eyes see... my mouth speaking to you,\" which Chazal interpret as \"as my mouth is, so is my heart\" - meaning his thoughts and intentions were proper, and in such a case it's a mitzvah to make a vow and one receives reward for the declaration as if for the action.\n\nThere are those who think that maintaining a large institution with great expenses through limited means and a small number of God-fearing supporters is anyway miraculous, and therefore rely on miracles, thinking they don't need to take action as the miracle will come regardless. But this isn't correct, as we don't rely on miracles. Only through the power of Jews giving with self-sacrifice and proper intention can we exist beyond natural means.",
            "average_score": 8.0,
            "reference": "Divrey Yoel, Parshas Vayigash, Torah #20, Passage #15"
        },
        {
            "section": "Torah",
            "topic": "Vayigash",
            "torah_number": "31",
            "passage_number": "4",
            "passage": "והנה יוסף הצדיק הי' שליחו של הקב\"ה לשום שארית בארץ ולהחיות בית ישראל לפליטה גדולה, אמנם אנן מה נענה שאין לנו יוסף הצדיק והקב\"ה שלח אותנו בארצות הגלות להעמיד בתי חינוך על טהרת הקודש בלי שום תערובת זר, וכולנו שלוחים לדבר מצוה זאת, והחוב על כל אחד מאתנו להתאמץ ולסייע לקיום החינוך הזה, ואני תקוה שתשרה ברכה במעשה ידינו ויגדלו פירות נאים ומשובחים. ובעזרתו יתברך גידולי ישיבתינו יתקיימו כולם נאמנים לה' ולתורתו הקדושה בדרך התורה והיראה, ולעת עתה הוא רק בבחי' שארית בארץ. אבל נקוה שיתברכו הדורות להחיות לפליטה גדולה ואמר הכתוב זרעו לכם לצדקה, והכוונה שהקב\"ה זורע את הצדקה שאדם עושה ולפי חשבון הגידולים משלם לו פירותיהן ופירות פירותיהן, והקב\"ה ישלם לכל אחד פירותיהן בעולם הזה והקרן קיימת לו לעולם הבא, ויזכנו ויחיינו לחזק ולקיים את דרך התורה בדרכי אבותינו ורבותינו הקדושים, ובמהרה נזכה לקבל פני משיח צדקנו ולהתגלות כבוד שמים עלינו במהרה בימינו אמן.",
            "english_translation": "Here's the English translation, preserving Hasidic terminology:\n\nBehold, Yosef HaTzaddik was the messenger of the Holy One, Blessed be He, to establish a remnant in the land and to sustain Beis Yisroel (the House of Israel) for a great deliverance. However, what can we say, as we don't have Yosef HaTzaddik, and the Holy One, Blessed be He, has sent us to lands of exile to establish houses of education (chinuch) in pure holiness without any foreign mixture. We are all messengers for this mitzvah, and it is the obligation of each one of us to strive and assist in maintaining this education.\n\nI hope that blessing will rest upon our handiwork, and beautiful and praiseworthy fruits will grow. With Hashem's help, the products of our yeshiva will all remain faithful to Hashem and His holy Torah in the way of Torah and yirah (fear of Heaven), and for now it is only in the aspect of a remnant in the land. But we hope that the generations will be blessed to sustain a great deliverance.\n\nThe verse states \"Sow for yourselves righteousness (tzedakah),\" meaning that the Holy One, Blessed be He, sows the tzedakah that a person does, and according to the calculation of growth, He pays him its fruits and the fruits of its fruits. Hashem will pay everyone their fruits in this world (Olam Hazeh), while the principal remains intact for the World to Come (Olam Haba).\n\nMay He merit us and sustain us to strengthen and maintain the way of Torah in the paths of our holy fathers and rabbis, and may we soon merit to receive our righteous Mashiach and witness the revelation of Heaven's glory upon us, speedily in our days, Amen.",
            "average_score": 8.0,
            "reference": "Divrey Yoel, Parshas Vayigash, Torah #31, Passage #4"
        },
        {
            "section": "Torah",
            "topic": "Vayigash",
            "torah_number": "20",
            "passage_number": "6",
            "passage": "ונא\"פ במאה\"כ לשום לכם שארית בארץ וגו' ע\"ד דאמרינן בגמרא לענין רבית (ב\"מ ע\"ה ע\"ב) אלו עוברין בל\"ת המלוה והלוה והערב והעדים, אמר אביי מלוה עובר בכולן וכו' ערב והעדים אין עוברין אלא משום לא תשימון עליו נשך, עכ\"ד הגמרא. ובגמרא (שם ס\"ב ע\"א) בשלמא כולהו עביד מעשה, אלא עדים מאו עביד, אלא לאו דשומא מילתא היא, הרי דאף שהערב והעדים לא עשו מעשה בגוף הענין אבל לפי שעל ידם נשלם והובא לידי גמר מחייבי בלאו דלא תשימון ושורש הפעולה נכלל במלת שימה, ועד\"ז יתבאר לענינינו דיוסף הצדיק הקדים לבא מצרימה, כדי להכין מקום לבני ישראל שיוכלו להתקיים בקדושתן בגלות מצרים שהוא ערות הארץ ומזוהם ביותר, ובכח קדושתו והנסיונות שעמד בהם והתגבר עליהם, וע\"י שנעשה מושל על שר של מצרים החליש כח הטומאה והקליפות בשורשן, ועי\"ז זכו ישחאל להיות נשמרים מעריות במצרים ובנ\"י עאלו ובנ\"י נפקו, ולא הי' בהם א' שנולד בפסול כאמרז\"ל, אמנם נוסף לזה הכין יוסף הצדיק כח הצלה לדורות העתידים עד גלות האחרון, שיוכלו ישראל להתגבר ולעמוד בנסיונות הגלות ויתקיימו בקדושתן אף בשפלות הנוראה בעיקבתא דמשיחא, שגלות מצרים שורש כל הגלות. והאבות והשבטים הק' היו שורש נשמות ישראל של כל הדורות, וכל מה שיש בענף יש בשורש, ע\"כ הם במעשיהם הק' פתחו צינור והכינו כח לכל דורות ישראל, וז\"ש לשום לכם שארית באחק ולהחיות לכם לפליטה גדולה, שהכין יוסף הצדיק יסוד ושורש התגברות לכל דורות ישראל, והוא ניצוץ הק' אשר נסתר בבחינת הנפש של כל איש ישחאל ומורשה לנו מאבוה\"ק, ובהתחלתו הוא רק בבחינת שארית, ואח\"כ יתרחב גבול הקדושה להחיות לכם לפליטה גדולה.",
            "english_translation": "Here's the English translation, preserving the Hasidic terminology:\n\nWe can explain the verse \"to establish for you a remnant in the land, etc.\" based on what is said in the Gemara regarding ribis (interest) [Bava Metzia 75b]: Those who transgress the negative commandment are the lender, borrower, guarantor, and witnesses. Abaye said the lender transgresses all [prohibitions], etc., while the guarantor and witnesses only transgress \"you shall not place upon him interest.\"\n\nThe Gemara [62a] asks: While all others perform an action, what action do the witnesses perform? Rather, is it not that the very act of establishing [the loan] is significant? Thus, even though the guarantor and witnesses didn't perform an actual deed in the matter itself, because the transaction was completed through them, they are liable for the prohibition of \"you shall not place,\" with the root of the action being included in the word \"placing.\"\n\nSimilarly, in our matter, Yosef HaTzaddik preceded going to Egypt to prepare a place for Bnei Yisrael so they could maintain their kedushah (holiness) in Egyptian exile, which was the ervat ha'aretz (most defiled land) and extremely contaminated. Through the power of his kedushah and the trials he withstood and overcame, and by becoming ruler over the sar (angel) of Egypt, he weakened the power of tumah (impurity) and klipot (negative forces) at their root.\n\nThrough this, Israel merited to be protected from immorality in Egypt - \"Bnei Yisrael entered and Bnei Yisrael left\" - and not one of them was born from improper relations, as our Sages said. Moreover, Yosef HaTzaddik prepared a power of salvation for future generations until the final exile, so that Israel could overcome and withstand the trials of exile and maintain their kedushah even in the terrible lowliness of ikveta d'meshicha (the footsteps of Mashiach), as the Egyptian exile is the root of all exiles.\n\nThe holy Avot and Shevatim were the root of all Jewish souls throughout the generations, and whatever exists in the branch exists in the root. Therefore, through their holy actions, they opened a channel and prepared strength for all generations of Israel. This is the meaning of \"to establish for you a remnant in the land and to sustain you for a great deliverance\" - that Yosef HaTzaddik established a foundation and root of strength for all generations of Israel. This is the holy spark which is hidden within the nefesh (soul) of every Jew, inherited from our holy forefathers. At first, it is only at the level of a \"remnant,\" but afterward, the boundary of kedushah expands \"to sustain you for a great deliverance.\"",
            "average_score": 8.0,
            "reference": "Divrey Yoel, Parshas Vayigash, Torah #20, Passage #6"
        },
        {
            "section": "Torah",
            "topic": "Vayigash",
            "torah_number": "29",
            "passage_number": "4",
            "passage": "ונצ\"מ בהקדם אמרם ז\"ל (יומא דף כ\"ח ע\"ב) מימיהן של אבותינו לא פרשה ישיבה מהם, היו במצרים ישיבה עמהם וכו', היו במדבר ישיבה עמהם וכו', ראוי להבין הטעם שכינו חז\"ל למקום תורה בשם ישיבה סתם, הרי כמו שישנם יושבי בית המדרש ישנם גם כן יושבי קרנות, ומשמעות לשון ישיבה סובל שניהם א\"כ מאן מפיס, והו\"ל לפרש יושבי ביהמ\"ד, אמנם ברור כי היושבי קרנות אינם ראויים להתכנות בשם ישיבה כלל, דלשון ישיבה מורה על דבר שהוא נצחי וקיים לעד, ורק התוה\"ק הוא נצחי ואין דבר זולתו, וע\"ד שבקש דוד המלך ע\"ה (תהלים ס\"א) אגורה באהלך עולמים, ודרשו רז\"ל (יבמות צ\"ו ע\"ב) וכי אפשר לו לאדם לגור בשני עולמים. אלא אמר דוד לפני הקב\"ה רבש\"ע יהי רצון שיאמרו דבר שמועה מפי בעוה\"ז. דאמר ר\"י וכו' כל ת\"ח שאומרים דבר שמועה מפיו בעולם הזה שפתותיו דובבות בקבר עכ\"ד הגמרא, וכמו כן המחזיקין במוסדות התורה ומסייעין לגדל דורות ישראל לתורה, יש לפעולה זו קיום נצחי לעד, ורק ישיבה של תורה מקרי ישיבה בשם העצם וכמו שארז\"ל במשנה (דאבות (פ\"ב מ\"ז) מרבה ישיבה מרבה חכמה, מבואר דלא מקרי ישיבה כו אם במקום שיש הרבצת התורה, והנה יעקב אבינו והשבטים הקדושים רצו להיות נפרדים מהמצרים לגמרי, ולטעם זה נתיישבו בארץ גושן. וז\"ש אל פרעה לגור בארץ באנו, היינו בארץ מצרים אנחנו בבחינת גרים, ועתה אישבו\" נא עבדיך בארץ גושן. להעמיד שם ישיבה ומקום להרבצת התורה שהוא דבר נצחי, וא\"א רק בגושן ששם יהיו מובדלין ומופרשים מהמצרים, וז\"ש הכתוב שוישב\" ישראל וגו' בארץ גושן להורות שקבעו שם ישיבה ובית תלמוד כפירש\"י ז\"ל.",
            "english_translation": "Here's the English translation, preserving the Hasidic terminology:\n\nIt can be explained by first considering what our Sages said (Yoma 28b): \"Our forefathers never ceased having a yeshiva with them. When they were in Egypt, they had a yeshiva with them... when they were in the desert, they had a yeshiva with them...\" We should understand why Chazal specifically used the term \"yeshiva\" to refer to a place of Torah, for just as there are those who sit in the Beis Midrash (study hall), there are also those who sit idly at street corners. The term \"sitting\" could apply to both, so what distinguishes one from the other? They should have specified \"those who sit in the Beis Midrash.\"\n\nHowever, it is clear that those who sit idly at street corners are not worthy of being called a \"yeshiva\" at all, because the term \"yeshiva\" indicates something that is eternal and endures forever. Only the holy Torah is eternal, and nothing else. This is similar to what King David requested (Psalms 61): \"Let me dwell in Your tent forever,\" and our Sages explained (Yevamos 96b): \"Is it possible for a person to dwell in two worlds? Rather, David said before the Holy One, Blessed be He: 'Master of the Universe, may it be Your will that they say teachings in my name in this world.' For Rabbi Yochanan said... any Torah scholar whose teachings are quoted in this world, his lips move in the grave.\"\n\nSimilarly, those who support Torah institutions and help raise generations of Jewish children in Torah - this activity has eternal existence. Only a Torah yeshiva is called a \"yeshiva\" in the essential sense, as our Sages said in the Mishnah (Avos 2:7): \"The more sitting (learning), the more wisdom.\" This clarifies that the term \"yeshiva\" only applies to a place where Torah is disseminated.\n\nOur forefather Yaakov and the holy tribes wanted to be completely separate from the Egyptians, and for this reason they settled in the land of Goshen. This is what they said to Pharaoh: \"We have come to sojourn in the land\" - meaning, in Egypt we are merely temporary residents - \"Now, please let your servants dwell in the land of Goshen.\" This was to establish there a yeshiva and place for spreading Torah, which is eternal, and this was only possible in Goshen where they would be separate and distinct from the Egyptians. This is what the verse means when it says \"And Israel dwelled... in the land of Goshen,\" indicating that they established there a yeshiva and house of study, as Rashi explains.",
            "average_score": 7.0,
            "reference": "Divrey Yoel, Parshas Vayigash, Torah #29, Passage #4"
        },
        {
            "section": "Torah",
            "topic": "Vayigash",
            "torah_number": "17",
            "passage_number": "9",
            "passage": "ובזה אפ\"ל דברי המדרש (הובא לעיל בדרוש הקודם) ואתם עלו לשלום אל אביכם, אמרין לי' השלו' דכולי' נשפה (פי' היפ\"ת ענין חשך כמו נשף שבמקרא כלומר זהו שלום של חשך ואפילה), ורוה\"ק צווחת שלום רב לאוהבי תורתך וצ\"ב ויתבאר לדרכינו דהנה יהודה ויוסף היו מדיינים זע\"ז, והיתה ההתנגדות שביניהם גדולה מאוד עד שרצה יהודה להחריב את כל מצרים כמבואר בדרז\"ל, ולכן אמרין לי' השלום דכולי' נשפה, איך יקרא לזה שלום והוא שלום של חשך ואפילה, אמנם כל התווכחותם הי' ע\"ד האמת ואלו ואלו דברי אלקים חיים, ומחלקותם הי' בדבר הלכה ועפ\"י דיני התורה כמ\"ש הפר\"ד והמפרשים ז\"ל, ומחלוקה כזו סופה לבוא לידי שלום וכמו שאירע להם באמת, וז\"ש רוה\"ק שלום רב לאוהבי תורתיך וגו', כי זהו השלום האמיתי אם כל א' מהחולקים רצונו ומבוקשו רק להשיג דעת התוה\"ק ע\"ד האמת, וז\"ש במדרש תנחומא הנ\"ל ואת יהודה שלח לפניו וכו' אתמול מתנגחין זה עם זה ועכשיו הוא משלחו אצלו הוי עושה שלום במרומיו, שהיתה בחי' השלום הזה השפעה מן השמים וע\"ד האמת, כבחי' השלום של מעלה והבן. דה",
            "english_translation": "Here's the English translation, preserving the Hasidic terminology:\n\nWe can explain the words of the Midrash (mentioned earlier in the previous discourse) on \"And you shall go up in peace to your father.\" They said to him that this peace is entirely \"nishpah\" (the Yefat To'ar explains this as darkness, like \"neshef\" in Scripture, meaning this is a peace of darkness and gloom). Yet the Ruach HaKodesh [Divine Spirit] calls out \"Great peace have they who love Your Torah.\"\n\nThis can be explained according to our approach: Yehudah and Yosef were arguing with each other, and the opposition between them was so great that Yehudah wanted to destroy all of Egypt, as explained by our Sages. Therefore, they said this peace is entirely \"nishpah\" - how can this be called peace when it is a peace of darkness and gloom?\n\nHowever, all their arguments were for the sake of truth, and \"both these and these are the words of the living God.\" Their disagreement was regarding halacha [Jewish law] and according to the laws of the Torah, as explained by the Pardes and other commentators. Such a disagreement will ultimately lead to peace, as indeed happened with them.\n\nThis is what the Ruach HaKodesh means by \"Great peace have they who love Your Torah\" - this is true peace when each of the disputants' desire and goal is only to understand the true meaning of the holy Torah. This is what the Midrash Tanchuma means when it says \"And he sent Yehudah before him... yesterday they were butting heads with each other, and now he sends him to him - this exemplifies 'He who makes peace in His heights.'\" This type of peace was a heavenly influence and based on truth, like the nature of peace in the upper realms. Understand this.",
            "average_score": 7.0,
            "reference": "Divrey Yoel, Parshas Vayigash, Torah #17, Passage #9"
        }
    ],
    "timestamp": "2024-12-31T20:43:27.319785",
    "metadata": {
        "total_passages_processed": 50,
        "selection_criteria": "Average score >= 7.0",
        "scoring_version": "3.0"
    }
}