{
    "question_id": "b1acec92-e92f-4fe2-b75d-57c81d7ed086",
    "question": "what can we learn from parshas vayigash",
    "selected_passages": [
        {
            "section": "Torah",
            "topic": "Vayigash",
            "torah_number": "1",
            "passage_number": "17",
            "passage": "ונבוא אל הביאור ונתחיל במה שהקשה הרמב\"ן ז\"ל והמזרחי והגו\"א דאין ראיית המילה ראיה גמורה, דלמא הי' ערבי מהול או מבני קטורה וכו', וגם ראיית לשון הקודש אינה ראיה כי רבים במצרים היו יודעים אותה כנ\"ל, ומקודם נבאר דכל א' מהראיות בירור גמור הוא וראוי לסמוך עליו, ואח\"כ נפרש למה הוצרכו לשניהם ביחד, ולא הספיק בא' מהם, והנה ראיית המילה יובן עפ\"י מ\"ש בזוה\"ק דהנוטר בריתו שריא עליה שם ש-ד-י מלבר, וח\"ו מי שאינו שומר בריתו קיימא עליה ס\"מ ושריא עליה, ואיתא בזוה\"ק (פ' לך) אברהם אבינו עד שלא נימול לא נגלה אליו הקב\"ה בשם א-ל שדי אלא לבתר, והכי תאנא, עבד קוב\"ה כתרין תתאין דלא קדישין, וכל אינון דלא אתגזרו יסתאבון בהון ורשימין בהון, ומאי רישומא אית בהון, דאיתחזי בהו שי\"ן דל\"ת ולא יתיר, ובג\"כ אסתאבין בהו ואתדבקין בהו. בתר דאתגזרו נפקין מאלין ועאלין בגדפוי דשכינתא, ואתגליא בהו יו\"ד רשימא קדישא, את קיימא שלים ואתרשים בהו ש-ד-י בקיומא שלים וכו', ומבואר כן בזוה\"ק בכמה מקומות דע\"י קיום הברית ושמירתו שריא עליה שמא קדישא, והנה ק\"ז הישמח משה זלל\"ה הקשה (בפרשת וישב) עה\"פ וירא אדוניו כי ה' אתו וגו', והיתכן האיך ראה אותו רשע את ה' אשר אתו, ואיך השיגה עין של אותו רשע לראות השראת השכינה והשם השורה עליו, עיי\"ש שמתרץ שראה הצלחתו שלא כדרך הטבע, והצלחה כזו אי אפשר להיות אלא ע\"י השראת השכינה ושם הוי' ב\"ה, ומזה הבין כי ה' אתו עיי\"ש, ובאמת ל\"ק קושיתו דמבואר במד\"ר במדבר (פ' י\"ד ס\"ג) וירא אדוניו כי ה' אתו, א\"ל אדוניו ליוסף אני מבקש לראות להקב\"ה, א\"ל יוסף הרי חמה א' מכמה שמשין שלו, ואין אתה יכול להסתכל בו, והאיך תוכל להסתכל בכבודו א\"ל הקב\"ה חייך בשביל כבודך אני נגלה עליו שנאמר וירא אדוניו כי ה' אתו, ובזוה\"ק וידע אדוניו כי ה' אתו אין כתיב כאן, אלא וירא אדוניו כי ה' אתו, דהא בעיני' הוה חמי וכו' עיי\"ש, ולדרכינו יובן כי היה שורה על יוסף הצדיק בחי' השם יתברך, ע\"י שהי' נוטר בריתו וכמ\"ש בזוה\"ק עה\"פ אחרי ראותי את פניך כי עודך חי, דאתקיימת ברזא דברית קדישא דאקרי חי העולמים, ויעקב ראה זאת על פניו של יוסף, ומזה ידע שלא חטא, אלא שאין אותו הרשע פוטיפר כדאי להשגת ראיה זו, אלא משום כבודו של יוסף הצדיק שחשדוהו בכשפים, ניתן לו מן השמים השגת ראיה זו לשעה קלה, וראה כי ה' אתו, והשכינה שורה עליו, ועל אחת כמה וכמה השבטים הקדושים ראו עליו השראת השם יתברך ע\"י המילה, וע\"כ במה שהראה להם המילה, היה ראיה חזקה ובירור גמור שהוא יוסף, ואין כאן מקום להסתפק שמא הוא ערבי מהול או מבני קטורה, דבחי' זו של השראת השם (הוי' ב\"ה) יתברך שראו עליו, אין מציאות שיהיה אלא בצדיקים וקדושים נוטרי הברית, ומעתה היתה ראיית המילה נכונה וברורה.",
            "english_translation": "Here's the translation, preserving Hasidic terminology:\n\nLet us proceed with the explanation, beginning with what the Ramban z\"l, Mizrachi, and Gur Aryeh questioned - that the proof from circumcision is not complete proof, as perhaps he was a circumcised Arab or from the children of Keturah, etc. Also, the proof from the holy tongue (Hebrew) is not conclusive since many in Egypt knew it, as mentioned above.\n\nFirst, let us explain that each proof is complete verification and worthy to rely upon. Then we will explain why both proofs together were necessary, and why one alone was not sufficient.\n\nThe proof from circumcision can be understood based on what is written in the holy Zohar - that one who guards his covenant (bris) has the name Sha-dai manifest upon him externally, and heaven forbid, one who does not guard his covenant has the Samech Mem (Satan) dwelling upon him.\n\nIt states in the holy Zohar (Parshas Lech Lecha) that our father Abraham, before he was circumcised, the Holy One Blessed be He did not reveal Himself to him with the name E-l Sha-dai until afterwards. And so it was taught: The Holy One Blessed be He made lower crowns that are not holy, and all those who are not circumcised become defiled through them and are marked by them. What is this mark? The letters Shin and Dalet appear on them, but nothing more, and therefore they become defiled and attach themselves to these forces. After they are circumcised, they depart from these forces and enter under the wings of the Shechinah, and the holy letter Yud is revealed to them - the complete sign of the covenant, and Sha-dai is inscribed upon them completely.\n\n[Translation continues but reaches character limit. Would you like me to continue with the rest?]",
            "average_score": 8.0,
            "reference": "Divrey Yoel, Parshas Vayigash, Torah #1, Passage #17"
        },
        {
            "section": "Torah",
            "topic": "Vayigash",
            "torah_number": "8",
            "passage_number": "12",
            "passage": "ונקדים דברי האוה\"ח הק' עה\"פ אנכי ארד עמך מצרימה וז\"ל: מהכתוב משמע כי ירדה עמו שכינה, וקשה לדבריהם ז\"ל שאמרו כי מצרים להיותה מלאה גילולים לא היתה שכינה שם וכו', אכן אשכולך כי הדרגת אור השכינה רבים המה, הלא תמצא שעשרה שיושבים ועוסקים בתורה שכינה שרויה ביניהם, ואפילו ב' ואחד אמרו ז\"ל כו מצויה שכינה, ומצינו שלא ירדה שכינה ביניהם של ישראל. אלא אחר שעשו משכן ואחר כמה הכנות האמורים וכו'. אלא וודאי יש הדרגות אין מספר להשראת שכינה, בסוד כי גבוה מעל גבוה שומר וכו' עכ\"ל. ובזה יתבאר דברי המדרש ילקוט הנ\"ל כי ארץ מצרים בין עושין רצונו של מקום ובין אין עושין רצונו של מקום הרי לכם ארץ מצרים, פי' שהשראת השכינה שירדה עם ישראל למצרים, אינה מסתלקת משם בין עושין רצונו של מקום ובין אין עושין רצונו של מקום כי בחינה זו של השראת השכינה שיש עם ישראל בגלותם, יש עמהם גם בהסתר היותר גדול, משא\"כ בחי' השראת השכינה בארץ ישראל שהוא גילוי שכינתו ית\"ש. ע\"ד שהיה בבית המקדש, זה הוא דוקא כשישראל עושין רצונו של מקום ואם לאו ח\"ו אתם גולין מעלי' כמאמר הכתוב לא תקיא הארץ אתכם. והנה חכמינו ז\"ל דרשו עה\"פ ואנכי אעלך גם עלה אעלך בגלות זה, גם עלה בגליות אחרות, שמאז הבטיחנו הקב\"ה לגאול אותנו מן הגליות וגם גלות זה בכלל, ויעזור הקב\"ה שיקויים במהרה הבטחה זו של גם עלה, ובמהרה נזכה לראות בישועת כל ישראל ושמחתן בנחת ובשמחה ובהתגלות כבוד שמים עלינו במהרה בימינו אמן.",
            "english_translation": "Here's the translation, preserving the Hasidic terminology:\n\nLet us preface with the words of the Or HaChaim HaKadosh on the verse \"I will go down with you to Egypt.\" He writes: From the verse it implies that the Shechinah (Divine Presence) descended with him, but this is difficult according to our Sages who said that Egypt, being full of idols, did not have the Shechinah there. However, I will tell you that there are many levels of the light of the Shechinah. We find that when ten people sit and engage in Torah, the Shechinah dwells among them, and even with two or one person, our Sages said the Shechinah is present. Yet we find that the Shechinah did not descend among Israel until after they built the Mishkan (Tabernacle) and after several preparations. Rather, certainly there are countless levels of the dwelling of the Shechinah, in the secret of \"for one higher than the high watches.\"\n\nThis explains the words of the Midrash Yalkut mentioned above that regarding Egypt, \"whether they do the will of Hashem or not, behold Egypt is yours.\" This means that the dwelling of the Shechinah that descended with Israel to Egypt does not depart from there whether they do Hashem's will or not, because this level of the Shechinah's presence that accompanies Israel in their exile remains with them even in the greatest concealment. This is unlike the dwelling of the Shechinah in Eretz Yisrael, which is a revelation of His blessed Presence, as it was in the Beis HaMikdash (Holy Temple). This only occurs when Israel does the will of Hashem; if not, Heaven forbid, \"you will be exiled from it,\" as the verse states, \"the land will not vomit you out.\"\n\nOur Sages interpreted the verse \"And I will surely bring you up\" to refer to this exile, and \"surely bring you up\" to refer to other exiles, for from then Hashem promised to redeem us from the exiles, including this exile. May Hashem help fulfill this promise of \"surely bring you up\" speedily, and may we merit to see the salvation of all Israel and their joy with comfort and happiness, and the revelation of Heaven's glory upon us, speedily in our days, Amen.",
            "average_score": 8.0,
            "reference": "Divrey Yoel, Parshas Vayigash, Torah #8, Passage #12"
        },
        {
            "section": "Torah",
            "topic": "Vayigash",
            "torah_number": "10",
            "passage_number": "5",
            "passage": "ועד\"ז נבין לענינינו כי מתחלה התנכר אליהם יוסף ונדמה להם כאיש מצרי, וע\"כ כששאל אותם השלום אביכם הזקן העודנו חי, השיבו לו כפשוטו עודנו חי, וכוונת תשובתם הי' כפי הבנתם בשאלתו על חיות הגוף כלשון בני אדם ההמוניים ובעלי החומר, אמנם עכשיו שהתוודע לפניהם ואמר אני יוסף העוד אבי חי, הבינו שאין כוונת שאלתו על חיות הגשמי, כי אם על בחינת השראת השכינה שזהו חיותו לגודל מדריגת קדושתו. וע\"ד שדרשו ז\"ל עה\"פ ותחי רוח יעקב אביהם, פרש\"י ז\"ל (והוא במד\"ר) ששרתה עליו שכינה שפירשה ממנו, ומהאי טעמא לא יכלו אחיו לענות אותו כי נבהלו מפניו. שנצטערו והתחרטו שהם גרמו סילוק השראת שכינתו יתברך מעליו בסיבת צערו, כי אין השכינה שוחה אלא מתוך שמחה כאמז\"ל, ויוסף הבין המענה מתוך העדר תשובתם, ע\"כ אמר מהרו ועלו אל אבי וגו', וזה יגרום שתחזור אליו השראת השכינה.",
            "english_translation": "Here's the English translation, preserving the Hasidic concepts and terminology:\n\nThrough this we can understand regarding our matter that initially, Yosef made himself a stranger to them and appeared to them as an Egyptian man. Therefore, when he asked them \"Is your elderly father well, is he still alive?\", they responded simply \"he is still alive.\" Their intention in answering was based on their understanding of his question regarding physical life, as common people and materialistic beings would understand it.\n\nHowever, now that he revealed himself to them and said \"I am Yosef, is my father still alive?\", they understood that his question wasn't about physical life, but rather about the level of the Shechinah's (Divine Presence's) dwelling with him, which was his true life-force due to his great level of holiness. This is similar to what our Sages interpreted on the verse \"and the spirit of their father Yaakov was revived,\" which Rashi explains (from the Midrash Rabbah) that the Shechinah, which had departed from him, returned to rest upon him.\n\nFor this reason, his brothers could not answer him because they were dismayed before him. They were distressed and regretful that they had caused the removal of the Divine Presence from him through causing him anguish, for the Shechinah only dwells in joy, as our Sages taught. Yosef understood their response through their lack of answer, therefore he said \"Hurry and go up to my father,\" etc., and this would cause the return of the Divine Presence to him.",
            "average_score": 8.0,
            "reference": "Divrey Yoel, Parshas Vayigash, Torah #10, Passage #5"
        },
        {
            "section": "Torah",
            "topic": "Vayigash",
            "torah_number": "7",
            "passage_number": "2",
            "passage": "והנה יעקב אבינו ע\"ה שלח את יהודה לפניו להורות לפניו גושנה, ולהכין לו בית תלמוד כאמרם ז\"ל, ולכאורה היה יכול יוסף בעצמו להכין את זאת, גם היה אפשר לעשות שליחות זו ע\"י אחד מהשבטים ומדוע שלח את יהודה שהיה מלך, אך נראה עפומ\"ד במדרש וירא את העגלות אשר שלח יוסף ואותן העגלות ששלח פרעה היכן היו, א\"ל אותן עגלות ששלח פרעה לשאת אותו היתה ע\"ז חקוקה עליהם עמד יהודה ושרפן, למוד הוא השבט הזה להיות שורף ע\"ז, ודייקו ביפ\"ת ובנזה\"ק מדוע לא שרפם יוסף בעצמו, ותירצו דמפני שיהודה מסוגל לזה ע\"כ הניחו אליו, ובנזה\"ק האריך לבאר עפי\"ד המדרש אין אנו בקיאים בדקדוקי ע\"ז כיעקב אבינו, וכמו כן יהודה היה בקו בדקדוקי ע\"ז עכ\"ד, וע\"כ שלח יעקב אבינו את יהודה שהוא יכיר ויבחין גם בחי' ע\"ז הטמון בסתר, גם מחשבת ע\"ז, דהרי למוד אותו שבט להיות שורף ע\"ז, ולפי שרצה יע\"א להכין לו בית שמשם תצא הוראה, ע\"כ היה צורך לזה הבחנה והבדלה שלא יהיה מעורב בו אף שמץ ע\"ז ולזה מסוגל רק יהודה כנ\"ל, וע\"כ שלח את יהודה דייקא שהוא יכין לו בית תלמוד, שלא יהיה בה שום שמץ ע\"ז ומשם תצא הוראה, ומזה אפשר לראות עד היכן צריכין להיות נשמר מדרך ע\"ז שלזה צריך חכמה יתירה להבין ולהבדיל ולהפריש מהם, ולזה הסמיכו לכאן ההלכה ילמדנו רבינו אימתי מברכין על הנר במוצ\"ש כך שנו רבותינו אין מברכין על הנר עד שיאותו לאורו, והיינו מטעמא שצריך הכרה יתירה להבדיל ומנין למדו מן הקב\"ה שנאמר וירא אלקים את האור כי טוב ואח\"כ ויבדל אלקים בין האור ובין החושך ומה\"ט את יהודה שלח לפניו מפני שהוצרך להכרה יתירה להכין ביהמ\"ד שיהיה מסוגל וראוי לכך שמשם תצא הוראה.",
            "english_translation": "Here's the English translation, preserving the Hasidic concepts and terminology:\n\nOur father Yaakov, peace be upon him, sent Yehudah ahead of him to prepare the way to Goshen, and to establish a Beis Medrash (house of study) as our Sages said. Seemingly, Yosef himself could have prepared this, or it could have been done through any of the other tribes, so why did he send Yehudah who was king?\n\nIt appears to be explained based on the Midrash regarding \"and he saw the wagons that Yosef sent\" - where were the wagons that Pharaoh sent? It teaches that those wagons that Pharaoh sent to carry him had idolatrous images engraved on them, so Yehudah stood up and burned them. This tribe was accustomed to burning avodah zarah (idolatry). The Yefeh Toar and Nitzotzei Kedushah questioned why Yosef didn't burn them himself, and they answered that since Yehudah was especially suited for this task, it was left to him. The Nitzotzei Kedushah elaborates based on the Midrash that \"we are not as expert in the details of avodah zarah as our father Yaakov,\" and similarly, Yehudah was expert in the details of avodah zarah.\n\nTherefore, Yaakov sent Yehudah because he could recognize and discern even hidden aspects of avodah zarah, including thoughts of idolatry, as that tribe was accustomed to burning avodah zarah. Since Yaakov wanted to establish a house from which Torah instruction would emanate, it required careful discrimination to ensure there would be no trace of avodah zarah, and only Yehudah was suited for this as mentioned above. Therefore, he specifically sent Yehudah to prepare the Beis Medrash, ensuring it would be completely free of any trace of avodah zarah, and from there Torah instruction would emerge.\n\nFrom this, we can see how carefully one must guard against the ways of avodah zarah, requiring extra wisdom to understand, distinguish, and separate from them. This connects to the halachah they taught: \"When do we make the blessing over fire at the conclusion of Shabbos? Our rabbis taught that we don't make the blessing until we can benefit from its light.\" This is because extra recognition is needed to make distinctions, and where did they learn this from? From the Holy One, Blessed be He, as it says, \"And God saw the light that it was good\" and afterward \"God separated between the light and the darkness.\" For this reason, he sent Yehudah ahead, because extra discernment was needed to prepare a Beis Medrash that would be suitable and worthy for Torah instruction to emanate from it.",
            "average_score": 8.0,
            "reference": "Divrey Yoel, Parshas Vayigash, Torah #7, Passage #2"
        },
        {
            "section": "Torah",
            "topic": "Vayigash",
            "torah_number": "6",
            "passage_number": "12",
            "passage": "והנה בענין קץ הגאולה אמרו רז\"ל בזוה\"ק שאמר הקב\"ה ללבי גליתי לאברי לא גליתי, ופירשו המפרשים דהצדיקים שהם בבחי' ליבא להם נתגלה קץ הגאולה ולא לזולתם, ולא נתגלה ענין זה אף להמלאכים ומפני זה כששמעו מלאכי השרת, שיהודה ויוסף מתווכחין בענין הגאולה אם יקדים משית בן יוסף כנ\"ל, ע\"כ אמרו כאן זל\"ז בואו נרד למטה נראה שור וארי מתנגחין זה עם זה, שהיו משתוקקים לשמוע דברי התווכחותם אולי אליהם דבר יגונב מענין הגאולה. ולדרכנו יתבאר דברי המדרש תנחומא ואת יהודה שלח לפניו ובציון הנני שולח מלאכי ופנה דרך לפני וגו', דשורש פלוגתתם של יוסף עם יהודה היה אם יקדים משיח בן יוסף או לא. והוא מבואר ג\"כ בכוונת הכתוב הנני שולח מלאכי וגו', כנ\"ל בפי' האבן עזרא, וע\"כ את יהודה שלח לפניו לתווך שלום ביניהם. כמ\"ש במדרש תנחומא ואת יהודה שלח וגו' זש\"ה וסרה קנאת אפרים וכו', ולזה הסמיכו במדרש להכא מאמר הכתוב הנני שולח מלאכי שהוא מענינו והבן. ס",
            "english_translation": "Here's the English translation, preserving the Hasidic terminology:\n\nRegarding the time of redemption (Keitz HaGeulah), our Sages taught in the holy Zohar that the Holy One, Blessed be He, said \"To My heart I revealed it, to My limbs I did not reveal it.\" The commentators explained that the tzaddikim, who are on the level of \"heart,\" to them the time of redemption was revealed, but not to others. This matter was not even revealed to the angels. Because of this, when the ministering angels heard that Yehudah and Yosef were debating about the redemption - whether Mashiach ben Yosef would come first, as mentioned above - they said to each other, \"Come, let us descend below and see the ox and lion fighting with each other,\" as they were yearning to hear their debate, hoping perhaps they might catch some hint about the redemption.\n\nFollowing our approach, we can explain the words of the Midrash Tanchuma: \"And he sent Yehudah before him\" and \"Behold, I send My messenger, and he shall clear the way before Me.\" The root of the dispute between Yosef and Yehudah was whether Mashiach ben Yosef would come first or not. This is also explained in the meaning of the verse \"Behold, I send My messenger,\" as explained above in Ibn Ezra's commentary. Therefore, \"he sent Yehudah before him\" to make peace between them, as it is written in Midrash Tanchuma: \"And he sent Yehudah...\" This is what is meant by \"The envy of Ephraim shall depart.\" This is why they connected in the Midrash the verse \"Behold, I send My messenger,\" as it relates to this matter - understand this.",
            "average_score": 8.0,
            "reference": "Divrey Yoel, Parshas Vayigash, Torah #6, Passage #12"
        },
        {
            "section": "Torah",
            "topic": "Vayigash",
            "torah_number": "1",
            "passage_number": "44",
            "passage": "וכמו\"כ יעקב אבינו שליוה את יוסף להמשיך לו שמירת הדרך, הרי הי' בכחו להמשיך לו שמירה ע\"י עבודתו וכח קדושתו גם מביתו, וע\"כ אמר לו יוסף חזור בך. א\"ל יעקב בני גדולה מצות לויה שנרמז בפרשת עגלה ערופה שנאמר ידינו לא שפכה את הדם הזה וגו' ודרשו חז\"ל שלא פטרנוהו בלא לוי', מבואר מפרשת עגלה ערופה דלהמשיך שמירת הדרך, צריך להיות דוקא על ידי עבודת המצו' השייכה בדרך דהיינו מצות לויה, ואפשר דע\"כ רמז לו יוסף על עגלה ערופה ועל מצו' לוי' בשליחות העגלות, דע\"י ירידתו למצרים בעגלות, והתיקונים הגדולים שעשה יעקב אבינו בדרך למצרים, היו פועל דמיוני וכח הממשיך שמירה לישראל בכל מסעיהם בדרך גלותם, והמשיך יעקב אבינו הכח הזה ע\"י נסיעתו בכח התיקונים ועבודת המצות שסיגל בדרך הליכתו, ובחי' זו נרמז בפ' עגלה ערופה במצות לויה, נמצא דענין עגלות צב ועגלת יוסף ועגלה ערופה ענינם אחד ובחינתם שוה, והיו כולם פועל דמיוני אל העתיד.",
            "english_translation": "Here's the English translation, preserving the Hasidic concepts and terminology:\n\nSimilarly, our father Yaakov, who accompanied Yosef to extend protection for his journey - he actually had the power to extend protection through his divine service and the power of his holiness even from his home. Therefore, Yosef said to him, \"Return home.\" Yaakov replied, \"My son, the mitzvah of accompaniment (levayah) is great, as alluded to in the passage of the eglah arufah (broken-necked heifer), where it states 'our hands did not spill this blood,' etc. Our Sages interpreted this to mean 'we did not send him away without accompaniment.'\"\n\nIt is explained from the passage of eglah arufah that to extend protection for a journey, it must specifically be through the divine service of the mitzvah related to traveling, namely the mitzvah of accompaniment (levayah). Perhaps this is why Yosef alluded to the eglah arufah and the mitzvah of accompaniment through sending the wagons. Through his descent to Egypt in wagons, and the great tikkunim (spiritual rectifications) that our father Yaakov performed on the way to Egypt, they created a metaphysical effect and power that extends protection to Israel throughout all their journeys in exile.\n\nOur father Yaakov extended this power through his journey by means of the tikkunim and divine service of mitzvot that he accumulated along his way. This aspect is alluded to in the passage of eglah arufah through the mitzvah of accompaniment. Thus, we find that the matters of the covered wagons, Yosef's wagon, and the eglah arufah are all one concept and of the same spiritual aspect, and they all served as a metaphysical operation for the future.",
            "average_score": 8.0,
            "reference": "Divrey Yoel, Parshas Vayigash, Torah #1, Passage #44"
        },
        {
            "section": "Torah",
            "topic": "Vayigash",
            "torah_number": "2",
            "passage_number": "6",
            "passage": "ומעתה בהתודע אל אחיו ואמר להם אני יוסף העוד אבי חי וגו'. הנה היה מקום לאחיו שיתמהו עליו ויפקפקו בהאמנת דבריו, דאלו הי' האמת כדבריו איך יתכן שסבל כ\"כ שנים צער אביו ולא הודיעו, אחרי שהיה סיפק בידו להודיעו שהיה מלך ומושל ומי יאמר לו מה תעשה, גם איך לא הרגיש באהבת האחו' עד הנה וציער אותם בכל מיני עלילות של חינם, ע\"כ הצטדק עצמו לפניהם וא\"ל עיניכם הרואות כי פי המדבר אליכם, וכבחי' שכתב המאור ושמש ז\"ל, שאתם רואים שאיני מדבר אלא דיבורים שנשלחו לי מן השמים. ולא אני המדבר אלא פי מדבר ברצון הבוי\"ת ע\"י ששכינה מדברת מגרוני, ומעתה אל תתמהו על כ\"ז, כי היה רצון הבוי\"ת וסיבה מן השמים, והושמו בפי ברוה\"ק כל אלה הדיבורים, ומה שלא היה רצון הבוי\"ת לא דברתי. וע\"כ לא הודעתי לאבי, וקבלו השבטים דבריו שראו אמיתתם כי בהתודע אל אחיו נתגלה להם פנימיותו ומדריגתו מה שהיה נסתר ומכוסה מהם במשך כל הזמן עד עכשיו.",
            "english_translation": "Here's the English translation, preserving the Hasidic terminology:\n\nNow when he made himself known to his brothers and said to them \"I am Yosef, is my father still alive, etc.\" His brothers could have been puzzled and doubted the truthfulness of his words, for if his words were true, how could he have endured his father's pain for so many years without informing him, especially since he had the ability to do so as he was king and ruler, and who could question his actions? Also, how did he not feel brotherly love until now and caused them distress with all kinds of baseless accusations?\n\nTherefore, he justified himself before them saying \"Your eyes see that it is my mouth speaking to you,\" as explained by the Maor VaShemesh, that \"you see that I speak only words that were sent to me from Heaven. It is not I who speaks, but rather my mouth speaks with the will of the Blessed Creator (Borei Yisbarach) through the Shechinah (Divine Presence) speaking from my throat. Therefore, do not be puzzled by all this, as it was the will of the Blessed Creator and a cause from Heaven, and all these words were placed in my mouth through Ruach HaKodesh (Divine Spirit), and what was not the will of the Blessed Creator, I did not speak. This is why I did not inform my father.\"\n\nThe tribes (brothers) accepted his words as they saw their truth, for when he revealed himself to his brothers, his inner essence and spiritual level were revealed to them, which had been hidden and concealed from them throughout all this time until now.",
            "average_score": 8.0,
            "reference": "Divrey Yoel, Parshas Vayigash, Torah #2, Passage #6"
        },
        {
            "section": "Torah",
            "topic": "Vayigash",
            "torah_number": "17",
            "passage_number": "9",
            "passage": "ובזה אפ\"ל דברי המדרש (הובא לעיל בדרוש הקודם) ואתם עלו לשלום אל אביכם, אמרין לי' השלו' דכולי' נשפה (פי' היפ\"ת ענין חשך כמו נשף שבמקרא כלומר זהו שלום של חשך ואפילה), ורוה\"ק צווחת שלום רב לאוהבי תורתך וצ\"ב ויתבאר לדרכינו דהנה יהודה ויוסף היו מדיינים זע\"ז, והיתה ההתנגדות שביניהם גדולה מאוד עד שרצה יהודה להחריב את כל מצרים כמבואר בדרז\"ל, ולכן אמרין לי' השלום דכולי' נשפה, איך יקרא לזה שלום והוא שלום של חשך ואפילה, אמנם כל התווכחותם הי' ע\"ד האמת ואלו ואלו דברי אלקים חיים, ומחלקותם הי' בדבר הלכה ועפ\"י דיני התורה כמ\"ש הפר\"ד והמפרשים ז\"ל, ומחלוקה כזו סופה לבוא לידי שלום וכמו שאירע להם באמת, וז\"ש רוה\"ק שלום רב לאוהבי תורתיך וגו', כי זהו השלום האמיתי אם כל א' מהחולקים רצונו ומבוקשו רק להשיג דעת התוה\"ק ע\"ד האמת, וז\"ש במדרש תנחומא הנ\"ל ואת יהודה שלח לפניו וכו' אתמול מתנגחין זה עם זה ועכשיו הוא משלחו אצלו הוי עושה שלום במרומיו, שהיתה בחי' השלום הזה השפעה מן השמים וע\"ד האמת, כבחי' השלום של מעלה והבן. דה",
            "english_translation": "Here's the English translation, preserving the Hasidic terminology:\n\nWe can explain the words of the Midrash (mentioned earlier in the previous discourse) on \"And you shall go up in peace to your father.\" They said to him that this peace is entirely \"nishpah\" (the Yefat To'ar explains this as darkness, like \"neshef\" in Scripture, meaning this is a peace of darkness and gloom). Yet the Ruach HaKodesh [Divine Spirit] calls out \"Great peace have they who love Your Torah.\"\n\nThis can be explained according to our approach: Yehudah and Yosef were arguing with each other, and the opposition between them was so great that Yehudah wanted to destroy all of Egypt, as explained by our Sages. Therefore, they said this peace is entirely \"nishpah\" - how can this be called peace when it is a peace of darkness and gloom?\n\nHowever, all their arguments were for the sake of truth, and \"both these and these are the words of the living God.\" Their disagreement was regarding halacha [Jewish law] and according to the laws of the Torah, as explained by the Pardes and other commentators. Such a disagreement will ultimately lead to peace, as indeed happened with them.\n\nThis is what the Ruach HaKodesh means by \"Great peace have they who love Your Torah\" - this is true peace when each of the disputants' desire and goal is only to understand the true meaning of the holy Torah. This is what the Midrash Tanchuma means when it says \"And he sent Yehudah before him... yesterday they were butting heads with each other, and now he sends him to him - this exemplifies 'He who makes peace in His heights.'\" This type of peace was a heavenly influence and based on truth, like the nature of peace in the upper realms. Understand this.",
            "average_score": 8.0,
            "reference": "Divrey Yoel, Parshas Vayigash, Torah #17, Passage #9"
        },
        {
            "section": "Torah",
            "topic": "Vayigash",
            "torah_number": "12",
            "passage_number": "3",
            "passage": "ומבואר בספה\"ק די\"ב שבטי י\"ה הם כנגד י\"ב צירופי הוי', וכל צירוף מורה על מדה ובחי' אחרת, נמצא לפי\"ז שעבדו השי\"ת כאו\"א במדה ובדרך אחרת, וז\"ש המדרש ארי ושור מתווכחין זה בזה, שאין מודתם ודרך עבודתם שוה אבל עושה שלום במרומיו שלענין כבוד שמים יש שלום ביניהם בלי שום פירוד כלל וכ\"א מייחד לבבו להקב\"ה. וידוע שיעקב אבינו ע\"ה הוה כלול מכל המידות כולן ובזה יבואר אמרם ז\"ל במדרש שאמחו בניו ליעקב כשם שאין בלבך אלא אחד כך אין בלבנו' אלא אחד, פי' אף שבפעולתינו בעבודת השי\"ת יש השתנות בא' מחבירו אבל בתוכיות ופנימיות הלב אין לנו אלא לב אחד, ובחי' זו נרמז בדברי המדרש כאן שיהודה לא זז משם עד שעמד על לבו, פי' שהבין פנימיות לבו של יוסף והבחין שיש שלום ביניהם וכולם לכוונה א' עובדים לייחד לבבם להקב\"ה, וההשתנות שביניהם הוא חק בפעולת המעשה, וע\"כ ואחר שעמד על לבו השיג שאין פירוד ביניהם כלל, השי\"ת יעזור לייחד לבבנו לשמו יתברך באמת. זא",
            "english_translation": "Here's the English translation, preserving the Hasidic terminology:\n\nIt is explained in the holy sefarim that the 12 tribes of G-d correspond to the 12 permutations of the Divine Name (Havaya), and each permutation indicates a different middah (attribute) and aspect. According to this, each one served Hashem in a different way and approach. This is what the Midrash means when it says that the lion and ox argue with each other - their middot and ways of service are not the same, but \"He makes peace in His heights\" means that regarding kavod shamayim (Heaven's honor), there is peace between them without any separation at all, and each one unifies their heart to the Holy One, Blessed be He.\n\nIt is known that our father Yaakov, peace be upon him, encompassed all the middot together. This explains what our Sages said in the Midrash that his sons said to Yaakov, \"Just as in your heart there is only One, so too in our hearts there is only One.\" This means that although in our actions in serving Hashem there are differences between one and another, in the inner depths of our hearts we have only one heart.\n\nThis aspect is alluded to in the words of the Midrash here that \"Yehudah did not move from there until he understood his heart,\" meaning he understood the inner heart of Yosef and recognized that there was peace between them, and they all served with one intention to unify their hearts to the Holy One, Blessed be He. The differences between them were only in the outer actions. Therefore, after he understood his heart, he realized there was no separation between them at all. May Hashem help us to unify our hearts to His blessed Name in truth.",
            "average_score": 8.0,
            "reference": "Divrey Yoel, Parshas Vayigash, Torah #12, Passage #3"
        },
        {
            "section": "Torah",
            "topic": "Vayigash",
            "torah_number": "17",
            "passage_number": "5",
            "passage": "והנה יהודה כשבא למצרים ראה גודל טומאתם של מצרים עד שמצד רשעתם היו ראויים לכלי', ואלא שלא היה רצון העליון מסכים לזה, שהיה הכרח שישראל ישתעבדו שם ויתבררו ויתלבנו בכור הברזל עד שיהיו ראויים לקבלת התורה הק', גם לצד בירור הניצוצות הקדושות הנמצאים שם בשבי', ולולי זה היה יהודה מחריב אותה ונחשב לו לקרבן הריגת רשעים ואין זה שפיכת דמים, וז\"פ המדרש אין ויגש אלא קרבן. שבזה מפרש מאמרו הקודם אין הגשה אלא מלחמה, שניגש יהודה ללחום ולהרוג כל מצרים כאמרם ז\"ל, ולכאורה איך רצה יהודה לשפוך דמים, ע\"ז מפרש אין ויגש אלא קרבן, שבמלחמה זה רצה להקריב קרבן, שהריגת רשעים נחשב להקרבת קרבנות, אלא שלא היה רצון העליון בכך ומן השמים מנעו אותו שלא יחריב את מצרים.",
            "english_translation": "Here's the English translation, preserving the Hasidic concepts and terminology:\n\nWhen Yehudah came to Egypt, he saw the great tumah (spiritual impurity) of Egypt, to the extent that due to their wickedness they deserved destruction. However, it was not the Will of the Most High to allow this, as it was necessary for Israel to be enslaved there and to be refined and purified in the \"iron furnace\" until they would be worthy of receiving the Holy Torah. Also, [they needed to be there] for the purpose of elevating the holy sparks (nitzotzot hakdoshot) that were there in captivity.\n\nWere it not for this, Yehudah would have destroyed Egypt, and it would have been considered for him as a korban (sacrifice) - the killing of the wicked, which is not considered bloodshed. This is the explanation of the Midrash that states \"Vayigash means nothing other than korban (sacrifice).\" This explains the previous statement that \"there is no 'approaching' (hagasha) except for war\" - that Yehudah approached to wage war and kill all Egyptians, as our Sages said.\n\nAt first glance, one might ask how Yehudah could have wanted to shed blood. To this, it explains \"Vayigash means nothing other than korban\" - that in this war, he wanted to offer a sacrifice, as killing the wicked is considered like offering sacrifices. However, this was not the Will of the Most High, and from Heaven they prevented him from destroying Egypt.",
            "average_score": 8.0,
            "reference": "Divrey Yoel, Parshas Vayigash, Torah #17, Passage #5"
        },
        {
            "section": "Torah",
            "topic": "Vayigash",
            "torah_number": "4",
            "passage_number": "10",
            "passage": "עוד אפ\"ל במאמר הכתוב כי כמוך כפרעה, דהנה השבטים הק' הכינו תפלה ופועל דמיוני בדבריהם הקדושים בשביל דורות הגלות, ובכל דור ודור עומדים עלינו לכלותינו והקב\"ה מצילנו מידם, וברוב רחמיו וחסדיו ית\"ש מפיר עצת אויבינו ומבטל כל גזירות קשות שגוזרים על ישראל, וכמו שביטל גזירת פרעה, כדאיתא בגמרא (סוטה י\"ב ע\"ב) שמשה רבינו היה הראשון שנשלך ליאור. ומיד בטלה הגזירה שאמרו אצטגנינו פרעה כבר נלקה מושיען של ישראל ואח\"כ ניצול גם משה, נמצא שבטלה גזירתו לגמרי, וכמו כן הקב\"ה מבטל גזירות כל הקמים עלינו בכל דור ודור. וזה שאמר יהודה ליוסף. אתה רוצה לגזור עלינו גזירה קשה מרוע בחירתך. דע לך שהקב\"ה יבטל גזירתך, כמו שהוא עתיד לבטל גזירותיו של פרעה, כי האבות והשבטים הק' ראו ברוח קדשם כל מה שעתיד להיות עד סוף כל הדורות, זולת מה שהעלימו מן השמים מהם בכוונה לתכלית הענין, כגון זאת שלא הכירו את יוסף. וכמו שהעלימו מאברהם אבינו ע\"ה בשעת העתידה שאין רצון השי\"ת לשחוט את יצחק. אבל חוץ מאלו השיגו וראו כל העתידות, ולכך אמר יהודה ליוסף כי כמוך כפרעה. פרעה גוזר ואינו מקיים, כו השי\"ת יפר עצתו וגזירתו, כך אתה גוזר ואינו מקיים, ולא יתקיים גזירתך כי הקב\"ה יבטל אותה. ורמז לו עוד שיעמדו על ישראל בכל דור ודור גוזרי גזירות על ישראל, והשי\"ת יפח עצת אויבינו וכולם יתבטלו. וזה שאמר כי כמוך כפרעה, פי' יעמדו על ישראל עוד אנשים כמוך וכפרעה, שיגזרו גזירות רעות עלינו, והקב\"ה יצילנו מידם ויתבטל גזירתם.",
            "english_translation": "Here's the English translation, preserving Hasidic terminology:\n\nOne can further explain the verse \"for you are like Pharaoh\" as follows: The holy tribes (Shevatim) prepared through their holy words a prayer and symbolic action for future generations in exile. In every generation, enemies rise up to destroy us, but the Holy One, Blessed be He, saves us from their hands. Through His abundant mercy and kindness, may His name be blessed, He nullifies our enemies' counsel and cancels all harsh decrees against Israel, just as He nullified Pharaoh's decree.\n\nAs mentioned in the Gemara (Sotah 12b), Moses was the first to be cast into the Nile. Immediately, the decree was nullified when Pharaoh's astrologers said, \"Israel's savior has already been struck,\" and afterward Moses was saved. Thus, his decree was completely nullified. Similarly, the Holy One, Blessed be He, nullifies the decrees of all who rise against us in every generation.\n\nThis is what Yehudah said to Yosef: \"You wish to impose a harsh decree upon us from your evil free will. Know that the Holy One, Blessed be He, will nullify your decree, just as He will nullify Pharaoh's decrees in the future.\" For the holy Patriarchs and tribes saw through their divine inspiration (ruach hakodesh) everything that would happen until the end of generations, except for what was deliberately concealed from Heaven for a specific purpose, such as their inability to recognize Yosef. Similarly, it was concealed from our father Abraham, peace be upon him, during the Akeidah that it wasn't Hashem's will to actually slaughter Yitzchak.\n\nBut besides these exceptions, they perceived and saw all future events. Therefore, Yehudah said to Yosef, \"for you are like Pharaoh.\" Just as Pharaoh decrees but doesn't fulfill, as Hashem will nullify his counsel and decree, so too you decree but won't fulfill, and your decree won't stand because the Holy One, Blessed be He, will nullify it.\n\nHe further alluded that in every generation, decree-makers would rise against Israel, but Hashem would thwart our enemies' counsel and all would be nullified. This is the meaning of \"for you are like Pharaoh\" - that people like you and Pharaoh will continue to rise against Israel and issue evil decrees against us, but the Holy One, Blessed be He, will save us from their hands and their decrees will be nullified.",
            "average_score": 8.0,
            "reference": "Divrey Yoel, Parshas Vayigash, Torah #4, Passage #10"
        },
        {
            "section": "Torah",
            "topic": "Vayigash",
            "torah_number": "20",
            "passage_number": "22",
            "passage": "ופירשתי עפי\"ד הגמרא ברכות (דף י\"ח) דפליגי שם אם המתים ידעו בצערא דחיי או לא, ומסקנת דברי הגמרא דלא ידעי רק אם מודיעים להם, עיין בדברי המהרש\"א שם (ד\"ה ואי ס\"ד דלא ידעי), אמנם ביעקב אבינו ע\"ה דרשו רז\"ל מקיש הוא לזרעו מה זרעו בחיים אף הוא בחיים, ואמרו רז\"ל יעקב אבינו לא מת, וע\"כ מרגיש הוא בצרת בניו יותר מכל האבות, וכתב האלשיך הק' בפרשת ויחי כי מצינו בכ\"מ אשר יזכור הכתוב שם המיתה ליעקב בשם ישראל יכנהו, כמ\"ש ויאמר ישראל אל יוסף הנה אנכי מת וגו', ויקרבו ימי ישראל למות ועוד כהנה, אך ביעקב לא נאמר רק גויעה וכו', ואומרה כי הנה הגדר הגדול אשר ניתוסף על נפשו רוחו ונשמתו כשנקרא ישראל הוא אשר נסתלק ממנו בעצם וכו', וע\"כ כל המקום אשר יזכיר מיתה בשם ישראל יכנה, אך בבחינת יעקב הוא הגדר אשר היה בו מתחילה לא נסתלק רק גוע כמי שנתעלף, שעדיין כל כוחות נפשו ורוחו ונשמתו דבקים בו בעצם עיי\"ש, וק\"ז הישמח משה זלל\"ה כתב בתפלה למשה (קכ\"ד) כו שם יעקב חומז על בחי' הגלות, כי היו\"ד אות משמו יתברך, עקב הוא לשון שפלות רומז על הגלות שעמו אנכי בצרה ומה\"ט לא נעקר שם יעקב עיי\"ש, כללו של דבר יעקב אבינו ע\"ה סובל אתנו בצער הגלות, והגלות היותר גדולה הוא שפלות התורה בעוה\"ר, וע\"כ כשמחזיקין להקים עולה של תורה ולתמוך במוסדות התורה ותשב\"ר הרי עושין בזה טובה ליעקב אבינו ישראל סבא, כו הוא סובל ומרגיש בצער הגלות ושפלות התורה, ע\"כ טובה זו מגעת אליו וזכותו יגן עלינו ועכ\"י.",
            "english_translation": "Here's the translation, preserving the Hasidic terminology:\n\nI explained based on the Gemara in Berachos (18) where there is a dispute whether the deceased know of the pain of the living or not. The Gemara's conclusion is that they don't know unless they are informed. See the Maharsha's words there (beginning with \"And if you think they don't know\").\n\nHowever, regarding Yaakov Avinu a\"h, Chazal taught that he is compared to his descendants - just as his descendants are alive, so too is he alive. Chazal said \"Yaakov Avinu did not die,\" and therefore he feels the pain of his children more than all the other Avos.\n\nThe holy Alshich writes in Parshas Vayechi that whenever Scripture mentions death regarding Yaakov, it uses the name \"Yisrael,\" as it says \"And Yisrael said to Yosef, behold I am dying,\" and \"The days of Yisrael drew near to death,\" and other similar instances. However, with [the name] Yaakov, it only mentions \"expiration\" (geviah). He explains that the great additional level that was added to his nefesh, ruach, and neshamah when he was called Yisrael is what departed from him... Therefore, whenever death is mentioned, the name Yisrael is used. But regarding the aspect of Yaakov, which was his original level, he didn't depart but rather \"expired\" like someone who fainted, as all the powers of his nefesh, ruach, and neshamah remained essentially connected to him.\n\nThe Yismach Moshe z\"l wrote in Tefillah L'Moshe (124) that the name Yaakov hints to the aspect of galus (exile), as the Yud is from Hashem's name, and \"ekev\" (heel) is an expression of lowliness, hinting to the exile where \"I am with him in distress.\" For this reason, the name Yaakov was not uprooted.\n\nThe main point is that Yaakov Avinu a\"h suffers with us in the pain of exile, and the greatest exile is the lowliness of Torah in our many sins. Therefore, when we support and establish Torah institutions and support children's Torah education, we are doing a kindness for Yaakov Avinu/Yisrael Saba, for he suffers and feels the pain of exile and the lowliness of Torah. Thus, this kindness reaches him, and his merit should protect us and all of Israel.",
            "average_score": 8.0,
            "reference": "Divrey Yoel, Parshas Vayigash, Torah #20, Passage #22"
        },
        {
            "section": "Torah",
            "topic": "Vayigash",
            "torah_number": "3",
            "passage_number": "11",
            "passage": "והנה דבריהם הקדושים נשארו נצחיות לדורי דורות, שכבשו דרך ופתחו מעיין ישועה לבניהם אחריהם, וכמ\"ש ק\"ז הייטב לב זלל\"ה (בפרשת תולדות) על מה דאיתא בזוה\"ק: כ' שנין אשתהי יצחק עם אתתי' ולא אולידת עד דצלי צלותיה, בגין דקוב\"ה אתרעי בצלותהון דצדיקייא, מ\"ט בגין דיתרבי ויתוסף רבות קודשא לכל מאן דאיצטרך בצלותהון דצדיקייא עכ\"ד הזוה\"ק. וכתב ק\"ז זלל\"ה למה זה דומה לצינור שנסתם ואם יבוא אחד ויפתחנו וינקנו שוב הוא פתוח לכל, וכמו\"כ ע\"י תפלתן של צדיקים נפתחו צנורות הישועה והחסדים וכל מי שצריך למימי הישועה ישאב בששון מאותו הצינור וכענין דכתיב ושאבתם וגו' ממעיני הישועה, וביארו המפרשים כי ישועת צדיקים הוא כמו מעיין הנובע ישועה לכל מיד ולדורות, ולכן הקב\"ה מתאווה לתפלתן שע\"י תפלתן יפתח הצינור והמעיין לכל מי שצריך לאותו דבר ע\"כ בייטב לב. ויובן בזה דברי המדרש מים עמוקים עצה בלב איש וגו' משל לבאר עמוקה מלאה צונן והיו מימי' צוננין ויפין, ולא היתה ברי' יכולה לשתות הימנה, בא אחד וקשר חבל בחבל וכו' ודלה הימנה ושתה התחילו הכל דולין הימנה ושותין, כך לא זז יהודה משיב ליוסף וכו', דהנה השבטים הק' לא היו צריכים לפעולות אלו בשביל עצמם. כי היה בכח קדושתם לפעול ישועה לעצמם בלאו הכי, אבל עשו כל זה שיהיה מעיין ישועה נמשך לדורות, ויש מקום בדבריהם הקדושים לדורות, כל דור לפי המצב ולפי המאורעות ולכך היו דבריהם מראין פנים לכל צד, שיהיה נמשך לדורות מעיין הנובע ישועה לכל מי שצריך, וכך היה יהודה משיב ליוסף דבר על דבר עד שעמד על לבו והכל דולין ושותין מהם לדורי דורות.",
            "english_translation": "Here's the English translation, preserving the Hasidic terminology:\n\nIndeed, their holy words remain eternal for all generations, as they paved the way and opened a wellspring of salvation for their children after them. As the holy Yitav Lev wrote (in Parshat Toldot) regarding what is found in the holy Zohar: \"Isaac waited twenty years with his wife who did not bear children until he prayed his prayer, because the Holy One, blessed be He, desires the prayers of tzaddikim (righteous ones). Why? Because through the prayers of tzaddikim, holy abundance increases and is added for all who need it.\"\n\nThe holy Yitav Lev wrote that this is comparable to a blocked pipe - if someone comes and opens it and cleans it out, it then remains open for all. Similarly, through the prayers of tzaddikim, the channels of salvation and kindness are opened, and whoever needs the waters of salvation can draw joyfully from that pipe, as it is written, \"And you shall draw water with joy from the wellsprings of salvation.\" The commentators explained that the salvation of tzaddikim is like a flowing spring bringing salvation immediately and for generations, and therefore the Holy One, blessed be He, desires their prayers, for through their prayers the pipe and spring are opened for all who need that thing.\n\nThis explains the words of the Midrash: \"Deep waters are counsel in the heart of man...\" - A parable of a deep well full of cold water, and its waters were cold and good, but no creature could drink from it. Someone came and tied rope to rope, etc., and drew from it and drank. Then everyone began drawing and drinking from it. Similarly, Judah did not cease responding to Joseph, etc.\n\nThe holy tribes did not need these actions for themselves, as they had the power of their holiness to bring about salvation for themselves regardless. But they did all this so that there would be a wellspring of salvation flowing for generations, and there is relevance in their holy words for all generations, each generation according to its situation and circumstances. Therefore their words showed different aspects, so that the flowing spring of salvation would continue for generations for whoever needs it. Thus Judah kept responding to Joseph point by point until he understood his heart, and all draw and drink from them for all generations.",
            "average_score": 8.0,
            "reference": "Divrey Yoel, Parshas Vayigash, Torah #3, Passage #11"
        },
        {
            "section": "Torah",
            "topic": "Vayigash",
            "torah_number": "20",
            "passage_number": "6",
            "passage": "ונא\"פ במאה\"כ לשום לכם שארית בארץ וגו' ע\"ד דאמרינן בגמרא לענין רבית (ב\"מ ע\"ה ע\"ב) אלו עוברין בל\"ת המלוה והלוה והערב והעדים, אמר אביי מלוה עובר בכולן וכו' ערב והעדים אין עוברין אלא משום לא תשימון עליו נשך, עכ\"ד הגמרא. ובגמרא (שם ס\"ב ע\"א) בשלמא כולהו עביד מעשה, אלא עדים מאו עביד, אלא לאו דשומא מילתא היא, הרי דאף שהערב והעדים לא עשו מעשה בגוף הענין אבל לפי שעל ידם נשלם והובא לידי גמר מחייבי בלאו דלא תשימון ושורש הפעולה נכלל במלת שימה, ועד\"ז יתבאר לענינינו דיוסף הצדיק הקדים לבא מצרימה, כדי להכין מקום לבני ישראל שיוכלו להתקיים בקדושתן בגלות מצרים שהוא ערות הארץ ומזוהם ביותר, ובכח קדושתו והנסיונות שעמד בהם והתגבר עליהם, וע\"י שנעשה מושל על שר של מצרים החליש כח הטומאה והקליפות בשורשן, ועי\"ז זכו ישחאל להיות נשמרים מעריות במצרים ובנ\"י עאלו ובנ\"י נפקו, ולא הי' בהם א' שנולד בפסול כאמרז\"ל, אמנם נוסף לזה הכין יוסף הצדיק כח הצלה לדורות העתידים עד גלות האחרון, שיוכלו ישראל להתגבר ולעמוד בנסיונות הגלות ויתקיימו בקדושתן אף בשפלות הנוראה בעיקבתא דמשיחא, שגלות מצרים שורש כל הגלות. והאבות והשבטים הק' היו שורש נשמות ישראל של כל הדורות, וכל מה שיש בענף יש בשורש, ע\"כ הם במעשיהם הק' פתחו צינור והכינו כח לכל דורות ישראל, וז\"ש לשום לכם שארית באחק ולהחיות לכם לפליטה גדולה, שהכין יוסף הצדיק יסוד ושורש התגברות לכל דורות ישראל, והוא ניצוץ הק' אשר נסתר בבחינת הנפש של כל איש ישחאל ומורשה לנו מאבוה\"ק, ובהתחלתו הוא רק בבחינת שארית, ואח\"כ יתרחב גבול הקדושה להחיות לכם לפליטה גדולה.",
            "english_translation": "Here's the English translation, preserving the Hasidic terminology:\n\nWe can explain the verse \"to establish for you a remnant in the land, etc.\" based on what is said in the Gemara regarding ribis (interest) [Bava Metzia 75b]: Those who transgress the negative commandment are the lender, borrower, guarantor, and witnesses. Abaye said the lender transgresses all [prohibitions], etc., while the guarantor and witnesses only transgress \"you shall not place upon him interest.\"\n\nThe Gemara [62a] asks: While all others perform an action, what action do the witnesses perform? Rather, is it not that the very act of establishing [the loan] is significant? Thus, even though the guarantor and witnesses didn't perform an actual deed in the matter itself, because the transaction was completed through them, they are liable for the prohibition of \"you shall not place,\" with the root of the action being included in the word \"placing.\"\n\nSimilarly, in our matter, Yosef HaTzaddik preceded going to Egypt to prepare a place for Bnei Yisrael so they could maintain their kedushah (holiness) in Egyptian exile, which was the ervat ha'aretz (most defiled land) and extremely contaminated. Through the power of his kedushah and the trials he withstood and overcame, and by becoming ruler over the sar (angel) of Egypt, he weakened the power of tumah (impurity) and klipot (negative forces) at their root.\n\nThrough this, Israel merited to be protected from immorality in Egypt - \"Bnei Yisrael entered and Bnei Yisrael left\" - and not one of them was born from improper relations, as our Sages said. Moreover, Yosef HaTzaddik prepared a power of salvation for future generations until the final exile, so that Israel could overcome and withstand the trials of exile and maintain their kedushah even in the terrible lowliness of ikveta d'meshicha (the footsteps of Mashiach), as the Egyptian exile is the root of all exiles.\n\nThe holy Avot and Shevatim were the root of all Jewish souls throughout the generations, and whatever exists in the branch exists in the root. Therefore, through their holy actions, they opened a channel and prepared strength for all generations of Israel. This is the meaning of \"to establish for you a remnant in the land and to sustain you for a great deliverance\" - that Yosef HaTzaddik established a foundation and root of strength for all generations of Israel. This is the holy spark which is hidden within the nefesh (soul) of every Jew, inherited from our holy forefathers. At first, it is only at the level of a \"remnant,\" but afterward, the boundary of kedushah expands \"to sustain you for a great deliverance.\"",
            "average_score": 8.0,
            "reference": "Divrey Yoel, Parshas Vayigash, Torah #20, Passage #6"
        },
        {
            "section": "Torah",
            "topic": "Vayigash",
            "torah_number": "1",
            "passage_number": "49",
            "passage": "ועפי\"ז נבין דברי המדרש שבפתח דברנו ויגש אליו יהודה. מים עמוקים עצה בלב איש וגו' משל לבאר עמוקה וכו' כך לא זז יהודה וכו' עד שעמד על לבו, כוונת המשל שהמשיל דברי יוסף למים עמוקים, כי עניני הגאולה הרמוזים בדבוריו הוא עמוק מאד ואי אפשר לעמוד על סודם, וליבא לפומא לא גליא, ובא א' וקשר חבל בחבל נימא בנימא וכו' כך לא זז יהודה משיב דבר על דבר עד שעמד על לבו, שמתוך דבריו עמד על סוד הגאולה שנסתר בהם בבחינת מחשבה שבלב, וז\"ש עמד על לבו והבן. ויובן גם המשך המשל מ\"ש שבא אדם א' ודלה הימנה ושתה התחילו הכל דולין הימנה ושותין, הרמז על השבטים שגם הם הבינו רמז המחשבה וסוד הגאולה, שכיון שירדה ההשגה מעולם המחשבה ע\"י יהודה, מעתה השיגו גם הם, וז\"ש התחילו הכל דולין הימנה.",
            "english_translation": "Here's the English translation, preserving the Hasidic concepts and terminology:\n\nBased on this, we can understand the words of the Midrash that we began with \"And Judah approached him.\" \"Deep waters are counsel in the heart of man, etc.\" - This is comparable to a deep well, etc. Thus Judah did not move, etc. until he understood his heart. The meaning of the mashal (parable) that compares Joseph's words to deep waters is because the matters of redemption (geulah) that were hinted at in his words were very deep and impossible to fully comprehend their secret (sod), and the heart does not reveal to the mouth. Then one came and tied rope to rope, thread to thread, etc. Similarly, Judah did not cease responding word for word until he understood his heart, meaning that through his words he understood the secret of redemption that was hidden within them at the level of thought in the heart. This is the meaning of \"understood his heart\" - contemplate this.\n\nThe continuation of the mashal can also be understood, which states that one person came and drew from it and drank, and then everyone began drawing from it and drinking. This alludes to the tribes, who also understood the hint of the thought and the secret of redemption. Once the understanding descended from the world of thought through Judah, they too were able to grasp it, and this is the meaning of \"everyone began drawing from it.\"",
            "average_score": 8.0,
            "reference": "Divrey Yoel, Parshas Vayigash, Torah #1, Passage #49"
        }
    ],
    "timestamp": "2024-12-31T20:34:55.665162",
    "metadata": {
        "total_passages_processed": 50,
        "selection_criteria": "Average score >= 7.0",
        "scoring_version": "3.0"
    }
}