{
    "question": "our existence on this world is in the merit of the prayers of our forefathers",
    "analyzed_passages": [
        {
            "source": "Divrey Yoel, Torah, Vayigash (Torah #3, Passage #11)",
            "relevant_sentences": "\"אין משפטים ישירים\"",
            "passage": "והנה דבריהם הקדושים נשארו נצחיות לדורי דורות, שכבשו דרך ופתחו מעיין ישועה לבניהם אחריהם, וכמ\"ש ק\"ז הייטב לב זלל\"ה (בפרשת תולדות) על מה דאיתא בזוה\"ק: כ' שנין אשתהי יצחק עם אתתי' ולא אולידת עד דצלי צלותיה, בגין דקוב\"ה אתרעי בצלותהון דצדיקייא, מ\"ט בגין דיתרבי ויתוסף רבות קודשא לכל מאן דאיצטרך בצלותהון דצדיקייא עכ\"ד הזוה\"ק. וכתב ק\"ז זלל\"ה למה זה דומה לצינור שנסתם ואם יבוא אחד ויפתחנו וינקנו שוב הוא פתוח לכל, וכמו\"כ ע\"י תפלתן של צדיקים נפתחו צנורות הישועה והחסדים וכל מי שצריך למימי הישועה ישאב בששון מאותו הצינור וכענין דכתיב ושאבתם וגו' ממעיני הישועה, וביארו המפרשים כי ישועת צדיקים הוא כמו מעיין הנובע ישועה לכל מיד ולדורות, ולכן הקב\"ה מתאווה לתפלתן שע\"י תפלתן יפתח הצינור והמעיין לכל מי שצריך לאותו דבר ע\"כ בייטב לב. ויובן בזה דברי המדרש מים עמוקים עצה בלב איש וגו' משל לבאר עמוקה מלאה צונן והיו מימי' צוננין ויפין, ולא היתה ברי' יכולה לשתות הימנה, בא אחד וקשר חבל בחבל וכו' ודלה הימנה ושתה התחילו הכל דולין הימנה ושותין, כך לא זז יהודה משיב ליוסף וכו', דהנה השבטים הק' לא היו צריכים לפעולות אלו בשביל עצמם. כי היה בכח קדושתם לפעול ישועה לעצמם בלאו הכי, אבל עשו כל זה שיהיה מעיין ישועה נמשך לדורות, ויש מקום בדבריהם הקדושים לדורות, כל דור לפי המצב ולפי המאורעות ולכך היו דבריהם מראין פנים לכל צד, שיהיה נמשך לדורות מעיין הנובע ישועה לכל מי שצריך, וכך היה יהודה משיב ליוסף דבר על דבר עד שעמד על לבו והכל דולין ושותין מהם לדורי דורות.",
            "explanation": "ביאור העניין הוא שהדברי יואל מבאר כי תפילות הצדיקים פותחות צינורות ישועה לדורות, וכך מתקיים קיום העולם בזכות תפילות אבותינו, שהן כמעיין נובע ישועה לכל דור ודור."
        },
        {
            "source": "Divrey Yoel, Torah, Vayigash (Torah #4, Passage #10)",
            "relevant_sentences": "אין משפטים ישירים",
            "passage": "עוד אפ\"ל במאמר הכתוב כי כמוך כפרעה, דהנה השבטים הק' הכינו תפלה ופועל דמיוני בדבריהם הקדושים בשביל דורות הגלות, ובכל דור ודור עומדים עלינו לכלותינו והקב\"ה מצילנו מידם, וברוב רחמיו וחסדיו ית\"ש מפיר עצת אויבינו ומבטל כל גזירות קשות שגוזרים על ישראל, וכמו שביטל גזירת פרעה, כדאיתא בגמרא (סוטה י\"ב ע\"ב) שמשה רבינו היה הראשון שנשלך ליאור. ומיד בטלה הגזירה שאמרו אצטגנינו פרעה כבר נלקה מושיען של ישראל ואח\"כ ניצול גם משה, נמצא שבטלה גזירתו לגמרי, וכמו כן הקב\"ה מבטל גזירות כל הקמים עלינו בכל דור ודור. וזה שאמר יהודה ליוסף. אתה רוצה לגזור עלינו גזירה קשה מרוע בחירתך. דע לך שהקב\"ה יבטל גזירתך, כמו שהוא עתיד לבטל גזירותיו של פרעה, כי האבות והשבטים הק' ראו ברוח קדשם כל מה שעתיד להיות עד סוף כל הדורות, זולת מה שהעלימו מן השמים מהם בכוונה לתכלית הענין, כגון זאת שלא הכירו את יוסף. וכמו שהעלימו מאברהם אבינו ע\"ה בשעת העתידה שאין רצון השי\"ת לשחוט את יצחק. אבל חוץ מאלו השיגו וראו כל העתידות, ולכך אמר יהודה ליוסף כי כמוך כפרעה. פרעה גוזר ואינו מקיים, כו השי\"ת יפר עצתו וגזירתו, כך אתה גוזר ואינו מקיים, ולא יתקיים גזירתך כי הקב\"ה יבטל אותה. ורמז לו עוד שיעמדו על ישראל בכל דור ודור גוזרי גזירות על ישראל, והשי\"ת יפח עצת אויבינו וכולם יתבטלו. וזה שאמר כי כמוך כפרעה, פי' יעמדו על ישראל עוד אנשים כמוך וכפרעה, שיגזרו גזירות רעות עלינו, והקב\"ה יצילנו מידם ויתבטל גזירתם.",
            "explanation": "ביאור העניין הוא שהשבטים הקדושים בתפילותיהם ובדבריהם הכינו כוחות רוחניים לדורות הגלות, ובזכות תפילות אלו הקב\"ה מבטל גזירות קשות בכל דור ודור, וכך קיומנו בעולם הזה תלוי בזכות תפילות אבותינו הקדושים."
        }
    ]
}