{
    "question_id": "c7e8c471-efa9-4092-9b99-42d832d40a3b",
    "question": "עניין חלומות יוסף",
    "selected_passages": [
        {
            "section": "Torah",
            "topic": "Vayeshev",
            "number": "7",
            "passage": "וילכו אחיו לרעות את צאן אביהם בשכם. פרש\\\"י שלא הלכו אלא לרעות את עצמן. הענין בזה יבואר עפ\\\"י הידוע גודל מעלת י\\\"ב שבטי י\\\"ה שהם נגד י\\\"ב צרופי הוי' ב\\\"ה ולכל אחד מהם הי' לו עבדות לכבוד שמים לפי דרכו והלוכו בקודש כמ\\\"ש הלא אחיך רועים בשכ\\\"ם ר\\\"ת \\\"ברוך \\\"שם \\\"כבוד \\\"מלכותו. ובזה יש להבין טעות השבטים שהי' עולה בדעתם לרעות את עצמן פי' שהם רועים בעצמן ואינם צריכין לרב ומנהיג כי כולם קדושים ועובדים הבורא ב\\\"ה בכל לבבם. וזה הרמז בחלומו של יוסף והנה אנחנו מאלמים אלומים בתוך השדה והנה קמה אלומתי וכו' ותשתחוין לאלומתי. שהי' מרמז להם אף כי המה כולם קדושים אעפ\\\"כ הם צריכים לו להיות להם לראש ולמנהיג כי הוא צנור כל ההשפעות בחי' צי\\\"ע. כי כן הי' כוונת הבריאה שיהי' בכל דור צי\\\"ע אור זרוע לצדיק ולישרי לב שמחה כי ע\\\"י הצדיק הולכים כל ההשפעות. ודבר זה גלה לנו הבעש\\\"ט זי\\\"ע שהפיץ אורו על פני תבל כי בלתי דיבוק חכמים שבדור איננו באפשרי להיות קיום לעולם. וזה שהי' כוונת יוסף לטובתם ולא מפני התנשאות עליהם חלילה רק למען החיש טובתם. ולו שמעו ויחלו לקבל עול מלכותו אז יכול להיות גאולה שלימה. כמ\\\"ש ויוסף בן שבע עשרה שנה. עולה בגימ' טו\\\"ב אמרו לצדיק כי טוב. אך מפני כי הלכו לרעות את עצמן כאשר זה הי' ג\\\"כ טעות קרח שאמר כל העדה כולם קדושים ומדוע תתנשאו כו'. ובאמת לא כן הי' רצונו ית\\\"ש אף אמנם כולם קדושים אדרבא לזה הם צריכים למשה רבינו שיהי' המנהיג כדי שילכו ההשפעות על ידו כמ\\\"ש אצל רשב\\\"י באדרא רבא שהי' יושב עמהם ומצוה לתלמידיו שיאמרו כ\\\"א ד\\\"ת לפניו כמ\\\"ש פתח ר' אבא וכדומה לכן תלמידיו של ר\\\"ע אמרו כל הפורש ממך כפורש מן החיים כי כל החיים שלהם הי' על ידו הן השפעות החכמה ועניני עוה\\\"ז ג\\\"כ. וזה הי' ענין יוסף שהוא הי' צדיק הדור כמ\\\"ש לאסור שריו בנפשו וזקניו יחכם. כמ\\\"ש כי בן זקונים הוא לו ותרגומו כי בר חכים הוא לי'. פי' שהי' מעורר עולם החכמה עולם הזקנה. ולזה אחר מכירתו של יוסף כתיב וירד יהודה מאת אחיו. פי' שהי' ירידה במלכות בית דוד. וסוף דבר פוק חזי מה עלתה בם כי גם לחם לא הי' להם עד שירדו למצרים. וזה הענין הי' גם במשרע\\\"ה שאמר יוסף ה' עליכם כו'. פי' בחי' יוסף הוא צדיק הדור יהי' עמכם. ועי\\\"ז יברך אתכם כאשר דבר לכם בשעת מ\\\"ת:",
            "english_translation": "And his brothers went to feed their father's flock in Shechem but they went only to feed themselves and this matter will be explained according to the known greatness of the twelve tribes of God which correspond to the twelve combinations of God's name and each one had their own divine service according to their way and holy path as it is written \"Are not your brothers feeding in Shechem\" which are the initials of \"Blessed be the name of His glorious kingdom\" and in this we can understand the tribes' error in thinking they could shepherd themselves meaning they were their own shepherds and needed no rabbi or leader since they were all holy and served the Creator with all their hearts and this is hinted at in Joseph's dream \"behold we were binding sheaves in the field and behold my sheaf arose\" indicating that although they were all holy they still needed him as their head and leader for he was the channel of all divine influence and this was the intention of creation that in every generation there should be a righteous one a light sown for the righteous and joy for the upright in heart for through the righteous one all influences flow and this matter the Baal Shem Tov revealed to us spreading his light throughout the world that without connection to the sages of each generation the world cannot exist.",
            "average_score": 9.0,
            "reference": "Tiferet Shlomo, on Torah, Vayeshev 7"
        },
        {
            "section": "Torah",
            "topic": "Vayeshev",
            "number": "4",
            "passage": "וישראל אהב את יוסף מכל אחיו ועשה לו כתונת פסים. ויקנאו בו אחיו וכו'. בגמ' שבת דף י' בשביל משקל ב' סלעים מילת שנתן יעקב ליוסף יותר משאר בניו נתקנאו בו אחיו ונתגלגל הדבר וירדו אבותינו למצרים. הנה הדברים האלו לפי פשוטן אין להם שחר. האם יתכן בקדושי עליון שבטי י\\\"ה כי יתקנאו עבור ב' סלעים מילת וכתונת. אמנם שורש הענין הוא ע\\\"ד שכתוב והבדילה הפרכת לכם בין הקודש ובין קודש קדשים למה הוצרך עוד הפרכת להבדלה הלא כבר מקודש החצר והמשכן עד מאד ומה תוסף עוד הפרכת להבדלה יכול להיות קדשי קדשים בלא הבדלה מהפרכת. אולם להבין זה הנה ידוע לי\\\"ח מענין הצמצום הרבים אשר בשעת בריאת עולם כדי שיוכלו העולמות למטה. להכיל אור א\\\"ם ב\\\"ה כי יש כמה וכמה אלפים ורבבות עולמות למעלה מעולם האצילות בבחי' לבושים זה בתוך זה וכן בד' עולמות אבי\\\"ע יש בהם שבא האור ההוא למטה דרך חלון ומסך ולבוש והיכלות כי זה בלא זה לא היו יכולין לקבל האור המתנוצץ עד עולם העשי' וממנו לעולם השפל הזה ג\\\"כ כזה כי שמש ומגן ה' כו' ד\\\"מ כמו אור השמש אשר לא יוכלו הבריאים להנות ממנו ולקבל אורו הגדול רק ע\\\"י מעבר החלון ומסך והיכלות. והנה בזמן שהי' בהמ\\\"ק קיים ואור ה' הופיע על הבהמ\\\"ק בקדשי קדשים בשפע רב לא הי' העולם יכול לסבול ולקבל האור היוצא בביהמ\\\"ק לכן הוצרך הפרכת להבדלה ד\\\"מ למען יוכלו הבריות לקבל אור השפע העליון אחרי מסך הפרכת והאולם וההיכל. וכן הי' הענין בבגדי כהונה (של)הכה\\\"ג חושן אפוד וכתונת וכו' להיות דוגמת האדם העליון והאורות החסדים בוקעים ומאירים בו הוצרך לבגדים יתירים האלו כמבואר בכתבי האריז\\\"ל סוד הלבושים. אך כאשר נכנם לפני ולפנים הי' לבוש רק ד' בגדים דוגמת ד' עולמות אבי\\\"ע. ולכך כה\\\"ג המחוסר בגדים פסול לעבודה. וזה הי' ג\\\"כ ענין הכתוב ופרשו עליו בגד תכלת וכסו בה את ארון העדות. בהיות הארון מקום השראת הקדושה האור העליון הוצרך הכיסוי תכלת שהוא בחי' צמצום כי תכלת דומה לכסא כבוד בחי' היראה כמבואר בזוה\\\"ק דתכלת היא תכלא דשצי כולא והוא בחי' גבורה והוא בחי' לבוש לצמצם האור כנ\\\"ל. וזה ג\\\"כ ענין המשמורות כהונה ולווי' שהיו בבהמ\\\"ק כי גם הלוים הי' בבחי' גבורה וצמצום על אור החסד שהיו הכהנים משפיעים לבל יצאו החוצה ואל יבוזו זרים והוא הענין התכלת האמור בציצית ונתנו על ציצית הכנף פתיל תכלת. שאור הציצית יהי' בחי' צמצום נגד החיצונים. כי ע\\\"ז מורה ענין התכלת בחי' גבורה וצמצום. וז\\\"ש בלשם יחוד בעטיפת הטלית. ובזכות מצות ציצית תנצל נפשי וכו' והטלית יפרוש כנפיו עליהם. כי הטלית הוא בחי' אור המקיף להנצל מן החיצונים. ולכך מתעטפין בטלית בשעת התפלה על התפילין לצמצם האורות של התפילין. וזש\\\"א מה יקר חסדך וכו' ואח\\\"כ משוך חסדך ליודעיך פי' אחר שנתעטף בטלית לצמצם החסדים מן החיצונים אז משוך חסדך ליודעיך כנ\\\"ל. ונחזור לענינינו. הנה כי זה הי' סוד כתונת יוסף שעשה לו אביו כתונת פסים. ומבואר במדרש שעשה לו ד' בגדים הרמז סוד לבושים הנ\\\"ל שהי' כה\\\"ג לובש בהם כי אמנם ידוע היות יוסף בחי' היסוד מכל העולמות צי\\\"ע והוא צנור ההשפעות. וכח הצדיק לצמצם ההשפעות לבל יתפשטו בין החיצונים כמ\\\"ש כי בן זקונים הוא לו. וזה שעשה לו אביו כתונת פסים ד' לבושים הנ\\\"ל בסוד ד' עולמות אבי\\\"ע כי יעקב ויוסף הם הצי\\\"ע כמ\\\"ש בווין תתקטר תרין ווי\\\"ן לכך הי' צריך הלבוש להיות נעשה ע\\\"י יעקב בעצמו לקשר ולדבק בו בחי' צי\\\"ע ולהיות מסך להשפעה העוברת על ידו להשמר מן החיצונים כמ\\\"ש שומר ה' את כל אוהביו. דלכאורה תיבת כל הוא מיותר. אך ידוע כי כל רומז לצי\\\"ע וכאשר הש\\\"י שומר ההשפעות ע\\\"י בחי' כל הוא הצדיק. אזי ממילא כל הרשעים ישמיד וכידוע ענין סוד כתונת אור של אדה\\\"ר להיות בסוד הלבישה כנ\\\"ל. וזה שאמרו חכז\\\"ל גנזו לצדיקים לע\\\"ל שהאור הראשון נגנז לצדיקי הדור שירדו ההשפעות על ידם וממילא הם נשמרים מן החיצונים והיא הגנוזה בהם. והוא שמצינו אצל רבקה ותקח את בגדי עשו בנה החמודות שחמד אותם מנמרוד שהי' לו מאדה\\\"ר וע\\\"י הקלקול באו לידי עשו. ורבקה נתכוונה להוציאם מידו להלביש את יעקב בנה הצדיק כי לו יאתה לקחת אותם. והנה בהיות הכרח סוד הלבושים האלו ליוסף להיות מסך נגד האור והחסד העובר על ידו לכן קנאו בו אחיו. באמרם כי גם המה בחי' צי\\\"ע. וזה שהשיב להם יוסף והנה תסובינה אלומותיכם ותשתחוין לאלומתי. כי הכל תלוי בו. כי הצדיק הוא העמוד שהעולם קיים על ידו והם לא האמינו לדבריו והפשיטו את כתנתו את כתונת הפסים והוא הי' עיקר הפגם של השבטים במכירת יוסף. וזו שהשמיענו הכתוב בזה שהפשיטו את כתנתו לומר שרצו לקחת ממנו בחי' הלבושים הנ\\\"ל לכך באו לכל הצרה הזאת ולולי כי הפשיטו את כתנתו לא הי' להם כח להזיקו במכירתם. אך מחמת כי הפשיטו את כתנתו הורידו את השפע לחיצונים. כמ\\\"ש להלן וישבו לאכול לחם וכו' וגמליהם נושאים כו' הולכים להוריד מצרימה פי' ההשפעות הלכו למצרים וז\\\"ש והשליכו אותו הבורה והבור ריק אין בו מים. ודרשו רז\\\"ל אבל נחשים ועקרבים יש בו. תיבת אותו רומז לבחי' אות ברית צי\\\"ע כי המדה זאת ירד להחיצונים. ולזה ויברך ה' את בית המצרי בגלל יוסף. וז\\\"ש יעקב כתונת בני חי' רעה אכלתהו טרוף טורף יוסף. לפי פשוטו אין הבנה לזה איך יצא מפיו של אותו צדיק דבר אשר לא כן הי' כי באמת הי' יוסף חי במצרים. אך לפי הנ\\\"ל הפי' בזה כי מפני שהפשיטו את הכתנת בחי' הלבוש כמ\\\"ש כתונת בני שעשה לו יעקב בעצמו בחי' לבוש כנ\\\"ל טרוף טורף יוסף רמז לרפ\\\"ח ני\\\"ק ובגלות הוא נטרף לחיצונים. וזה שהתמרמר יעקב אבינו כי ארד אל בני אבל שאולה. ר\\\"ל כי אצטרך לירד להוציא מהם ההשפעות והני\\\"ק שנפלו. וז\\\"ש ויבך אותו אביו בחי' או\\\"ת כנ\\\"ל ולכך כאשר נדחה השפע לחיצוני' לכן נשארו השבטים חסר לחם. ויוסף בהיותו בגלות הי' רוצה לעשות לו בעצמו לבושים ולא הועיל כדכתיב ותתפשהו בבגדו כו' פי' בגד שלו. אבל בבגד של אביו לא הי' לה שליטה. וזה ויעזוב בגדו בידה וינס ויצא החוצה. כידוע ענין עשרה הרוגי מלכות שנתגלגל עי\\\"ז כיל\\\"ח אך כאשר יצא יוסף מבית האסורין כתיב ויגלח ויחלף שמלותיו כי אז חזר בחי' הלבושי' ע\\\"י אורו עוטה כשלמה כמו שהי' בתחילה. וז\\\"ש יוסף לפרעה בלעדי אלהים יענה את שלום פרעה. כי כאשר היניקה יורד להחיצונים הוא בחי' אלקים. וז\\\"ש יוסף בלעדי אין לך משלי כלום כי אני מבחי' הוי'. רק אלהים יענה את שלום פרעה היניקה שלך הוא מבחי' אלקים. אשר נמשך החיות לבהמות וחיות אפי' הטמאות כמ\\\"ש ר' אליעזר אפי' בהמה טמאה נפשה לשמים. החיות שלה מבחי' אלקים ע\\\"י צמצום והשתלשלות עד אשר נעשה חלילה אלקים אחרים וחיצונים ר\\\"ל. אולם אח\\\"כ כשבאו אחי יוסף ונעשה היחוד וצירוף בשם הוי' וחזר בחי' היסוד אז אמר יוסף שימו לחם סוד ג' הויו\\\"ת. וז\\\"ש ויתן להם לבדם ולמצרים לבדם כי לא יוכלון המצרים לאכול את העברים לחם כי תועבה הוא למצרים. ר\\\"ל כי המצרים ניזונים מבחי' אלקים אחרים ובישראל כתיב לא תאכל כל תועבה. וזה שאמר יוסף חי פרעה אם תצאו מזה. ר\\\"ל אם תצאו מזה הנה תשוב החיות לפרעה. וזש\\\"א בשבת יום קדוש הוא מבואו ועד צאתו. כי השפע היורד בשבת הוא מצד הקדושה בחי' יסוד צדיק כמ\\\"ש וזכרת כי עבד היית במצרים לעבד נמכר יוסף כמבואר במ\\\"א. לכן השפע היורד בשבת מעולם העליון הוא בשמירה מהחיצוני' כי הוא מצד הקדושה מבואו ועד צאתו לעוה\\\"ז. לכן כל זרע יעקב יכבדוהו כו' ואל יבוזו זרים. ודברינו הנ\\\"ל נרמזו בדברי הזוה\\\"ק פ' בלק דף רד ע\\\"ש והבן:",
            "english_translation": "And Israel loved Joseph more than all his brothers and made him a coat of many colors. And his brothers envied him. In the Talmud Shabbat page 10, because of two selas worth of fine wool that Jacob gave Joseph more than his other sons, his brothers became jealous of him and the matter developed and our fathers went down to Egypt. These things according to their simple meaning have no dawn. Is it possible for the supreme holy tribes of God to be jealous over two selas of fine wool and a coat. Indeed the root of the matter is as it is written \"And the curtain shall separate for you between the holy and the holy of holies\" why was the curtain needed for separation when the courtyard and tabernacle were already very holy and what more separation would the curtain add could there not be a holy of holies without separation from the curtain.",
            "average_score": 9.0,
            "reference": "Tiferet Shlomo, on Torah, Vayeshev 4"
        },
        {
            "section": "Torah",
            "topic": "Miketz",
            "number": "14",
            "passage": "מכי\\\"קאם כנים אתם אחיכם אחד יאסר כו' ואתם לכו הביאו שבר רעבון בתיכם ואת אחיכם הקטן תביאו אלי ויאמנו דבריכם וכו'. הנה יש לשום לב על התימה הגדולה שכבר הקשו בה הראשונים ז\\\"ל למה לא הודיע יוסף לאביו כי עודנו חי והוא מושל בארץ מצרים. האמנם כי טרם באו אחיו אליו לא יכול להודיעו מפני החרם וקיום החלומות שהיו צריכין אחיו לבא אליו. אבל כאשר כבר באו אחיו הלום היה לו להתוודעות להם מיד למען החיות רוח אביו הזקן איזו ימים קודם ולא לצערו עוד יותר בבנימין כי לפי האמת מה צורך היה לו בבנימין לבא אליו תחלה למצרי'. אמנם הנה כבר נודע ומובא בזוה\\\"ק ובספרים כי כל ענין הזה של מכירת יוסף הוא רמוז על סודות נשגבים ונוראים. הנה כן יש לרמז בזה כי ענין גלות יוסף למצרים ואשר התוודע אל אחיו וכל הענין הכל הוא ברמז על גלות האחרון ועל הגאולה שאנו מחכים אליה במהרה. והנה ביאת בנימין למצרים ואח\\\"כ התוודע יוסף אל אחיו זה רומז על אליהו הנביא כמו שכתוב בספר הגלגולים שנשמת אליהו הנביא שיורדת לעוה\\\"ז הוא נשמת בחי' בנימין כמו שאמר אליהו לחכמים מבני בניה של רחל אני. והוא שכתוב הנה אנכי שולח לכם את אליה הנביא לפני בא יום ה' כמו שבגלות מצרים הוצרך בנימין לבא לפני התוודעו' יוסף. והנה יוסף הוא רמוז על משיח בן יוסף וז\\\"ש האיש אשר נמצא הגביע בידו הגבי\\\"ע גימ' צ' כמבו' בזוה\\\"ק כי בנימין הוא צדיק במקום יוסף דהיינו יסוד של יעקב כמ\\\"ש אלה תולדות יעקב יוסף כנודע. וז\\\"ש הגבי\\\"ע ביד\\\"ו ביו\\\"ד הוא יסוד. וז\\\"ש הוא יהיה לי עבד הוא רמז על העתיד כמ\\\"ש ביום ההוא יהיה ה' אחד. כי לעתיד יהיה השם בשני יודי\\\"ן וזה הו\\\"א יהי\\\"ה. והנה זה שכתוב והוא נחש ינחש בו כי נחש ינחש איש אשר כמוני נחש גימט' משי\\\"ח כי כשנשכח הנו\\\"ן של נח\\\"ש נעשה משי\\\"ח וזהו נחש בן יוסף הוא משיח בן יוסף כנ\\\"ל איש אשר כמוני כמו יוסף שהיה בגלות ואח\\\"כ למחיה שלחני אלהים לפניכם ויכלכל יוסף את אחיו. הים ראה וינס ארונו של יוסף ראה. כן המשיח של העתיד. ובהגלות הוא חליינו הוא נשא והיינו חבלו של משיח כמבואר בזוהר ובספרים. ולזה הטמין הגביע באמתחת בנימין שהוא נשמת אליהו הנביא. וזה שמסיים אח\\\"כ ואתם עלו לשלום אל אביכם. היינו שע\\\"י בנימין ויוסף שהוא אליהו ומשיח בן יוסף עלו לשלום אל אביכם יהיה הגאולה ב\\\"ב. ואח\\\"כ ויגש אליו יהודה היינו משיח בן דוד שבא מיהודה. כי משיח בן יוסף הוא תיקון היסוד של כל העולמות ומשיח בן דוד הוא יתקן ספירת המלכות שהוא שם אדנ\\\"י כנודע והאר פניך על מקדשך השמם למען אדני היינו שם אדנ\\\"י שהוא בית המקדש. ולזה היה שבט יהודה ובנימין שותפים בחלק הבהמ\\\"ק כמבואר בתנ\\\"ך ובגמרא שחלקו של יהודה היה אוכל אמה במזרח ודרום של המזבח שזה מרמז לעתיד שע\\\"י שניהם אליהו ומשיח יהי' הגאולה ב\\\"ב. גם מבואר בספר הגלגולים שגם נשמת יוסף היה באליהו ונשמת בנימין היא היורדת לצדיקים ולומד עמהם ועושה נסים לצדיקים ולזה הוצרך לבנימין למצרים קודם התוודעות יוסף לאחיו שהוא הגאולה באותו הזמן. ולזה אמר לו אלהים יחנך בני. וזהו ותרב משאת בנימין היינו שיוסף נתן לו חלק מנשמתו כנ\\\"ל. ולזה במרדכי ואסתר שהיה איש ימיני נאמר וגם חרבונה זכור לטוב ואמרו חכז\\\"ל שזה היה אליהו כי הוא איש ימיני כנ\\\"ל. וזהו הרמז במס' בבא בתרא דף י\\\"א בבנימין הצדיק שהחיה אשה ושבעה בניה. היינו בנימין שהיה צדיק במקום יוסף כנ\\\"ל החיה השכינה ושבעה ימי הבנין שלה מחסד עד המלכות. והבן:",
            "english_translation": "If you are honest, one of your brothers will be imprisoned, and you go bring grain for the hunger of your houses, and bring your youngest brother to me, and your words will be verified. Behold, one must consider the great puzzle that the early sages already questioned - why did Joseph not inform his father that he was still alive and ruling in Egypt. Indeed, before his brothers came to him he could not inform him because of the ban and fulfillment of the dreams that required his brothers to come to him. But when his brothers had already come there, he should have revealed himself to them immediately to revive his elderly father's spirit some days earlier and not cause him additional anguish over Benjamin, for in truth what need did he have for Benjamin to come to Egypt first.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Torah, Miketz 14"
        },
        {
            "section": "Torah",
            "topic": "Vayeshev",
            "number": "14",
            "passage": "וירד יהודה מאת אחיו. במד\\\"ר רשב\\\"נ פתח כי אנכי ידעתי את המחשבות כו' שבטים היו עסוקים במכירתו של יוסף. ויוסף היה עסוק בשקו ותעניתו וכו' והקב\\\"ה היה עוסק ובורא אורו של משיח ע\\\"כ. הנה יש להעיר בדברי המאמר הזה מהו שייכות יש לכל דברי הצומות והשקים של הצדיקים הללו לברא אורו של משיח וכי לא היה עוד זמן אחר טוב ונרצה לפני הש\\\"י ב\\\"ה להוציא אורו הגדול רק בזמן הזה שכל בני יעקב חגרו שקים ואביהם עמהם. אולם כאשר נעמוד להתבונן מעט על חוקי הנהגת העולם עפ\\\"י הש\\\"י מתחלת הבריאה עד עתה. הנה זה מצאנו ראינו כי כל עניני עוה\\\"ז לא יכלו לצאת אל הפועל הגמור והתכלית האמיתי זולת אחרי ההעדר המוחלט ושיוקדם להם האין הכללי וכמ\\\"ש חכז\\\"ל ההעדר קודם להויה ר\\\"ל כי בחי' ההעדר הוא בהכרח קודם למציאת ההוי' והוא הסיבה למציאת ההו' שיבא אח\\\"כ וכמו שנראה זה בתבואת הזרע אשר לא יעלו ולא יצמיחו זולת אחר הרקבון הגמור בעפר כולו. והנה כן הענין היה בתחלת הבריאה האור שבא מכח החשך הקדום לו כמ\\\"ש והארץ היתה תהו ובהו וחשך ויאמר אלהים יהי אור כי מציאת החשך הוא הסיבה לאור וכן ויהי ערב ויהי בקר מבחי' הערב יבא הבקר אחריו. וזהו יוצר אור ובורא חשך ע\\\"י שבורא החשך תחלה עי\\\"כ יצא האור ובקר אחריו להתגלות. וז\\\"ש יתרון החכמה מן הסכלות כיתרון האור מן החשך ר\\\"ל כמו שיתרון האור לא יכול להיות רק אחר מציאת החשך הקדום לו וממנו יוצא האור וזהו מן החשך עצמו יצא האור כן יתרון החכמה תבא לאדם רק מבחי' הסכלות עצמה. פי' שיעשה האדם עצמו כסכל לעולם ולא יהיה נחשב בעיניו לכלום. אז יגיע למעלת החכמה האמיתית כמ\\\"ש א\\\"א ע\\\"ה הנה נא הואלתי לדבר אל ה' ואנכי עפר ואפר ר\\\"ל מה שהואלתי לדבר הוא יען כי אני יודע בעצמי כי הנני עפר ואפר וז\\\"ש אצל מתן תורה ויהי בשמעכם את הקול מתוך החשך. יש להבין מה אשמעינן בזה בשמיעת הקול מתוך החשך ולא נאמר מתוך האש כמו בזולתו. אך בהיות המעמד המובחר ההוא של מתן תורה התכלית המכוון והקיום האמיתי של בריאת העולם כולו הנה לא יכלו בנ\\\"י לקבל את האור הגדול ההוא זולת ע\\\"י סיבת החשך הקדום לו למציאת האור כמו שהיה כן אצל תחלת הבריאה וחשך על פני תהום ויאמר אלהים יהי אור. נמצא כי אך הסיבה העצמיות לתכלית הויות האור הוא החשך הקדום לו. והנה כזה הוא התכלית למציאת אור ה' נשפע על האדם הוא רק ע\\\"י בחינת החשך אשר תוקדם לו לעולם. אשר ידע ויבין בדעו ושכלו גודל חשכת נפשו כמה הוא מגשש באפילה ובמה נחשב הוא אז עי\\\"כ יזכה אשר השי\\\"ת ב\\\"ה יוציאנו מאפילה לאור גדול כמ\\\"ש אני אשכון את דכא והוא שרמזו רז\\\"ל במשנה במס' נגעים פרק ב' מי שהוא בבית אפל אין פותחין לו חלונות לראות את נגעו. ר\\\"ל מי שהוא בבית אפל על מעשיו אשר לא טובים אין פותחין חלונות שיראו אחרים בנוולתו ונגעי לבבו כי אם הוא ישב בחשך ה' אור לו. וכן אמרו עוד שם במשנה אין רואים את הנגעים שחרית ובין הערבים. ר\\\"ל בזמן תפלת שחרית ובין הערבים לא יבקר אז האדם אחרי נגעי לבבו פן יתעצב אל לבו ולא יהיה יכול להתפלל כדת אך יבחר לו זמן אחר מזמנים הידועים הראוים לכל אלה. נחזור לעניננו הנה מציאת ההעדר הוא הסיבה להויה זהו ג\\\"כ ענין המיתה ר\\\"ל שנקנסה על האדם אשר אחריה נקוה לשוב ולהחיות עוד בתחיית המתים אשר לכאורה אין להבין למה צורך להמית ולהחיות אח\\\"כ טוב היה להניח מזה ומזה ושיחיה האדם לעולם ואם בעבור מירוק העון הלא הרבה צדיקים שמתו בלא עון רק מעטיו של נחש. אך הכוונה הוא ג\\\"כ כנ\\\"ל בהיות כי התכלית הנרצה מה שיהיה לעתיד שיתגלה כבוד מלכותו ית\\\"ש לעיני כל בשר באורו הגדול לכן אין בכח מציאת מין האנושי בעוה\\\"ז לקבל האור הגדול רק ע\\\"י ההעדר הקדום לו במיתה הזאת עתה שהיא הקדמה וסיבת קבלת האור ההיא של תחה\\\"מ. וזהו שסמוך לברכת מחיה מתים קדושת השם נקדישך ונעריצך כסוד שיח שרפי קודש. הכוונה כי אז בתחה\\\"מ נקדישך גם אנחנו כמו שמקדישים אותך בסוד שיח שרפי קודש. ואז כתר יתנו לך מלאכים המוני מעלה עם ישראל קבוצי מטה כי אתה קדוש ושמך קדוש וקדושים בכל יום יהללוך סלה. לכן גם אנחנו מקווי' ומצפים להלל אותך בסוד קדושים הללו. נמצא כי בחי' המיתה הקודמת בבחי' החשך לקבל' האור העתיד וזהו שאנו אומרים מלך ממית ומחיה ומצמיח ישועה. ר\\\"ל מה שהוא ממית הוא כדי להחיות אחר כך כשיצמיח ישועה בקרוב. וז\\\"ש חכז\\\"ל החיים למות והמתים להחיות. ולכאורה קשה מי לא ידע בכל אלה ומהו משמיענו בזה. אך הכוונה כנ\\\"ל מה שהחיים למות הוא כדי שהמתים להחיות בתוקף אור הגדול ביתר שאת ויתר עוז. וזהו שאמרו חכז\\\"ל והנה טוב מאד זה המה\\\"מ כי הוא טוב מאד להיותו הסיבה המיתה וההעדר הכנה לביאת האור הגדול לנפשות העתידים לעמוד בתחה\\\"מ כנ\\\"ל. וכענין הזה הוא שהיה אצל האמהות הקדושות אשר היו עקרות זמן הרב קודם לידתן עד בואם בשנים בקצה האחרון רק אז נפתחו רחמם כמו שרה לא זכתה להריון עד בלותה עפ\\\"י נס. וכן רבקה ורחל ויוכבד היא עלתה על כלנה עד היותה בת ק\\\"ל שנה. וזה קשה להבין למה היתה כזאת שעכבום הש\\\"י עד קצה האחרון. אך כדברינו נכון כי אחרי אשר ראו להאמהות הקדושות האלו להוליד נשמות הקדושות האלו נפשות הצדיקים המאורות הגדולים ההם. הנה לא יתכן להם להוציא האור זולת אחרי ההעדר הקודם לכן המתין להם הקב\\\"ה עד עת זקנתן עד שלא חשבו עוד להיות להם זרע כלל ומן החשך ההוא הוציא להם אור גדול כמשרע\\\"ה והאבות הקדושים ע\\\"ה. והנה כן היה הדבר בהנהגת הש\\\"י עם עמו בנ\\\"י בגלותינו אשר בכל עת ענינו ומרודינו כשהם לוחצים אותנו עד מאד רק אז מן החשך מושיע להם ומוציאם לאור גדול וזהו שצעק הנביא כמו ההרה תקריב ללדת תחיל ותזעק בחבלי' כן היינו מפניך ה' דהנה ההרה הקרובה ללדת גם היא לא תוליד עד אשר תבוא אז בהסכנה העצומה ותגדל חבליה מאד אז בקצה האחרון יושיע לה הש\\\"י כן אנחנו חלנו ואין בנו עוד כח ללידה כמו ילדנו רוח. וזה הוא ענין משיח צדקנו שאמרו חכז\\\"ל כי ביום שנחרב הבהמ\\\"ק נולד משיח וביום שחשב הש\\\"י להשחית חומת ירושלים נטה קו על בנין העתיד כי בהיות החורבן ההוא יום בכי ומספד אף בבתי גואי אשר כמהו לא יהיה עוד אח\\\"כ לכן ביום ההוא מחמת החשך וההעדר ההיא יצא משיח. והנה זה ג\\\"כ ביאור המד\\\"ר הנ\\\"ל כי פרץ וזרח שניהם מורים על משיחנו שיבא ב\\\"ב לכן רק בעת החשך ההוא שכל בית יעקב היו אגודים בצרה בשקם ותעניתם אז זרח בחשך אור לישרים ולהוציא הקב\\\"ה אז אורו של משיחנו ב\\\"ב אמן:",
            "english_translation": "And Judah went down from his brothers. In the Midrash Rabbah, Rabbi Shimon ben Nachman opened with \"For I know the thoughts etc.\" The tribes were occupied with selling Joseph, and Joseph was occupied with his sackcloth and fasting etc., and the Holy One Blessed be He was occupied with creating the light of the Messiah. Behold, one must note regarding this statement what connection exists between all the fasting and sackcloth of these righteous ones to create the light of the Messiah, and was there not another good and favorable time before the Lord Blessed be He to bring forth His great light except at this time when all of Jacob's sons wore sackcloth along with their father. However, when we stand to contemplate a bit about the laws of world governance according to the Lord from the beginning of creation until now, we have found and seen that all matters of this world could not come to complete actualization and true purpose except after absolute absence and that general nothingness must precede them, as our Sages said absence precedes existence, meaning that the aspect of absence necessarily precedes the existence of being and it is the cause for the existence that comes afterward, as we see with grain seeds which will not sprout or grow except after complete decomposition in the soil. And so it was at the beginning of creation - the light that came from the power of darkness that preceded it, as it is written \"And the earth was formless and void and darkness\" and \"God said let there be light, \" for the existence of darkness is the cause for light, and so \"there was evening and there was morning\" - from the aspect of evening comes morning after it. And this is \"forms light and creates darkness\" - through creating darkness first, through this light emerges and morning follows to be revealed.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Torah, Vayeshev 14"
        },
        {
            "section": "Torah",
            "topic": "Vayeshev",
            "number": "3",
            "passage": "אלה תולדות יעקב יוסף. נקדים מ\\\"ש לפרש המאמר בווין תתקטר. עפ\\\"י הידוע כי גדול כח הצדיק השומר ברית קודש שהוא הצנור מכל השפעות טובות שיורדים לעולם. ובשעת בריאת העולם הי' רצונו ית\\\"ש שיהי' בכל דור ודור צי\\\"ע בחי' יסוד. וז\\\"פ בווין תתקטר רמז לצי\\\"ע יעקב ויוסף הם ב' ווי\\\"ן. וז\\\"ש בנוסח תפלת שמ\\\"ע אלהי אברהם אלהי יצחק ואלהי יעקב וי\\\"ו יתירה רומז להנ\\\"ל. וזהו בווין תתקטר. כביכול השכינה הקדושה רודפת אחר הצדיק הזה להאחז בו כדי שירדו ההשפעות על ידו לכנ\\\"י. כמ\\\"ש ותתן טרף לביתה. טר\\\"ף רמז לרפ\\\"ח ניה\\\"ק שנפלו לסט\\\"א ועי\\\"ז הם חוטפים ההשפעות. והשכינה היא מצלת מידם ונותנת הטרף לכנ\\\"י ע\\\"י הצדיק יסוד עולם. וזה הענין מצינו ביוסף הצדיק כמ\\\"ש רב עוד יוסף בני חי. פי' כי יוסף העלה רב ניצוצות ממנין רפ\\\"ח ולא נשאר רק פ\\\"ו כמנין אלהי\\\"ם וע\\\"ז הוא כל העבדות בנ\\\"י לגמור תיקונם להעלותם עד ביאת הגואל ב\\\"ב. וז\\\"ש כי יש שבר במצרים כי מגודל כח קדושתו של יוסף שעמד בניסיון בהיותו במצרים ערוות הארץ. וזה ג\\\"כ לשבור בר רמז על ר\\\"ב ני\\\"ק כנ\\\"ל. וע\\\"י הצי\\\"ע יש שמחה למעלה בעולמות העליונים לאין שיעור כי נתגדל ונתקדש שמו הגדול כמ\\\"ש ונגדלך ונשבחך ונפארך. וז\\\"ש ואתם הדביקים בה' אלהיכם חיים כולכם היום. פי' שהם המיחדים ועושים הדביקות בשם הוי' ב\\\"ה. וזהו הרמז באות וא\\\"ו בתוך הב' ווין אות א' עולה י\\\"ג כנגד י\\\"ג מכילין דרחמי. וז\\\"ש ר' ישמעאל אומר בשלשה עשרה מדות שהתורה נדרשת בהן. פי' אם הוא בבחי' זו להיות בבחי' צי\\\"ע לעשות היחוד בי\\\"ג מדות אזי התורה נדרשת בהן. פי' שהקב\\\"ה כביכול דורש התורה משמו כמ\\\"ש ואתה דורש מעשה כולם. כמ\\\"ש בגמ' מאיר בני אומר. אליעזר בני אומר. וז\\\"ש אשר יעשה אותם האדם וחי בהם אני ה'. כביכול החיות שלו מגודל קדושת בנ\\\"י הצדיקים. יסודי עולם אתם אותיות אמת. וזה הענין מ\\\"ש כי בן זקונים הוא לו. זקן אהרן שיורד על פי מדותיו. זקן הוא עולם הזקנה כמ\\\"ש עד אברהם לא הי' זקנה. ר\\\"ל שלא הי' מי לעורר אותו העולם. והצדיק אשר הוא במדריגה זו הוא המנהיג ומשפיע לכל הדור ההוא אף בזמן הגלות. וז\\\"ש נוהג בארץ ובחוץ לארץ וכן מצינו ביוסף הצדיק שהי' במצרים לעבד נמכר יוסף כשעמד בניסיון הזה הי' מביא נ\\\"ר בכל העולמות בשעת הניסיון. ופוק חזי מה עלתה בו שמו אדון לביתו ומושל בכל ארץ מצרים. אך אין להסתכל על תכלית המעלה והגדלות שלו רק על הניסיון אשר עמד בו וקיים כל העולם בזה אף אחרי מותו כמ\\\"ש הים ראה וינס ארונו של יוסף ראה. וזה ג\\\"כ פי' הכ' וכל אשר הוא עושה ה' מצליח בידו. פי' שם הוי' הי' מצליח בידו. כמ\\\"ש אנא ה' הושיעה נא. אנא ה' הצליחה נא. וזה ג\\\"כ מצליח בידו הוא יו\\\"ד אשר גם תוכו הוא אות וי\\\"ו ויו\\\"ד רמז לחכמה. כי כתר הוא קמץ כידוע לי\\\"ח והחכמה הוא פתח. פי' הפ' פיה פתחה בחכמה רמז להנ\\\"ל. פותח את ידיך יודי\\\"ך. וכח הצדיק לעורר עולם החכמה ולהביא כל השפעות טובות הן במילי דשמיא ובמילי דעלמא כל השפעות טובות לכלל ישראל אמן:",
            "english_translation": "These are the generations of Jacob Joseph. When we preface what is written to explain the saying \"in vav you shall be bound, \" according to what is known that great is the power of the righteous one who guards the holy covenant which is the channel for all good influences that descend to the world. And at the time of creation it was His blessed will that in every generation there would be a righteous foundation. And this explains \"in vav you shall be bound\" hinting to the righteous ones Jacob and Joseph who are two vavs. And this is what is said in the Shemoneh Esrei prayer formula \"God of Abraham, God of Isaac, and God of Jacob\" with an extra vav hinting to the above. And this is \"in vav you shall be bound.\" As it were, the holy Divine Presence pursues this righteous one to grasp onto him so that influences will descend through him to the Community of Israel.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Torah, Vayeshev 3"
        },
        {
            "section": "Torah",
            "topic": "Miketz",
            "number": "7",
            "passage": "ויאמר פרעה אל יוסף אני פרעה ובלעדיך לא ירים איש את ידו ואת רגלו בכל ארץ מצרים. הנ\\\"ל לרמז בזה דהנה סוד ענין יוסף שגלה למצרים ערוות הארץ כי בחי' יסוד דקדושה יתגבר ויתעלה על יסוד דטומאה. והנה זהו היה עבודתו במצרים לבטל כחות יסוד דטומאה שזהו נקראת בחי' ערוות הארץ שהיה בחי' יסוד דקליפה. ולכך המצרי' היו שטופי זמה. והנה זהו שהיה בבית פוטיפרע דוקא שהוא שר הטבחים כי בחי' שר הטבחים מבו' בזוה\\\"ק ובהאר\\\"י ז\\\"ל שהוא בחי' הוורידין נגד קו האמצעי בסוד הדעת לכן רק שם היתה עבודתו שלימה לבטל כח הדעת ויסוד דקליפה ולא יצא משם עד שבטלו. וזהו סוד ענין שנסתרס הרמז שיוסף עקרו מכל וכל כמבואר כן בספרים הקדושים ובספרא דצניעותא דצניעותא. וזהו ענין הצרעה שאמרו חכז\\\"ל שהיתה זורקת בהם מרה ומסרסתן כי כן הכנענים הם ממדה זו לכן בפ' העריות התחיל הכ' כמעשה ארץ מצרים וכמעשה ארץ כנען אשר אני מביא אתכם שמה כו' כי תועבת ה' גם שניהם והם קרובים זה לזה כנ\\\"ל. וזהו בסוד קדושת ישראל והיו עוקרים ומבטלים כח יסודם בטומאה והיו נסתרסים ע\\\"י הצרעה כנ\\\"ל. וזהו היתה עבודת יוסף הצדיק כל הימים. וזהו וירא יעקב כי יש שבר במצרים כי כן כתיב ומצבותם תשברו. וזהו שראה כי יש שבירה בקליפת מצרים.וזהו בפוטיפרע הרמז כי נצח בחי' הדכר דקליפה ונסתרס אבל בחי' הנקיבה קשה ממנו כמ\\\"ש כן באוה\\\"ח במעשה החלום הנראה אליו ע\\\"ש בפ' ויחי ע\\\"פ אסרי לגפן וכו'. ולכך כשרצה ג\\\"כ לבטלה ויבא הביתה לעשות מלאכתו כנ\\\"ל. אבל וינס ויצא החוצה וזש\\\"א הכתוב לאסור שריו בנפשו כי אסר השרים וכחות הטומאה תחתיו. וזהו וילקט יוסף את כל הכסף הנמצא בארץ מצרים ובארץ כנען. כסף לשון נכסוף ותאווה היינו תאוות הניאוף שלהם בטל מהם וזהו שהביא ביתה פרעה הוא רומז לעולם הבינה כמבו' בסה\\\"ק שהחזיר ותיקן הכל לשרשו כו'. וזהו שצוה לבסוף להמצרים שימולו כי תיקן יסוד דקליפה והחזיר הכל לקדושה ומזה היה ערב רב שנתערבו בישראל. וז\\\"ש אני פרעה היינו רמז לעולם הבינה ובלעדיך לא ירים איש את ידו הוא יו\\\"ד בחי' יסוד ואת רגלו ג\\\"כ בחי' יסוד היינו שלא ירים עוד היסוד דקליפה. וזהו וישימני לאב לפרעה ולאדון לכל ביתו. הנה בחי' אב הוא רצון ובחי' אב בחכמה כמ\\\"ש ויקרא לפניו אברך. לפרעה בחי' בינה. ולאדון ולכל ביתו. בחי' ביתו ידוע. ומושל בכל ארץ מצרים כמ\\\"ש והיתה לה' המלוכה ומושל בגוים. והבן:",
            "english_translation": "And Pharaoh said to Joseph, \"I am Pharaoh, and without you no man shall lift his hand or foot in all the land of Egypt.\" This hints at the secret matter of Joseph who was exiled to Egypt, the nakedness of the land, for the holy foundation shall overcome and rise above the foundation of impurity. This was his work in Egypt to nullify the powers of the impure foundation which is called the nakedness of the land that was the foundation of the shell. Therefore the Egyptians were steeped in lewdness. This is why he was specifically in Potiphar's house who was chief of the butchers, for the aspect of chief butcher is explained in the holy Zohar and by the Ari that it is the aspect of the veins against the middle line in the secret of knowledge, therefore only there was his work complete to nullify the power of knowledge and foundation of the shell and he did not leave until they were nullified. This is the secret matter that he was castrated, hinting that Joseph uprooted it completely as explained in the holy books and in the Book of Concealment. This is the matter of the hornet that the sages said would inject bile and castrate them for the Canaanites are from this measure therefore in the portion of forbidden relations the verse begins \"Like the practice of Egypt and like the practice of Canaan where I am bringing you\" for both are an abomination to God and they are close to each other as mentioned. This is in the secret of Israel's holiness and they would uproot and nullify the power of their foundation in impurity and they would be castrated by the hornet as mentioned. This was the work of Joseph the righteous all the days. This is \"And Jacob saw that there was grain in Egypt\" for it is written \"and break down their pillars.\" This is that he saw there was breaking in Egypt's shell. This is in Potiphar the hint that he overcame the male aspect of the shell and was castrated but the female aspect was harder than him as written in Or HaChaim in the dream matter that appeared to him see there in portion Vayechi on the verse \"Binding his foal to the vine.\" Therefore when he also wanted to nullify it \"he came into the house to do his work\" as mentioned. But \"he fled and went outside\" and this is what the verse says \"to bind his officers to his soul\" for he bound the officers and powers of impurity under him. This is \"And Joseph gathered all the money found in Egypt and Canaan.\" Money refers to desire and lust meaning their lustful desires he nullified from them and this is that he brought to Pharaoh's house which hints to the world of understanding as explained in holy books that he returned and fixed everything to its root. This is that he commanded finally to the Egyptians to circumcise for he fixed the foundation of the shell and returned everything to holiness and from this was the mixed multitude that mixed with Israel. This is what it says \"I am Pharaoh\" meaning hint to the world of understanding and \"without you no man shall lift his hand\" which is yod aspect of foundation \"and his foot\" also aspect of foundation meaning the foundation of the shell shall not rise again. This is \"He made me a father to Pharaoh and master of all his house.\" The aspect of father is will and aspect of father in wisdom as written \"And he called before him Avrech.\" To Pharaoh aspect of understanding. And master to all his house. The aspect of his house is known. And ruler in all land of Egypt as written \"And the kingdom shall be the Lord's and he will rule over nations.\" Understand.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Torah, Miketz 7"
        },
        {
            "section": "Torah",
            "topic": "Vayeshev",
            "number": "5",
            "passage": "א\\\"י וישראל אהב את יוסף מכל בניו. הנראה בענין יוסף ואחיו וקנאתם ושנאתם בו. כי יוסף הי' בחי' היסוד והי\\\"ב שבטי י\\\"ה כולם היו בחי' י\\\"ב צרופי הוי' כידוע. אשר לכל צירוף הוא עבדות אחרת כמ\\\"ש צרופה אמרתך מאד. אך בחי' יוסף הוא היסוד והצנור המקבל מכל צרופי הוי' כי לית לי' מגרמי' כלום רק מה שמשפיע לו ממדות העליונות וע\\\"י שהמדות משפיעים ליסוד הוא נעשה משפיע למטה ומכוחם נעשה. לכן בסדר תולדות השבטים נולד יוסף באחרונה הוא רמוז ליסו\\\"א כנודע. ויוסף הוא בחי' שבת שהוא שביעי לימי המעשה והוא האחרון ולא ראשון של ז' ימים מפני כי הוא בחי' היסוד ומוכרח להיות באחרונה כי הוא ניתקן ע\\\"י ז' ימי המעשה הקודמים לו. לכן השבת אין לו בן זוג רק ע\\\"י כח המעשה הטוב של ימי המעשה. וז\\\"ש וברכתו מכל הימים. הברכה באה ע\\\"י שפעת הימים ביסוד וינוחו בו כל ההשפעות. ובכן זהו הי' ענין יוסף ואחיו זהו שאמר להם והנה תסובינה אלומותיכם ותשתחוין לאלומתי. רמז להם כי אך כל עניניו באו מכחם והוא צריך להם להשפיעו על ידם. וז\\\"ש ותשתחווין לאלומתי רמז להיחוד והורדת השפע כידוע מכוונת השתחוואות של שמ\\\"ע. אבל לא נתכוון יוסף להשתרר עליהם או למלוך על אחיו ונהפוך הוא כי הוא חלק הכבוד להם להיותם משפיעים בו ולית לי' מגרמי' כלום. אבל הם חשבו בו כוונה אחרת לכך שנאוהו. אבל ישראל אהב את יוסף מכל בניו ר\\\"ל אהב ותיקן היחוד את יוסף במה שמקבל השפע מכל בניו אשר הם משפיעים לבחי' היסוד כנ\\\"ל:",
            "english_translation": "And Israel loved Joseph more than all his sons. What appears in the matter of Joseph and his brothers and their jealousy and hatred of him. For Joseph was the aspect of foundation and the twelve tribes of God were all aspects of the twelve combinations of the divine name as is known. For each combination is a different service as it is written \"Your word is very pure.\" But the aspect of Joseph is the foundation and the channel receiving from all combinations of the divine name for he has nothing of his own only what flows to him from the higher attributes and through the attributes flowing to the foundation he becomes one who gives below and from their power it is done. Therefore in the order of the tribes' generations Joseph was born last which hints to the foundation as is known. And Joseph is the aspect of Sabbath which is seventh to the days of creation and he is the last and not first of the seven days because he is the aspect of foundation and must be last because he is fixed through the seven days of creation that precede him. Therefore the Sabbath has no partner except through the power of good deeds of the workdays. And this is what is meant by \"and blessed it above all days.\" The blessing comes through the flow of the days into the foundation and all influences rest in it. And thus this was the matter of Joseph and his brothers this is what he said to them \"and behold your sheaves surrounded and bowed to my sheaf.\" He hinted to them that all his matters came from their power and he needs them to flow through them. And this is what is meant by \"and bowed to my sheaf\" hinting to the unification and bringing down of influence as is known from the intentions of the prostrations of the Amidah. But Joseph did not intend to lord over them or rule over his brothers and on the contrary he gave honor to them being that they influence him and he has nothing of his own. But they thought he had a different intention therefore they hated him. But Israel loved Joseph more than all his sons meaning he loved and fixed the unification of Joseph in what he receives flow from all his sons who influence the aspect of foundation as mentioned above.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Torah, Vayeshev 5"
        },
        {
            "section": "Torah",
            "topic": "Miketz",
            "number": "12",
            "passage": "א\\\"י בדרך הנ\\\"ל. ויזכר יוסף את החלמות אשר חלם להם. ע\\\"ד המובא בספרים כי נקודת חולם הוא הגבוה מכל הנקודות רמז לבחי' יסוד כמו הלולב שהוא גבוה במינו כאשר בחי' היסוד שהוא למעלה משבע ספירות והוא המשפיע לכולם. וכן הענין הוא בשבת הוא האחרון משבעת ימי בראשית והוא המשפיע לכל ששת הימים כנ\\\"ל. וזה הרמז בגמ' תדיר ומקודש תדיר קודם רמז לששת ימי המעשה שהם הקודמים ליום השבת שהוא המקודש והוא המשפיע לכל ששת הימים כנ\\\"ל. וז\\\"ש וישראל אהב את יוסף מכל בניו. כי מדתו של יוסף היה ג\\\"כ מדת היסוד והוא שאב השפע מכל השבטים ומשפיע להם. וז\\\"ש להם והנה תסובינה אלמותיכם כו'. אך הם הבינו כפשוטו לכן אמרו המשול תמשול בנו וכו'. אך אביו שמר את הדבר כי כן צריך להיות בכל דור צי\\\"ע צנור השפעות כמ\\\"ש חנון ורחום וצדיק. וז\\\"ש כאן ויזכר יוסף את החלמות אשר חלם להם. בחי' צדיק יסוד עולם רמז על חל\\\"ם כנ\\\"ל. ויזכר לשון השפעה בחי' דכר. ויאמר שימו לח\\\"ם אותיות חל\\\"ם בבחי' מזל\\\"א עולה לחם בגימ' ג' הויות כנ\\\"ל:",
            "english_translation": "And Joseph remembered the dreams that he had dreamed about them, according to what is brought in the books that the cholam vowel point is the highest of all vowel points, hinting at the aspect of foundation like the lulav which is highest among its kind as the aspect of foundation is above the seven sefirot and influences them all, and likewise with Shabbat which is the last of the seven days of creation and influences all six days as mentioned above, and this is hinted at in the Gemara that regular and sacred, regular comes first, hinting at the six days of work that precede the Sabbath day which is sacred and influences all six days as mentioned above, and this is what it means that Israel loved Joseph more than all his sons, for Joseph's attribute was also the attribute of foundation and he drew influence from all the tribes and influenced them, and this is what it means to them \"and behold your sheaves surrounded\" etc, but they understood it literally therefore they said \"will you indeed rule over us\" etc, but his father kept the matter for so it must be in every generation a righteous one who is a channel of influence as it is written \"gracious and merciful and righteous\", and this is what it means here \"Joseph remembered the dreams that he had dreamed about them\", the aspect of righteous foundation of the world hints at cholam as mentioned above, and \"remembered\" is language of influence aspect of male, and he said \"put bread\" letters of cholam in the aspect of mazla equals bread in gematria three times the divine name as mentioned above.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Torah, Miketz 12"
        },
        {
            "section": "Torah",
            "topic": "Vayeshev",
            "number": "6",
            "passage": "במס' ברכות דף כ\\\"ז. כשמינוהו את ר' אלעזר לנשיא א\\\"ל איזיל ואימלך באינשי ביתי' אזיל ואמליך בדביתהו. אמרה לי' דלמא מעברין לך. א\\\"ל יומא חדא לישתמש אינש בכסא דמוקרא ולמחר ליתבר א\\\"ל לית לך חיוורתא ע\\\"ש בגמ'. הנראה לרמז בזה בדבריהם ז\\\"ל כי הנה בכל דבר מעלה ומדריגה טרם תתנשא על מכונה צריך להיות לה בחי' שבירה בתחלה כמו שהי' זה בשעת בריאת העולם בראשית ברא כו'. והארץ היתה תהו ובוהו כי בתחלת הבריאה לא יכלו לסבול את האור הגדול ונשברו ונעשו בחי' תהו ואח\\\"כ נתקנו ויאמר אלהים יהי אור כי עיקר התיקון על מכונו או\\\"א להיות רק אחר השבירה והירידה מתחלתו והירידה היא צורך העלי'. וכן נאמר אצל יוסף כשהתחיל להתנשא ויאמרו לו אחיו המלוך תמלוך עלינו. כי אי אפשר לך זה רק אחר השבירה והירידה מתחלה לכך ויוסף הורד מצרימה ומשם הוא נתעלה אח\\\"כ ונתקן למלוך אמנם בחי' התיקון אחרי השבירה זה בא ע\\\"י בחי' זקן שהוא מבחי' אריך ועתיק והוא בא ע\\\"י י\\\"ג מדות שהאור עובר בהם בבחי' מדה וצמצום. וזהו הענין שהי' אצל הלוחות שהלוחות הראשונים ניתנו בפומבי ובשפע האור הרב ולכך נשברו. אבל בהלוחות השניות נאמר אצלם הי\\\"ג מדות ושכותי כפי עליך שהי' האור בחי' צמצום ומסך מעט ושם נאמר פסל לך שני לוחות אבנים כראשונים. וזה הענין בגדלות ראשון וגדלות שני האמור בכתבי האריז\\\"ל כי ההארה צריך לעבור דרך דרגין כיל\\\"ח. וזה הענין שאמרו בגמ' כי האדם במעי אמו מתחלה הוא יודע כל התורה ואח\\\"כ בצאתו בא מלאך וסטרו על פיו ומשכח הכל כי כן צריך להיות בחי' ההארה והידיעה באדם מתרבה והולכת עמו מעט מעט כפי שניו דרך דרגין דאם לא כן לא הי' יכול לסבול את האור הגדול הקודם. ולכך בא מלאך וסטרו על פיו הוא בחי' השבירה כמו שנתבאר. הנה זה הענין אצל ר\\\"א בן עזרי' כשבא להיות נשיא פתאום א\\\"ל דלמא מעברין לך כי ההתנשאות צריך להיות בחי' שבירה בתחלה כנ\\\"ל. וזה שא\\\"ל יומא חדא לישתמש אינש בכסא דמוקרא ולמחר ליתבר. כי אחרי הבריאה מתחלה בחי' יום אחד ולמחר ליתבר נעשה השבירה. וזה שא\\\"ל והא לית לך חיוורתא כי צריך להמשיך מבחי' י\\\"ג מדות חוורתי כמו שהי' אצל יוסף בצאתו לאסור שריו בנפשו וזקניו יחכם מהזקן עד החכמה זקן זה שקנה חכמה. וזה שאמרו שם ההוא יומא בר י\\\"ח שנין הוה אתעביד לי' ניסא ואהדרי לי' תמני סרי דרי חיורתא. הוא כמו שנתבאר בע\\\"ח בחי' ברכאין. וזהו רמז על י\\\"ג תקוני דיקנא דא\\\"א וה' ראשונים שלו כיל\\\"ח ע\\\"ש.וזהו תמני סרי דרי חיוורתא מבחי' הזקן שלמעלה כמו שנתבאר:",
            "english_translation": "In Tractate Berachot page 27, when they appointed Rabbi Elazar as Nasi, he said \"I will go and consult with my household.\" He went and consulted with his wife. She said to him \"Perhaps they will remove you.\" He said to her \"Let a person use a precious cup for one day, and if it breaks tomorrow, let it break.\" She said to him \"You have no white hair.\" The hint in this appears to be that in every matter of elevation and rank, before it can be established firmly, it must first experience breaking, as was the case during the creation of the world \"In the beginning created etc.\" and \"The earth was formless and void\" because at the beginning of creation they could not bear the great light and broke and became chaos, and afterward were fixed \"And God said let there be light\" for the main fixing in its proper place can only come after the breaking and initial descent, and the descent is necessary for ascent. And so it is said regarding Joseph when he began to rise up, his brothers said to him \"Will you indeed reign over us.\" For this is impossible except after breaking and initial descent, therefore \"Joseph was brought down to Egypt\" and from there he was later elevated and established to rule. However, the aspect of fixing after breaking comes through the aspect of elder which is from the aspect of Arich and Atik and comes through the 13 attributes through which the light passes in measured and constrained form. And this is the matter that occurred with the tablets, that the first tablets were given publicly with abundant light and therefore broke. But with the second tablets the 13 attributes were stated and \"I will cover you with My hand\" where the light was constrained and slightly screened, and there it says \"Carve for yourself two stone tablets like the first ones.\" And this is the matter of first maturity and second maturity mentioned in the writings of the Arizal, for the illumination must pass through levels gradually. And this is what they said in the Gemara that a person in his mother's womb initially knows the entire Torah and afterward when he emerges an angel comes and strikes him on his mouth and he forgets everything, for so must the illumination and knowledge in a person increase gradually with his years through levels, for if not he would not be able to bear the great prior light. Therefore an angel comes and strikes his mouth which is the aspect of breaking as explained. This is the matter with Rabbi Elazar ben Azariah when he came to be Nasi suddenly, she said to him \"Perhaps they will remove you\" for elevation requires initial breaking as mentioned. And this is what he said \"Let a person use a precious cup for one day and tomorrow let it break.\" For after creation initially there is one day and tomorrow breaking occurs. And this is what she said to him \"But you have no white hair\" for one must draw from the aspect of 13 white attributes as was with Joseph when he went out to bind his officers to his soul and his elders became wise from the elder to wisdom - an elder who has acquired wisdom. And this is what they said there that on that day he was eighteen years old and a miracle occurred and eighteen rows of white hair appeared. This is as explained in Etz Chaim regarding blessings. And this hints to the 13 fixes of the beard of Arich Anpin and its first five as known there. And these are the eighteen rows of white from the aspect of the supernal beard as explained.",
            "average_score": 8.0,
            "reference": "Tiferet Shlomo, on Torah, Vayeshev 6"
        },
        {
            "section": "Torah",
            "topic": "Miketz",
            "number": "11",
            "passage": "ויזכר יוסף את החלמות אשר חלם להם כו'. הנ\\\"ל לרמז בזה עפ\\\"י מ\\\"ש חכז\\\"ל בני חיי ומזוני לאו בזכותא תליא מלתא אלא במזלא. מזל\\\"א עולה ע\\\"ח בגימט' לחם כמנין ג' הויות. וזה היה ענין החלם שהיה בכחו של יוסף להפוך על אותיות לחם להשפיע להם כל טוב אם היו אז השבטים מסכימים עמו בתחלה. אך עתה כאשר באו אחי יוסף היה היחוד בשלימות כתיב ויזכר יוסף כו' לשון זכרות והשפעה. את החלמות אשר חלם להם. להפוך לטוב להביא להם השפעות הרומז ללח\\\"ם כנ\\\"ל לזה אמר שימו לחם. רמז שם יו\\\"ד שיהיה השפע מן הקדושה. כמ\\\"ש פותח את ידיך יודי\\\"ך. ואז תרד ההשפעה רק לזרע קודש בנ\\\"י. כמ\\\"ש וישימו לו לבדו ולהם לבדם ולמצרים האוכלים אתם לבדם כי לא יוכלון המצרים כו' כי מנע מהם השפע לבל יבוזו זרים כנ\\\"ל. ובזה יש לרמז מ\\\"ש בגמ' שבת דף ך\\\"א ע\\\"ב. בשעת הסכנה מניחו על שולחנו ודיו. לרמז על ההשפעות ופרנסות בנ\\\"י שיהיה בניקל כמ\\\"ש כי לא במסכנות תאכל בה לחם. וזה מניחו על שלחנו הוא שפע הפרנסה. ודי\\\"ו אותיות יו\\\"ד פותח את ידך וכו' כנ\\\"ל:",
            "english_translation": "And Joseph remembered the dreams that he had dreamed of them, and behold according to what our sages said children life and sustenance do not depend on merit but on fortune, fortune equals 78 in gematria bread like the number of three havayot and this was the matter of the dream that was in Joseph's power to transform the letters of bread to bestow upon them all good if the tribes had agreed with him at first but now when Joseph's brothers came the unity was complete it is written and Joseph remembered etc language of masculinity and influence the dreams that he dreamed of them to turn to good to bring them influences alluding to bread as mentioned therefore he said put bread hinting at the name yud that the abundance would be from holiness as written you open your hands your yuds and then the influence would descend only to the holy seed of Israel as written and they set for him alone and for them alone and for the Egyptians eating with them alone for the Egyptians could not etc for he prevented the abundance from them lest strangers plunder as mentioned and in this there is a hint to what is written in the Talmud Shabbat page 21b in time of danger he places it on his table and that is sufficient hinting at the influences and livelihoods of Israel that it would be easy as written for not in poverty shall you eat bread in it and this placing it on his table is the abundance of livelihood and dyo letters yud you open your hand etc as mentioned",
            "average_score": 7.0,
            "reference": "Tiferet Shlomo, on Torah, Miketz 11"
        },
        {
            "section": "Torah",
            "topic": "Vayeshev",
            "number": "8",
            "passage": "ויאמר יעקב הלא אחיך רועים בשכם כו' לך נא ראה את שלום אחיך כו'. יש להמשיך הכתובים הנ\\\"ל בדרך רמז. עפ\\\"י הגמרא ברכות דף ג' ע\\\"א.אמר ר' יוסי פעם אחת כו' ונכנסתי לחורבה אחת מחורבות ירושלים להתפלל בא אליהו כו' ושמר לי על הפתח כו' ואמר לי בני מפני מה נכנסת לחורבה זו אמרתי לו להתפלל ואמרלי הי' לך להתפלל בדרך. יבואר עפ\\\"י מה שמצינו בספרים פי' על המאמר בפרקי אבות דע מה למעלה ממך. פי' לפי גודל הצער שהאדם יש לו בדוחק ובצער יש להתבונן מה שנוגע למעלה בכפלי כפליים בצער גלות השכינה כביכיל עמו אנכי בצרה. וזה דע מה למעלה ממך מן הצער שלך תדע הצער שלמעלה כביכול. לכן היו כמה צדיקים אשר לא הסתכלו כלל על דוחק וצער של בנ\\\"י רק על כללות צער השכינה וכל ימיהם רק זאת הם מצפים ומיחלים על גדלות הבורא ב\\\"ה בקנאת ה' צבאות כמ\\\"ש באליהו הנביא ע\\\"ה קנא קנאתי כו'. אכן בדור שלאחריו יונה בן אמיתי שהי' תלמידו של אליהו לא רצה ללכת בשליחות הנבואה אל נינוה שלא יהי' ח\\\"ו קטרוג על בנ\\\"י כידוע. כי באמת לא זו הדרך ישכון אור הצלחת הצדיק רק כאשר יסתכל ג\\\"כ על טובת בנ\\\"י לעורר עליהם רחמים וחסדים ולהצטער בצרתם. ועיין בעין יעקב בהכותב בפי' הגמ' אר\\\"י פעם אחת נכנסתי לחורבה אחת מחורבות ירושלים. פי' מחשבתו הי' להצטער בצער גלות השכינה וזה חורבות ירושלים. ובא אליהו ושמר על הפתח. אמר לו הי' לך להתפלל בדרך. פי' בעוד שהם הולכים בדרך שהם בגלות להתפלל עליהם להשפיע להם כל טוב להצילם מעניים ומרודם וזה הרמז בפ' הנ\\\"ל באחי יוסף והנה אנחנו מאלמים אלומים בתוך השדה. פי' שהיו מצטערים בצער גלות השכינה ועל חורבן ירושלים דכתיב ציון שדה תחרש והיו מצפים רק על רוממת כבודו ית\\\"ש.וז\\\"ש ג\\\"כ כאן הלא אחיך רועים בשכ\\\"ם ר\\\"ת ברוך שם כבוד מלכותו. וז\\\"ש לו יעקב לך נא ראה את שלום אחיך לראות בטובתם ולהשפיע להם בעודם בגלות. וז\\\"ש וימצאהו איש ויאמר לו מה תבקש. ר\\\"ל מהו עיקר בקשתך. כי על צער גלות השכינה לבד איננה צריכה לרחמנות שלנו כי כביכול הש\\\"י הוא כל יכול לעזור א\\\"ע כרגע כמ\\\"ש ואתה ה' לעולם תשב. רק למה לנצת תשכחנו תעזבנו לאורך ימים. עיקר הצער על אורך הגלות שאנו בנ\\\"י דווים וסחופים. לכן כאשר שמע יוסף דברים הללו השיב לו את אחי אנכי מבקש. פי' טובתם של בנ\\\"י אני מבקש ומצפה לראות בטובתם וישועת' לנצח. ולעורר רחמים עליהם:",
            "english_translation": "And Jacob said, \"Are not your brothers shepherding in Shechem? Go now, see the welfare of your brothers.\" The above verses can be connected through allusion, according to the Talmud Berachot page 3a. Rabbi Yosi said one time I entered one of the ruins of Jerusalem to pray, and Elijah came and guarded the entrance, and said to me, \"My son, why did you enter this ruin?\" I said to him, \"To pray, \" and he said to me, \"You should have prayed on the road.\" This is explained according to what we find in the books interpreting the saying in Pirkei Avot \"Know what is above you.\" According to the greatness of the suffering that a person has in distress and pain, one should contemplate what affects above in multiple times the pain of the exile of the Divine Presence, as it were \"I am with him in distress.\" This is \"know what is above you\" - from your pain you should know the pain above, as it were. Therefore there were many righteous ones who did not look at all at the distress and pain of the Children of Israel, only at the general pain of the Divine Presence, and all their days they only anticipated and hoped for the greatness of the Creator, blessed be He, in the zealousness of the Lord of Hosts, as it is written regarding Elijah the Prophet, \"I have been very zealous.\" However, in the generation after him, Jonah son of Amitai, who was Elijah's student, did not want to go on the prophetic mission to Nineveh so there would not be, Heaven forbid, prosecution against the Children of Israel, as is known. For truly this is not the path where the light of the righteous one's success dwells, only when he also looks at the good of the Children of Israel to arouse mercy and kindness for them and to feel pain in their distress.",
            "average_score": 7.0,
            "reference": "Tiferet Shlomo, on Torah, Vayeshev 8"
        }
    ],
    "timestamp": "2024-12-24T20:13:33.072031",
    "metadata": {
        "total_passages_processed": 78,
        "selection_criteria": "Passages with average score above 7.0",
        "scoring_version": "3.0"
    }
}